{
  "songTitle": "Buộc lưng con ếch",
  "totalSyllables": 39,
  "segmentedBy": "Claude LLM (punctuation-aware)",
  "segmentationDate": "2025-10-03",
  "v3EnhancementDate": "2025-10-05",
  "enhancementVersion": "V3.0 DEEP",

  "figurativeExpressions": [
    {
      "id": 1,
      "vietnamese": "Buộc lưng con ếch",
      "literal": "tie the frog's waist",
      "meaning": "attempting an impossible or absurdly difficult task - the frog's slippery, waistless body makes tying impossible",

      "culturalWeights": {
        "historicalDepth": 7,
        "explanation": "Folk riddle tradition in Vietnam dates back centuries, with animal-based riddles documented in colonial period (150+ years) and likely much older in oral tradition",

        "regionalSpecificity": 5,
        "explanation": "Animal riddles common across Vietnam, not region-specific. Frog imagery universal in wet rice agriculture culture throughout lowland Vietnam",

        "symbolicLoad": 6,
        "explanation": "Moderate symbolic weight - frog represents slipperiness, impossibility, and agricultural life. Metaphorically signifies futile efforts but not deep philosophical symbolism",

        "ritualSignificance": 3,
        "explanation": "Low ritual significance - folk riddles are entertainment and education, not ceremonial. Used in children's play and communal gatherings but not sacred contexts",

        "transmissionImportance": 7,
        "explanation": "Important for oral tradition transmission - riddles teach language play, problem-solving, and cultural humor. Essential pedagogical tool passed parent to child",

        "emotionalResonance": 6,
        "explanation": "Moderate emotional impact - creates humor, puzzlement, shared amusement. Nostalgic for adults recalling childhood riddle games"
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "Three layers: (1) Literal impossibility (frog has no waist), (2) Metaphor for futile effort, (3) Cultural humor about absurd scenarios",

        "crossDomainMapping": 7,
        "explanation": "Moderate-strong metaphorical mapping: PHYSICAL_IMPOSSIBILITY → FUTILE_EFFORT. Concrete animal anatomy mapped to abstract concept of wasted endeavor",

        "culturalPrerequisites": 4,
        "explanation": "Moderate knowledge needed - requires familiarity with Vietnamese riddle format, frog anatomy/behavior, and folk humor aesthetics",

        "idiomaticity": 7,
        "explanation": "Highly idiomatic - 'buộc lưng ếch' is semi-fixed expression in riddle context. Recognized phrase pattern though not frozen proverb",

        "contextDependence": 5,
        "explanation": "Moderately context-dependent - works as standalone riddle but fuller meaning emerges in playful, interactive folk song performance",

        "pedagogicalChallenge": 5,
        "explanation": "Moderate difficulty - concept of impossible task is universal, but specific cultural framing (riddle format, frog imagery) requires cultural context"
      },

      "semanticNetwork": {
        "sourceDomain": "PHYSICAL_ANATOMY",
        "targetDomain": "FUTILE_EFFORT",
        "mappings": [
          {
            "source": "frog's slippery body",
            "target": "elusive goal"
          },
          {
            "source": "lack of waist to tie",
            "target": "absence of solution"
          },
          {
            "source": "attempting to tie",
            "target": "wasted effort"
          },
          {
            "source": "frog escaping",
            "target": "inevitable failure"
          }
        ],
        "conceptualMetaphor": "FUTILE_EFFORT_IS_TYING_A_WAISTLESS_ANIMAL"
      },

      "usagePatterns": {
        "phrasePosition": "beginning_and_middle",
        "explanation": "Appears at opening (phrase 1) establishing riddle premise, and middle (phrase 4) reinforcing challenge",

        "syntacticRole": "verb_phrase",
        "explanation": "Functions as verb phrase 'buộc lưng' (tie waist) with object 'con ếch' (frog). Grammatically complete action description",

        "discourseFunction": "riddle_premise",
        "explanation": "Establishes impossible scenario that drives riddle structure. Creates puzzle for audience to contemplate",

        "participationPattern": "call_response",
        "explanation": "Singer poses riddle, audience attempts solution. Interactive format with 'đố ai' (bet you can't) inviting engagement",

        "emotionalValence": "humorous",
        "explanation": "Playful, lighthearted tone. Absurdity creates laughter and shared amusement in folk song context"
      },

      "statistics": {
        "occurrences": 2,
        "phraseIds": [1, 4],
        "totalPhrases": 5,
        "coverage": "40%",
        "positionDistribution": {
          "beginning": 1,
          "middle": 1,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 6,
        "explanation": "Moderately unique - specific frog-tying imagery distinctive to this riddle, but impossibility metaphors common in Vietnamese folk tradition",

        "similarExpressions": [
          {
            "expression": "đổ nước vào chum bị lủng (pour water into cracked pot)",
            "similarity": "high",
            "difference": "Both express futility, but chum lủng is serious proverb, buộc ếch is playful riddle"
          },
          {
            "expression": "bắt cá hai tay (catch fish with two hands)",
            "similarity": "medium",
            "difference": "Both use aquatic animals for impossibility, but bắt cá implies attempting too much simultaneously"
          },
          {
            "expression": "đòi đâu được đấy (demand the impossible)",
            "similarity": "medium",
            "difference": "Direct expression of impossibility without animal imagery or humor"
          }
        ],

        "regionalDistribution": "Nationwide - folk riddles with animal imagery found across all Vietnamese regions (Northern, Central, Southern)",

        "genreDistribution": "Children's riddle songs (ca dao đố), folk entertainment songs, educational folk songs",

        "historicalPersistence": "Long-standing - animal riddles documented in early 20th century collections, likely centuries older in oral tradition"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Voice: Use playful, teasing tone when singing 'buộc lưng con ếch' - emphasize the absurdity",
          "Gesture: Mime tying motion with hands at first 'buộc', show slippery frog escaping",
          "Rhythm: Slight pause after 'ếch' to let audience visualize impossible task",
          "Facial expression: Puzzled, exaggerated confusion to embody riddle's challenge",
          "Interaction: Make eye contact with audience during 'đố ai' - invite them into riddle"
        ],

        "culturalSensitivity": [
          "Recognize folk riddles as sophisticated oral literature, not simplistic children's entertainment",
          "Understand animal imagery reflects agricultural life - frogs are familiar, not exotic",
          "Avoid mocking or trivializing - riddles encode cultural wisdom about realistic expectations",
          "Respect playful use of impossibility - Vietnamese humor often works through absurdity"
        ],

        "pedagogicalApproach": [
          "Step 1: Introduce Vietnamese riddle format - 'đố' (bet/challenge) structure and interactive nature",
          "Step 2: Discuss frog anatomy - why tying waist is impossible (no waist, slippery skin)",
          "Step 3: Explore metaphorical meaning - when do we attempt 'impossible' tasks in life?",
          "Step 4: Compare to other impossibility idioms across cultures (pushing rope, herding cats)",
          "Step 5: Practice performance with playful tone and audience interaction",
          "Assessment: Students create own animal-based impossibility riddle using Vietnamese folk pattern"
        ],

        "commonMisinterpretations": [
          "❌ 'Literal instruction to tie a frog' → ✅ Metaphorical riddle about futility",
          "❌ 'Cruel to animals' → ✅ Playful thought experiment, not actual animal treatment",
          "❌ 'Simple children's nonsense' → ✅ Sophisticated cultural teaching about realistic expectations",
          "❌ 'Only about frogs' → ✅ Broader metaphor applicable to any futile endeavor"
        ]
      }
    },

    {
      "id": 2,
      "vietnamese": "ruột ốc quằn queo",
      "literal": "intestines twist like a snail",
      "meaning": "extreme internal discomfort, confusion, or emotional turmoil - visceral metaphor combining bodily distress with spiral snail imagery",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Visceral metaphors using internal organs common in Vietnamese tradition for 150+ years. 'Ruột' (intestines/guts) frequently appears in emotional expressions",

        "regionalSpecificity": 5,
        "explanation": "Used nationwide but particularly common in Central and Southern Vietnam where snails (ốc) are dietary staple and familiar imagery",

        "symbolicLoad": 7,
        "explanation": "Strong symbolic load - 'ruột' symbolizes deep emotional core (like English 'gut feeling'). Spiral snail shell represents confusion, complexity, being trapped",

        "ritualSignificance": 2,
        "explanation": "Low ritual significance - used in everyday expression and folk songs but not ceremonial contexts",

        "transmissionImportance": 6,
        "explanation": "Important for preserving Vietnamese visceral metaphor system - teaches how emotions expressed through body imagery",

        "emotionalResonance": 8,
        "explanation": "Strong emotional impact - visceral imagery makes abstract discomfort tangibly felt. Resonates with anyone who's experienced confusion or distress"
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "Four layers: (1) Literal organ twisting, (2) Physical discomfort sensation, (3) Emotional turmoil, (4) Mental confusion (spiral = can't think straight)",

        "crossDomainMapping": 8,
        "explanation": "Complex abstract mapping: INTERNAL_ORGANS + SPIRAL_MOTION → EMOTIONAL_TURMOIL. Two source domains (anatomy + geometry) map to psychological state",

        "culturalPrerequisites": 6,
        "explanation": "Requires understanding Vietnamese somatic metaphor system (emotions in body parts), snail symbolism, and visceral expression conventions",

        "idiomaticity": 8,
        "explanation": "Highly idiomatic - 'ruột quằn queo' is fixed expression, adding 'ốc' intensifies with specific animal imagery. Semi-frozen phrase pattern",

        "contextDependence": 6,
        "explanation": "Moderately context-dependent - meaning clear from expression but intensity varies by situation (mild confusion vs profound distress)",

        "pedagogicalChallenge": 7,
        "explanation": "Challenging for non-natives - requires understanding somatic metaphor system, Vietnamese organ symbolism, and comfort with visceral imagery"
      },

      "semanticNetwork": {
        "sourceDomain": "VISCERAL_ANATOMY + SPIRAL_GEOMETRY",
        "targetDomain": "PSYCHOLOGICAL_DISTRESS",
        "mappings": [
          {
            "source": "intestines (ruột)",
            "target": "emotional core/gut feelings"
          },
          {
            "source": "snail shell spiral",
            "target": "confused mental state"
          },
          {
            "source": "twisting motion (quằn queo)",
            "target": "emotional agitation"
          },
          {
            "source": "physical pain sensation",
            "target": "psychological suffering"
          }
        ],
        "conceptualMetaphor": "EMOTIONAL_TURMOIL_IS_VISCERAL_SPIRAL_MOTION"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears in phrase 2, central position describing consequence of impossible task attempt",

        "syntacticRole": "predicate",
        "explanation": "Functions as predicate describing state - 'ruột ốc quằn queo' is complete descriptive phrase",

        "discourseFunction": "consequence_description",
        "explanation": "Describes emotional/physical result of attempting futile task - creates vivid imagery of distress",

        "participationPattern": "listening_empathetic",
        "explanation": "Audience listens and empathizes with visceral description - shared human experience of confusion and discomfort",

        "emotionalValence": "negative_humorous",
        "explanation": "Negative content (discomfort) but presented playfully in riddle context - distress is exaggerated for comic effect"
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [2],
        "totalPhrases": 5,
        "coverage": "20%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 6,
        "explanation": "Moderately unique - 'ruột quằn queo' is common expression, but adding 'ốc' (snail) is distinctive variation intensifying spiral imagery",

        "similarExpressions": [
          {
            "expression": "ruột gan như đốt (guts burn like fire)",
            "similarity": "high",
            "difference": "Both use ruột (guts) for distress, but đốt is pain imagery, quằn queo is motion/confusion"
          },
          {
            "expression": "lòng như lửa đốt (heart burns like fire)",
            "similarity": "medium",
            "difference": "Similar emotional distress but uses heart (lòng) not guts, fire not spiral motion"
          },
          {
            "expression": "bối rối như tơ vò (confused like tangled silk)",
            "similarity": "medium",
            "difference": "Both use tangled/twisted imagery for confusion, but silk is external, ruột is visceral"
          }
        ],

        "regionalDistribution": "Nationwide with variations - 'ruột quằn queo' standard, Central/South may emphasize 'ốc' given dietary familiarity",

        "genreDistribution": "Folk songs describing hardship, love pain, difficult situations. Common in ca dao (folk poetry)",

        "historicalPersistence": "Long-standing - visceral metaphors documented in classical Vietnamese literature and continuing in modern usage"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Voice: Use wavering, trembling vocal quality when singing 'quằn queo' - voice embodies twisting",
          "Pronunciation: Emphasize 'qu-' consonant cluster - creates spiral sound effect",
          "Body: Twist torso or hands in spiral motion during 'quằn queo quằn queo' - visualize the metaphor",
          "Pacing: Slow down on this phrase - let audience feel the discomfort viscerally",
          "Facial expression: Grimace or show confusion - make internal distress externally visible"
        ],

        "culturalSensitivity": [
          "Understand visceral metaphors are culturally acceptable in Vietnamese - not crude or inappropriate",
          "Recognize 'ruột' (intestines) is respectful metaphor for emotional core, like English 'gut feeling'",
          "Appreciate somatic metaphor system - Vietnamese culture locates emotions in specific body parts",
          "Don't sanitize or soften - visceral intensity is the cultural point"
        ],

        "pedagogicalApproach": [
          "Step 1: Introduce Vietnamese somatic metaphor system - emotions in body parts (tim=love, ruột=deep feelings)",
          "Step 2: Explain snail imagery - spiral shell as symbol of confusion, being trapped in circular thinking",
          "Step 3: Practice 'quằn queo' pronunciation and meaning - demonstrate twisting motion",
          "Step 4: Compare to English visceral expressions (gut-wrenching, stomach churning)",
          "Step 5: Discuss cultural differences - why Vietnamese use intestines, not stomach/heart",
          "Assessment: Students explain own emotional state using Vietnamese visceral metaphor pattern"
        ],

        "commonMisinterpretations": [
          "❌ 'Literal intestinal disease' → ✅ Metaphorical emotional/mental distress",
          "❌ 'Inappropriate body reference' → ✅ Culturally acceptable somatic metaphor",
          "❌ 'Only physical pain' → ✅ Psychological confusion and emotional turmoil",
          "❌ 'Snail is random' → ✅ Spiral shell deliberately chosen to symbolize confused, circular mental state"
        ]
      }
    },

    {
      "id": 3,
      "vietnamese": "quằn queo quằn queo",
      "literal": "writhe and twist, writhe and twist",
      "meaning": "intensified expression of twisting motion through double reduplication - emphasizes continuous, extreme discomfort or difficulty",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Double reduplication pattern ancient in Vietnamese - documented in early literature and folk traditions. Intensification through repetition is core linguistic feature",

        "regionalSpecificity": 4,
        "explanation": "Double reduplication common across all Vietnamese regions, not region-specific. Universal linguistic pattern",

        "symbolicLoad": 5,
        "explanation": "Moderate symbolic load - represents extreme emphasis, continuous action, rhythmic motion. More linguistic technique than deep symbolism",

        "ritualSignificance": 1,
        "explanation": "Minimal ritual significance - purely rhetorical/musical device, not ceremonial",

        "transmissionImportance": 7,
        "explanation": "Important for teaching Vietnamese reduplication system - demonstrates how doubling creates intensification and rhythm",

        "emotionalResonance": 6,
        "explanation": "Moderate emotional impact - rhythmic repetition makes discomfort feel ongoing, relentless, emphasizing suffering"
      },

      "complexityMetrics": {
        "layersOfMeaning": 2,
        "explanation": "Two layers: (1) Literal motion description (twisting), (2) Intensified/continuous emphasis through doubling",

        "crossDomainMapping": 4,
        "explanation": "Moderate mapping: REPETITION → INTENSIFICATION. Linguistic doubling maps to increased severity/duration of action",

        "culturalPrerequisites": 5,
        "explanation": "Requires understanding Vietnamese từ láy (reduplication) system and how doubling creates emphasis/continuity",

        "idiomaticity": 6,
        "explanation": "Moderately idiomatic - 'quằn queo' is semi-fixed, doubling it follows productive pattern but creates stronger idiom",

        "contextDependence": 4,
        "explanation": "Low context-dependence - reduplication pattern's intensifying function is consistent across contexts",

        "pedagogicalChallenge": 6,
        "explanation": "Moderate-high difficulty - requires understanding both base expression AND reduplication intensification system"
      },

      "semanticNetwork": {
        "sourceDomain": "LINGUISTIC_REPETITION",
        "targetDomain": "INTENSITY_AND_DURATION",
        "mappings": [
          {
            "source": "saying twice",
            "target": "doing more intensely"
          },
          {
            "source": "rhythmic pattern",
            "target": "continuous action"
          },
          {
            "source": "phonetic doubling",
            "target": "emotional amplification"
          }
        ],
        "conceptualMetaphor": "MORE_REPETITION_IS_MORE_INTENSITY"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears in phrase 2, within description of consequence - emphasizes distress duration",

        "syntacticRole": "adverbial_intensifier",
        "explanation": "Functions as adverbial modifier intensifying main predicate 'ruột ốc quằn queo'",

        "discourseFunction": "rhythmic_emphasis",
        "explanation": "Creates rhythmic pattern mirroring twisting motion, emphasizes continuous distress",

        "participationPattern": "listening_rhythmic",
        "explanation": "Audience follows rhythmic repetition - may sway or move with the pattern",

        "emotionalValence": "emphatic",
        "explanation": "Neutral valence but strong emphasis - makes whatever emotion is present feel more intense"
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [2],
        "totalPhrases": 5,
        "coverage": "20%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 4,
        "explanation": "Low uniqueness - double reduplication is common Vietnamese pattern. Productive linguistic feature rather than unique expression",

        "similarExpressions": [
          {
            "expression": "đau đớn đau đớn (pain pain pain pain)",
            "similarity": "high",
            "difference": "Same doubling pattern for emphasis, different base word (pain vs twist)"
          },
          {
            "expression": "vui vẻ vui vẻ (happy happy happy happy)",
            "similarity": "high",
            "difference": "Same structure, opposite valence (positive vs negative emotion)"
          },
          {
            "expression": "lắc lư lắc lư (sway sway sway sway)",
            "similarity": "high",
            "difference": "Same motion reduplication pattern, different physical action"
          }
        ],

        "regionalDistribution": "Universal across Vietnam - double reduplication is pan-Vietnamese linguistic feature",

        "genreDistribution": "Folk songs, poetry, everyday speech - common wherever emphasis or rhythm desired",

        "historicalPersistence": "Ancient to present - reduplication documented in earliest Vietnamese texts, continuing robustly today"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Rhythm: Maintain steady beat through double reduplication - creates driving pulse",
          "Voice: Slightly crescendo from first to second pair (quằn queo → QUẰN QUEO)",
          "Articulation: Crisp pronunciation of all four words - don't blur the repetition",
          "Physical: Repeat twisting gesture - body moves with each 'quằn queo' pair",
          "Tempo: Keep consistent speed - regularity emphasizes ongoing, relentless quality"
        ],

        "culturalSensitivity": [
          "Recognize reduplication as sophisticated linguistic tool, not simple repetition",
          "Understand Vietnamese từ láy system has specific rules and meanings",
          "Appreciate how doubling creates musicality in language - Vietnamese is tonal and rhythmic",
          "Don't dismiss as redundant - each repetition adds semantic and aesthetic value"
        ],

        "pedagogicalApproach": [
          "Step 1: Introduce Vietnamese từ láy (reduplication) - types and functions",
          "Step 2: Explain single reduplication 'quằn queo' (partial reduplication for emphasis)",
          "Step 3: Demonstrate doubling pattern - how two becomes four for intensification",
          "Step 4: Practice rhythmic pronunciation - emphasize musicality of repetition",
          "Step 5: Compare to English intensifiers (very very, again and again)",
          "Assessment: Students create own doubled reduplication for intensity/duration"
        ],

        "commonMisinterpretations": [
          "❌ 'Redundant repetition' → ✅ Deliberate intensification through doubling",
          "❌ 'Lazy lyric writing' → ✅ Sophisticated use of linguistic pattern for effect",
          "❌ 'Can remove second pair' → ✅ Doubling essential to meaning - shows ongoing/extreme action",
          "❌ 'Just for rhythm' → ✅ Serves both rhythmic AND semantic intensification functions"
        ]
      }
    },

    {
      "id": 4,
      "vietnamese": "đố ai",
      "literal": "bet/challenge who",
      "meaning": "classic Vietnamese folk riddle challenge formula inviting audience to solve or attempt impossible task",

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Ancient riddle formula - 'đố' appears in earliest Vietnamese folk song collections, likely pre-dating written records (500+ years oral tradition)",

        "regionalSpecificity": 3,
        "explanation": "Universal across Vietnam - 'đố ai' is pan-Vietnamese riddle marker found in all regions identically",

        "symbolicLoad": 5,
        "explanation": "Moderate symbolic load - symbolizes communal knowledge testing, playful competition, oral tradition pedagogy",

        "ritualSignificance": 4,
        "explanation": "Moderate ritual significance - riddles have ceremonial role in lunar new year, harvest festivals, wedding games",

        "transmissionImportance": 9,
        "explanation": "Critical for oral tradition - 'đố ai' formula is DNA of Vietnamese riddle transmission, essential cultural marker",

        "emotionalResonance": 7,
        "explanation": "Strong emotional resonance - triggers nostalgia, playful challenge, communal bonding through shared riddle tradition"
      },

      "complexityMetrics": {
        "layersOfMeaning": 2,
        "explanation": "Two layers: (1) Literal challenge/bet meaning, (2) Genre marker identifying folk riddle format",

        "crossDomainMapping": 3,
        "explanation": "Minimal metaphor - relatively literal challenge statement. QUESTION → GAME mapping but straightforward",

        "culturalPrerequisites": 6,
        "explanation": "Requires understanding Vietnamese riddle tradition, interactive performance norms, and playful challenge conventions",

        "idiomaticity": 9,
        "explanation": "Completely frozen - 'đố ai' is fixed formula, invariable riddle marker. Cannot be altered or substituted",

        "contextDependence": 7,
        "explanation": "Highly context-dependent - meaning shifts based on riddle content following it. Can be serious or playful",

        "pedagogicalChallenge": 4,
        "explanation": "Moderate ease - concept of riddle challenge is universal, though specific Vietnamese format requires teaching"
      },

      "semanticNetwork": {
        "sourceDomain": "COMPETITIVE_CHALLENGE",
        "targetDomain": "KNOWLEDGE_TESTING",
        "mappings": [
          {
            "source": "betting/wagering (đố)",
            "target": "intellectual challenge"
          },
          {
            "source": "challenger vs challenged",
            "target": "riddle poser vs solver"
          },
          {
            "source": "winning bet",
            "target": "solving riddle"
          }
        ],
        "conceptualMetaphor": "RIDDLE_IS_COMPETITIVE_BET"
      },

      "usagePatterns": {
        "phrasePosition": "middle_and_refrain",
        "explanation": "Appears in phrases 3 and 4 - marks riddle challenge point and reinforces impossibility",

        "syntacticRole": "discourse_marker",
        "explanation": "Functions as discourse marker signaling riddle/challenge section, not part of propositional content",

        "discourseFunction": "challenge_invitation",
        "explanation": "Invites audience participation, shifts from description to interactive challenge",

        "participationPattern": "call_response",
        "explanation": "Singer issues 'đố ai' challenge, audience responds with attempts or laughter",

        "emotionalValence": "playful_competitive",
        "explanation": "Friendly competition, playful challenge - not aggressive but inviting fun"
      },

      "statistics": {
        "occurrences": 2,
        "phraseIds": [3, 4],
        "totalPhrases": 5,
        "coverage": "40%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 2,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 2,
        "explanation": "Very low uniqueness - 'đố ai' is universal Vietnamese riddle formula, found in thousands of folk songs identically",

        "similarExpressions": [
          {
            "expression": "ai biết không? (who knows?)",
            "similarity": "high",
            "difference": "Both question knowledge, but 'ai biết' is genuine inquiry, 'đố ai' is playful challenge"
          },
          {
            "expression": "thử coi (try and see)",
            "similarity": "medium",
            "difference": "Both challenge attempt, but 'thử coi' is general, 'đố ai' is riddle-specific"
          },
          {
            "expression": "English 'Riddle me this'",
            "similarity": "high",
            "difference": "Both are riddle markers, 'đố ai' more interactive/competitive"
          }
        ],

        "regionalDistribution": "Identical across all Vietnamese regions - 'đố ai' is pan-Vietnamese with no dialectal variation",

        "genreDistribution": "Ca dao đố (riddle folk songs), children's songs, folk poetry with riddle elements",

        "historicalPersistence": "Ancient to present - appears in earliest folk song collections, continuing unchanged in modern children's songs"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Voice: Raise pitch on 'đố' - create questioning, challenging intonation",
          "Gesture: Point to audience on 'ai' - make challenge direct and personal",
          "Facial expression: Mischievous smile - convey playful, not aggressive challenge",
          "Pause: Slight pause after 'đố ai' - give audience moment to anticipate riddle",
          "Eye contact: Sweep across audience - include everyone in challenge"
        ],

        "culturalSensitivity": [
          "Recognize 'đố ai' as cultural treasure - centuries-old formula preserving oral tradition",
          "Understand riddles are social bonding, not just individual puzzles - communal activity",
          "Respect interactive nature - Vietnamese folk songs expect audience participation",
          "Appreciate pedagogical function - riddles teach language, logic, cultural knowledge"
        ],

        "pedagogicalApproach": [
          "Step 1: Introduce Vietnamese riddle tradition - historical role, cultural significance",
          "Step 2: Teach 'đố ai' formula - meaning (I bet you who) and function (challenge marker)",
          "Step 3: Practice interactive performance - teacher says 'đố ai', students respond",
          "Step 4: Create riddles using 'đố ai' format - apply formula to new content",
          "Step 5: Compare to riddle markers in other languages (Spanish 'adivina adivinanza')",
          "Assessment: Students perform riddle song with proper 'đố ai' delivery and interaction"
        ],

        "commonMisinterpretations": [
          "❌ 'Aggressive challenge' → ✅ Playful, friendly invitation to solve puzzle",
          "❌ 'Can use other question words' → ✅ 'Đố ai' is fixed formula, cannot substitute",
          "❌ 'Just rhetorical question' → ✅ Genuine invitation for audience participation",
          "❌ 'Modern invention' → ✅ Ancient oral tradition formula, hundreds of years old"
        ]
      }
    },

    {
      "id": 5,
      "vietnamese": "Ai làm ai làm",
      "literal": "who does who does",
      "meaning": "emphatic repetition questioning agency or responsibility - creates suspense and rhythmic emphasis",

      "culturalWeights": {
        "historicalDepth": 5,
        "explanation": "Rhetorical question doubling moderately old in Vietnamese folk tradition - documented in ca dao collections for 100+ years",

        "regionalSpecificity": 4,
        "explanation": "Used across Vietnam with minor regional variations in intonation, not region-specific",

        "symbolicLoad": 4,
        "explanation": "Low-moderate symbolic load - represents questioning, search for agency/cause. More rhetorical device than deep symbol",

        "ritualSignificance": 2,
        "explanation": "Low ritual significance - everyday rhetorical pattern, not ceremonial",

        "transmissionImportance": 6,
        "explanation": "Important for teaching Vietnamese rhetorical question and reduplication patterns - pedagogical value",

        "emotionalResonance": 5,
        "explanation": "Moderate emotional impact - creates suspense, puzzlement, shared wondering in audience"
      },

      "complexityMetrics": {
        "layersOfMeaning": 2,
        "explanation": "Two layers: (1) Literal questioning of doer/actor, (2) Rhetorical emphasis through doubling",

        "crossDomainMapping": 3,
        "explanation": "Minimal metaphor - REPETITION → EMPHASIS mapping. Straightforward intensification through doubling",

        "culturalPrerequisites": 4,
        "explanation": "Requires understanding Vietnamese rhetorical questions and how repetition creates emphasis/suspense",

        "idiomaticity": 5,
        "explanation": "Moderately idiomatic - 'ai làm' doubled follows productive pattern, semi-conventional in folk songs",

        "contextDependence": 5,
        "explanation": "Moderately context-dependent - tone and meaning shift based on whether genuine or rhetorical question",

        "pedagogicalChallenge": 4,
        "explanation": "Moderate ease - rhetorical question concept universal, Vietnamese-specific doubling pattern requires teaching"
      },

      "semanticNetwork": {
        "sourceDomain": "REPEATED_QUESTIONING",
        "targetDomain": "EMPHASIS_AND_SUSPENSE",
        "mappings": [
          {
            "source": "asking twice",
            "target": "emphasizing importance"
          },
          {
            "source": "delayed answer",
            "target": "building anticipation"
          },
          {
            "source": "echo effect",
            "target": "rhetorical intensification"
          }
        ],
        "conceptualMetaphor": "REPEATED_QUESTION_IS_EMPHATIC_DEMAND"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears in phrase 2, before consequence description - builds suspense before revealing distress",

        "syntacticRole": "rhetorical_question",
        "explanation": "Functions as rhetorical question - doesn't expect answer, creates dramatic effect",

        "discourseFunction": "suspense_building",
        "explanation": "Delays information, builds tension before revealing consequence (ruột ốc quằn queo)",

        "participationPattern": "listening_anticipatory",
        "explanation": "Audience waits for answer - question creates gap that following phrase fills",

        "emotionalValence": "curious_tense",
        "explanation": "Creates curiosity and mild tension - what happens? who's affected?"
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [2],
        "totalPhrases": 5,
        "coverage": "20%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 4,
        "explanation": "Low-moderate uniqueness - rhetorical question doubling is common Vietnamese pattern, not specific to this song",

        "similarExpressions": [
          {
            "expression": "Làm sao làm sao? (how how?)",
            "similarity": "high",
            "difference": "Both use question doubling for emphasis, 'làm sao' asks method, 'ai làm' asks agent"
          },
          {
            "expression": "Ở đâu ở đâu? (where where?)",
            "similarity": "high",
            "difference": "Same doubling structure, different wh-word (where vs who)"
          },
          {
            "expression": "Why oh why? (English)",
            "similarity": "medium",
            "difference": "Both repeat question for emphasis, different linguistic mechanisms"
          }
        ],

        "regionalDistribution": "Universal across Vietnam - question doubling is pan-Vietnamese rhetorical device",

        "genreDistribution": "Folk songs, poetry, everyday speech - common wherever rhetorical emphasis needed",

        "historicalPersistence": "Long-standing - rhetorical question patterns documented in classical Vietnamese literature"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Voice: Raise pitch on first 'Ai làm', lower on second - creates question-answer intonation",
          "Timing: Slight pause between the two pairs - creates echo effect",
          "Facial expression: Puzzled, searching - embody the questioning",
          "Gesture: Hands out, palms up on each 'ai' - universal questioning gesture",
          "Dynamics: First pair softer (asking), second pair louder (emphasizing)"
        ],

        "culturalSensitivity": [
          "Recognize rhetorical questions as culturally appropriate in Vietnamese - not rude or evasive",
          "Understand doubling serves rhetorical, not informational purpose - emphasis, not actual inquiry",
          "Appreciate Vietnamese preference for indirect, suggestive language over direct statements"
        ],

        "pedagogicalApproach": [
          "Step 1: Introduce rhetorical questions - questions not seeking answers but creating effect",
          "Step 2: Teach Vietnamese wh-question words (ai=who, gì=what, đâu=where, sao=why/how)",
          "Step 3: Demonstrate doubling pattern - how repetition creates emphasis/drama",
          "Step 4: Practice with different emotions - curious, frustrated, dramatic",
          "Step 5: Compare to English rhetorical questions ('Who knows?', 'Why me?')",
          "Assessment: Students create rhetorical question pair using Vietnamese pattern"
        ],

        "commonMisinterpretations": [
          "❌ 'Genuine question seeking answer' → ✅ Rhetorical device for emphasis and suspense",
          "❌ 'Confusion or poor grammar' → ✅ Deliberate repetition for dramatic effect",
          "❌ 'Can use any question word' → ✅ 'Ai làm' specifically questions agency/doer",
          "❌ 'Filler words' → ✅ Essential suspense-building element in riddle structure"
        ]
      }
    },

    {
      "id": 6,
      "vietnamese": "cho ngay cho ngay",
      "literal": "give immediately give immediately",
      "meaning": "urgent repetitive demand creating insistence and resolution - possibly the riddle's playful 'answer'",

      "culturalWeights": {
        "historicalDepth": 5,
        "explanation": "Imperative doubling pattern moderately old in Vietnamese folk tradition - 100+ years documented usage",

        "regionalSpecificity": 4,
        "explanation": "Used across Vietnam, minor regional variations in urgency conveyed. Not region-specific",

        "symbolicLoad": 4,
        "explanation": "Low-moderate symbolic load - represents urgency, demand, resolution. More pragmatic than symbolic",

        "ritualSignificance": 2,
        "explanation": "Low ritual significance - everyday urgent expression, not ceremonial",

        "transmissionImportance": 6,
        "explanation": "Important for teaching Vietnamese imperative forms and how doubling creates urgency/insistence",

        "emotionalResonance": 6,
        "explanation": "Moderate emotional impact - creates sense of urgency, insistence, mock frustration in playful context"
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "Three layers: (1) Literal demand to give, (2) Urgency through doubling, (3) Possible riddle 'answer' or frog's protest",

        "crossDomainMapping": 4,
        "explanation": "Moderate mapping: REPETITION → URGENCY. Linguistic doubling creates psychological pressure/insistence",

        "culturalPrerequisites": 5,
        "explanation": "Requires understanding Vietnamese imperative forms, reduplication for urgency, and riddle closure conventions",

        "idiomaticity": 5,
        "explanation": "Moderately idiomatic - 'cho ngay' doubled is semi-conventional pattern for urgent demands",

        "contextDependence": 6,
        "explanation": "Moderately context-dependent - meaning shifts based on speaker (frog? singer?) and whether serious or playful",

        "pedagogicalChallenge": 5,
        "explanation": "Moderate difficulty - imperative forms are straightforward but cultural context of riddle 'answer' requires explanation"
      },

      "semanticNetwork": {
        "sourceDomain": "REPETITIVE_IMPERATIVE",
        "targetDomain": "URGENCY_AND_CLOSURE",
        "mappings": [
          {
            "source": "commanding twice",
            "target": "emphasizing urgency"
          },
          {
            "source": "immediate action demand (ngay)",
            "target": "no delay tolerance"
          },
          {
            "source": "repetitive insistence",
            "target": "mock frustration/humor"
          }
        ],
        "conceptualMetaphor": "URGENCY_IS_REPEATED_COMMAND"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Appears in phrase 5, final position - creates closure through insistent repetition",

        "syntacticRole": "imperative_verb_phrase",
        "explanation": "Functions as imperative command - 'cho ngay' orders immediate giving/action",

        "discourseFunction": "riddle_resolution",
        "explanation": "Provides playful 'answer' or closure to riddle - may represent frog's protest or singer's mock urgency",

        "participationPattern": "listening_amused",
        "explanation": "Audience listens and is amused by urgent, repeated demand - humor in exaggerated insistence",

        "emotionalValence": "urgent_playful",
        "explanation": "Conveys urgency but in playful, exaggerated manner - mock seriousness creates humor"
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [5],
        "totalPhrases": 5,
        "coverage": "20%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 4,
        "explanation": "Low-moderate uniqueness - imperative doubling is common Vietnamese pattern for urgency, not unique to this song",

        "similarExpressions": [
          {
            "expression": "nhanh lên nhanh lên (hurry up hurry up)",
            "similarity": "high",
            "difference": "Both use doubling for urgency, 'nhanh lên' is direct speed command, 'cho ngay' is demand for immediate giving"
          },
          {
            "expression": "đi đi (go go)",
            "similarity": "high",
            "difference": "Same imperative doubling structure, different action (go vs give)"
          },
          {
            "expression": "English 'now now!' or 'quickly quickly!'",
            "similarity": "medium",
            "difference": "Both use repetition for urgency, different linguistic mechanisms"
          }
        ],

        "regionalDistribution": "Universal across Vietnam - imperative doubling is pan-Vietnamese urgency marker",

        "genreDistribution": "Folk songs, children's songs, everyday urgent speech - common wherever insistence expressed",

        "historicalPersistence": "Long-standing - imperative reduplication documented in folk song collections for over a century"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Voice: Increase volume and urgency on second 'cho ngay' - crescendo effect",
          "Rhythm: Accelerate slightly through repetition - creates sense of mounting urgency",
          "Pronunciation: Sharp, clipped delivery of 'ngay' - conveys immediacy",
          "Gesture: Demanding hand motion (palm out, pulling toward self) on each 'cho'",
          "Facial expression: Mock urgency, exaggerated insistence - playful not genuinely angry",
          "Ending: Slight laugh or smile after phrase - signal this is playful riddle closure"
        ],

        "culturalSensitivity": [
          "Recognize urgency in Vietnamese culture is often expressed through reduplication, not just louder/faster speech",
          "Understand riddle 'answers' in Vietnamese tradition are often wordplay or unexpected twists, not logical solutions",
          "Appreciate playful use of demanding language - in folk song context, urgency is theatrical/humorous"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach Vietnamese imperatives - 'cho' (give), 'làm' (do), 'đi' (go)",
          "Step 2: Introduce 'ngay' (immediately/straight) as urgency marker",
          "Step 3: Demonstrate doubling pattern for emphasis - imperative reduplication",
          "Step 4: Discuss riddle closure in Vietnamese tradition - unexpected, playful resolutions",
          "Step 5: Practice with different urgency levels - playful vs serious",
          "Assessment: Students create urgent command using Vietnamese doubling pattern"
        ],

        "commonMisinterpretations": [
          "❌ 'Angry or aggressive' → ✅ Playful urgency in riddle context, theatrical exaggeration",
          "❌ 'Logical riddle answer' → ✅ Playful wordplay resolution, not meant to 'solve' riddle",
          "❌ 'Can soften or reduce urgency' → ✅ Doubling is essential - shows insistence, can't be single",
          "❌ 'Frog speaking literally' → ✅ Imaginative voice - frog's protest or singer's playful closing"
        ]
      }
    }
  ],

  "aggregateStatistics": {
    "totalExpressions": 6,
    "uniqueExpressions": 6,
    "totalOccurrences": 8,
    "phrasesCovered": 5,
    "phraseCoverage": "100%",
    "averageCulturalWeight": 5.67,
    "explanation": "Average across all cultural dimensions: historicalDepth=6.17, regionalSpecificity=4.17, symbolicLoad=5.17, ritualSignificance=2.33, transmissionImportance=6.83, emotionalResonance=6.33",
    "averageComplexity": 5.17,
    "explanation": "Average across all complexity metrics: layersOfMeaning=2.67, crossDomainMapping=5.00, culturalPrerequisites=5.00, idiomaticity=6.67, contextDependence=5.50, pedagogicalChallenge=5.17",
    "dominantMechanism": "metaphorical_and_expressive",
    "culturalRichness": "high_folkloric",
    "explanation": "Exceptionally rich in folk tradition - combines impossibility metaphors, visceral imagery, and sophisticated reduplication patterns. Classic Vietnamese riddle song with multi-layered figurative language serving both entertainment and pedagogical functions"
  },

  "collectionContext": {
    "genreClassification": "Ca dao đố (Vietnamese folk riddle song) - children's entertainment and education",

    "culturalSignificance": "Exemplary of Vietnamese oral riddle tradition. Demonstrates how impossible scenarios teach realistic expectations while creating communal entertainment. Uses animal imagery familiar from agricultural life. Preserves ancient 'đố ai' challenge formula. Important for understanding Vietnamese humor aesthetics (absurdity, wordplay, visceral imagery)",

    "linguisticProfile": "Rich in Vietnamese linguistic features: visceral metaphors (ruột ốc quằn queo), double reduplication (quằn queo quằn queo), rhetorical question doubling (ai làm ai làm), imperative doubling (cho ngay cho ngay), frozen riddle formulas (đố ai). Demonstrates complete range of Vietnamese reduplication types and rhetorical patterns",

    "performanceContext": "Performed in informal communal settings - family gatherings, children's play, village festivals. Interactive format with 'đố ai' inviting audience attempts at solving. Often accompanied by gestures mimicking impossible task (tying frog). May be sung as call-response with children or as solo entertainment. Traditional accompaniment could include đàn tranh or bamboo instruments, modern performances often unaccompanied",

    "pedagogicalValue": "Exceptional educational value: (1) Teaches Vietnamese riddle tradition and 'đố ai' formula, (2) Demonstrates impossibility metaphors and how cultures encode realistic expectations, (3) Shows complete Vietnamese reduplication system (partial, total, doubling), (4) Illustrates visceral metaphor system (emotions in body parts), (5) Provides example of folk humor through absurdity, (6) Demonstrates interactive performance and audience participation norms, (7) Connects language patterns to agricultural cultural context (frog, snail imagery from rice farming)"
  }
}
