{
  "metadata": {
    "songTitle": "Hầu Mi Xèo",
    "totalSyllables": 33,
    "language": "Highland ethnic minority language (Central Highlands)",
    "ethnicGroup": "Likely H'Mong, Ê Đê, or Jarai",
    "enhancementVersion": "V3.0 DEEP",
    "enhancedDate": "2025-10-06",
    "enhancedBy": "Claude LLM - V3.0 DEEP Enhancement Pipeline"
  },

  "figurativeExpressions": [
    {
      "expression": "A già tù dua minh cầu mông a lơ",
      "literal": "Highland vocables forming ritual opening sequence",
      "meaning": "Ceremonial invocation formula in highland ethnic minority tradition",
      "category": "Ca dao formula (highland ritual pattern)",
      "phraseId": 1,

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Highland ethnic minority traditions date back centuries, possibly pre-Vietnamese contact. Oral transmission through generations indicates ancient origins, though exact dating uncertain without ethnographic records.",

        "regionalSpecificity": 10,
        "explanation": "Exclusively Central Highlands ethnic minorities (Tây Nguyên region). Not found in Kinh Vietnamese or other regions. Specific to highland ceremonial contexts - likely H'Mong, Ê Đê, or Jarai communities.",

        "symbolicLoad": 8,
        "explanation": "Vocables carry symbolic spiritual weight in highland cosmology. Opening invocations often call upon ancestors, nature spirits, or cosmic forces. Each vocable may have layered meanings in original language.",

        "ritualSignificance": 9,
        "explanation": "Central to highland ceremonial music. Opening vocable sequences establish sacred space, invoke spiritual protection, and mark transition from ordinary to ritual time. Essential to proper ceremony.",

        "transmissionImportance": 10,
        "explanation": "Critical for cultural survival of highland ethnic minorities (54 ethnic groups in Vietnam). Loss of these vocables means loss of ceremonial language, spiritual connection, and cultural identity. UNESCO intangible heritage level importance.",

        "emotionalResonance": 8,
        "explanation": "Evokes deep communal identity and spiritual reverence among highland peoples. For diaspora communities, these vocables trigger powerful nostalgia and cultural pride. Non-highlanders may feel awe at the otherness."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "1) Sound/vocable level 2) Ritual/ceremonial function 3) Spiritual invocation 4) Cultural identity marker. Native speakers access all layers; outsiders only surface.",

        "crossDomainMapping": 9,
        "explanation": "Complex mapping: SOUND → RITUAL → SPIRITUALITY → COSMIC ORDER. Vocables map sonic patterns to spiritual realities. Not simple metaphor but ritual speech-act transforming reality.",

        "culturalPrerequisites": 10,
        "explanation": "Requires extensive highland cultural knowledge: cosmology, ceremonial structure, spiritual beliefs, oral tradition protocols. Impossible to fully understand without living in community for years.",

        "idiomaticity": 10,
        "explanation": "Completely frozen ritual formula. Cannot alter, reorder, or substitute vocables without destroying sacred function. Fixed by generations of ceremonial use.",

        "contextDependence": 9,
        "explanation": "Full meaning only accessible in ceremonial performance context with proper ritual setting, participants, and spiritual preparation. Sung outside ceremony loses sacred power.",

        "pedagogicalChallenge": 10,
        "explanation": "Extremely difficult to teach non-highland peoples. Requires learning minority language, understanding cosmology, experiencing ceremonies, and gaining community acceptance. Years of immersion needed."
      },

      "semanticNetwork": {
        "sourceDomain": "VOCAL_SOUND/HIGHLAND_LANGUAGE",
        "targetDomain": "SPIRITUAL_INVOCATION/COSMIC_ORDER",
        "mappings": [
          {"source": "vocable sequence 'A già tù dua'", "target": "opening spiritual gateway"},
          {"source": "highland phonemes", "target": "ancestral language/sacred speech"},
          {"source": "rhythmic pattern", "target": "ceremonial structure/cosmic rhythm"},
          {"source": "vocal timbre", "target": "spirit communication channel"}
        ],
        "conceptualMetaphor": "SOUND IS SPIRITUAL GATEWAY / SPEECH IS COSMIC INVOCATION"
      },

      "usagePatterns": {
        "phrasePosition": "beginning",
        "explanation": "Phrase 1, opening position - establishes ceremonial frame",

        "syntacticRole": "ritual_vocable_sequence",
        "explanation": "Not grammatical in Vietnamese sense, functions as ritual speech-act",

        "discourseFunction": "ceremonial_invocation",
        "explanation": "Opens sacred space, invokes spiritual presence, signals ritual beginning",

        "participationPattern": "call_response_or_communal",
        "explanation": "May be call (lead singer) with community response, or unison communal opening",

        "emotionalValence": "solemn_reverent",
        "explanation": "Serious spiritual tone, respectful invocation, ceremonial gravity"
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [1],
        "totalPhrases": 4,
        "coverage": "25%",
        "positionDistribution": {"beginning": 1, "middle": 0, "ending": 0}
      },

      "comparativeContext": {
        "uniquenessScore": 10,
        "explanation": "Absolutely unique to this song and possibly this specific highland community. Not found in 120+ other songs in collection (all Kinh Vietnamese). Represents endangered linguistic/musical heritage.",

        "similarExpressions": [
          {
            "expression": "Dom dom (Bengu Adai)",
            "similarity": "high",
            "difference": "Dom dom = gong imitation (Central Highlands percussion). A già tù dua = ritual invocation (vocal ceremony). Both ethnic minority, both ritual, different functions."
          },
          {
            "expression": "Ơi thơng ơi (Vietnamese folk)",
            "similarity": "medium",
            "difference": "Vietnamese vocable for calling/bonding. A già tù dua is highland ritual vocable with spiritual function. Different cultural systems entirely."
          }
        ],

        "regionalDistribution": "Central Highlands only (Tây Nguyên), specific ethnic minority group",
        "genreDistribution": "Ceremonial/ritual highland songs only, not work/love songs",
        "historicalPersistence": "Ancient to present, transmitted orally through highland communities. Endangered due to modernization and language loss."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Vocables must be pronounced with highland phonetic system - not Vietnamese tones",
          "Open throat, resonant chest voice - highland vocal style, not Vietnamese nasal quality",
          "Steady, deliberate rhythm - ceremonial pace, not rushed",
          "Imagine calling across mountain valleys - highland acoustic environment",
          "If performing: acknowledge this is sacred language, approach with deep respect"
        ],

        "culturalSensitivity": [
          "Sacred ceremonial language from living highland cultures - not museum artifact or 'exotic' entertainment",
          "Part of Vietnam's 54 ethnic minority cultural heritage - respect cultural ownership",
          "These vocables may have specific spiritual power in highland belief - treat as sacred text",
          "Performance outside community requires permission and cultural consultation",
          "Avoid romanticizing or exoticizing highland peoples - recognize as complex, living cultures with agency",
          "Language endangerment: only elders may remember these vocables - documentation and revitalization critical"
        ],

        "pedagogicalApproach": [
          "Step 1: Research specific ethnic group (H'Mong? Ê Đê? Jarai?) - different cosmologies and languages",
          "Step 2: Study Central Highlands cultural context - geography, history, spiritual beliefs, ceremonial life",
          "Step 3: Listen to authentic recordings from highland communities (seek ethnomusicology archives)",
          "Step 4: Learn about Vietnam's 54 ethnic groups - highland minorities are diverse, not monolithic",
          "Step 5: If possible, visit Tây Nguyên region with cultural guide - experience context firsthand",
          "Step 6: Consult with highland community members or cultural experts before performing",
          "Step 7: Acknowledge that full understanding requires years of immersion - embrace humility"
        ],

        "commonMisinterpretations": [
          "❌ 'Meaningless sounds/filler vocables' → ✅ Sacred ritual language with specific spiritual function in highland cosmology",
          "❌ 'Vietnamese reduplication or poetic device' → ✅ Highland minority linguistic mechanism, not Vietnamese",
          "❌ 'Can translate to Vietnamese/English' → ✅ Many vocables untranslatable - tied to highland worldview",
          "❌ 'All highland songs are the same' → ✅ Each ethnic group has distinct language, music, and ceremony",
          "❌ 'Can perform casually for entertainment' → ✅ Sacred ceremonial music requiring cultural permission and respect"
        ]
      }
    },

    {
      "expression": "minh cầu mông",
      "literal": "Partial phonetic reduplication of 'minh cầu'",
      "meaning": "Highland vocable sequence with sound-based emphasis through partial reduplication",
      "category": "Từ láy (Partial reduplication - highland variant)",
      "phraseId": 1,

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Reduplication is ancient linguistic mechanism in Austroasiatic and Tai languages of highland region. Predates Vietnamese linguistic contact.",

        "regionalSpecificity": 9,
        "explanation": "Highland ethnic minority reduplication patterns differ from Vietnamese. Specific to Tây Nguyên region linguistic families.",

        "symbolicLoad": 6,
        "explanation": "Sound-based emphasis through phonetic variation. Symbolic weight less than ritual vocables, but still carries highland cultural identity.",

        "ritualSignificance": 7,
        "explanation": "Part of ritual invocation sequence. Contributes to ceremonial rhythm and spiritual atmosphere, though not independently sacred.",

        "transmissionImportance": 9,
        "explanation": "Preserves highland linguistic patterns. Loss means loss of phonetic and rhythmic knowledge essential to language survival.",

        "emotionalResonance": 6,
        "explanation": "Creates rhythmic pleasure and cultural recognition for highland speakers. Reinforces communal linguistic identity."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "1) Phonetic reduplication 2) Rhythmic emphasis 3) Cultural linguistic marker. Simpler than full ritual vocables.",

        "crossDomainMapping": 5,
        "explanation": "Moderate mapping: SOUND REPETITION → EMPHASIS → CULTURAL IDENTITY. Highland reduplication as identity marker.",

        "culturalPrerequisites": 8,
        "explanation": "Requires highland linguistic knowledge to recognize reduplication pattern. Vietnamese speakers may miss phonetic relationship.",

        "idiomaticity": 7,
        "explanation": "Fixed within this song/ceremony. Reduplication pattern follows highland linguistic rules, not freely compositional.",

        "contextDependence": 7,
        "explanation": "Meaning enhanced by ritual context, but phonetic pattern recognizable even outside ceremony.",

        "pedagogicalChallenge": 7,
        "explanation": "Challenging to teach non-highland speakers highland phonetic and reduplication systems. Requires ear training."
      },

      "semanticNetwork": {
        "sourceDomain": "PHONETIC_REPETITION",
        "targetDomain": "RHYTHMIC_EMPHASIS/IDENTITY",
        "mappings": [
          {"source": "base vocable 'minh cầu'", "target": "core semantic/ritual content"},
          {"source": "variant 'mông'", "target": "phonetic echo/emphasis"},
          {"source": "partial reduplication pattern", "target": "highland linguistic identity"}
        ],
        "conceptualMetaphor": "REPETITION IS EMPHASIS / SOUND VARIATION IS CULTURAL MARKING"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Within phrase 1, middle position - embedded in ritual vocable sequence",

        "syntacticRole": "phonetic_reduplication",
        "explanation": "Functions as reduplication device, not grammatical unit",

        "discourseFunction": "rhythmic_emphasis",
        "explanation": "Adds rhythmic weight and phonetic variation to invocation",

        "participationPattern": "communal_or_solo",
        "explanation": "Performed with opening vocables - either lead singer or communal",

        "emotionalValence": "rhythmic_pleasing",
        "explanation": "Creates sonic satisfaction through phonetic play"
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [1],
        "totalPhrases": 4,
        "coverage": "25%",
        "positionDistribution": {"beginning": 0, "middle": 1, "ending": 0}
      },

      "comparativeContext": {
        "uniquenessScore": 9,
        "explanation": "Unique highland reduplication pattern not found in Vietnamese collection. Represents highland linguistic mechanism distinct from Vietnamese từ láy.",

        "similarExpressions": [
          {
            "expression": "lởư lù lua tùa (same song, phrase 4)",
            "similarity": "very_high",
            "difference": "Same partial reduplication mechanism in same song. Different vocables, same pattern."
          },
          {
            "expression": "Vietnamese từ láy (e.g., 'xanh xanh', 'đỏ đỏ')",
            "similarity": "medium",
            "difference": "Both use reduplication, but Vietnamese follows AA' pattern with tone changes. Highland follows different phonetic rules."
          }
        ],

        "regionalDistribution": "Central Highlands ethnic minority languages",
        "genreDistribution": "Ceremonial highland songs with ritual vocables",
        "historicalPersistence": "Ancient linguistic pattern preserved in ceremonial contexts"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce 'minh cầu' and 'mông' with highland phonetic system - listen for vowel/consonant relationships",
          "Keep rhythm flowing - reduplication should feel natural, not choppy",
          "Slightly emphasize the variant 'mông' to bring out phonetic play",
          "Imagine this as one flowing vocable sequence, not three separate words"
        ],

        "culturalSensitivity": [
          "Highland reduplication differs from Vietnamese - respect distinct linguistic tradition",
          "Part of endangered language systems - documentation and preservation valuable",
          "Reduplication patterns may have spiritual significance in highland context"
        ],

        "pedagogicalApproach": [
          "Step 1: Compare to Vietnamese từ láy but emphasize differences in phonetic rules",
          "Step 2: Listen for base vocable → variant relationship (minh cầu → mông)",
          "Step 3: Practice highland phonetic system separately before attempting reduplication",
          "Step 4: Study other highland songs to identify broader reduplication patterns"
        ],

        "commonMisinterpretations": [
          "❌ 'Same as Vietnamese từ láy' → ✅ Highland linguistic mechanism with different phonetic rules",
          "❌ 'Random vocables' → ✅ Structured partial reduplication pattern",
          "❌ 'Can apply Vietnamese tone rules' → ✅ Highland languages have different tonal/phonetic systems"
        ]
      }
    },

    {
      "expression": "a lơ (circular structure)",
      "literal": "Highland vocable appearing in both opening and closing",
      "meaning": "Ritual framing device creating circular song structure",
      "category": "Ca dao formula (structural/ceremonial device)",
      "phraseId": "1 and 4",

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Circular song structures ancient in highland traditions. Represents cyclical cosmology and ceremonial completion.",

        "regionalSpecificity": 10,
        "explanation": "Specific highland ceremonial pattern. Circular structures found in various ethnic minority traditions but 'a lơ' vocable unique to this community.",

        "symbolicLoad": 9,
        "explanation": "Symbolizes cosmic cycles, ritual completion, return to origin. Circle as perfect form in highland cosmology.",

        "ritualSignificance": 10,
        "explanation": "Essential ceremonial structure. Opening 'a lơ' initiates ritual space, closing 'a lơ' seals and completes ceremony. Sacred symmetry.",

        "transmissionImportance": 10,
        "explanation": "Circular structure knowledge critical for proper ceremony. Loss means inability to perform rituals correctly, severing spiritual continuity.",

        "emotionalResonance": 9,
        "explanation": "Powerful sense of completion and wholeness when closing 'a lơ' echoes opening. Creates spiritual satisfaction and communal unity."
      },

      "complexityMetrics": {
        "layersOfMeaning": 5,
        "explanation": "1) Sound/vocable 2) Structural device 3) Ritual framing 4) Cosmological symbolism (cycle) 5) Spiritual completion. Multi-layered complexity.",

        "crossDomainMapping": 9,
        "explanation": "Complex mapping: SOUND REPETITION → CIRCULAR STRUCTURE → RITUAL COMPLETION → COSMIC CYCLE → SPIRITUAL WHOLENESS. Abstract and profound.",

        "culturalPrerequisites": 10,
        "explanation": "Requires understanding highland cosmology (cyclical time), ceremonial structure, and spiritual concepts of completion/wholeness. Deep cultural knowledge needed.",

        "idiomaticity": 10,
        "explanation": "Completely fixed ceremonial pattern. Cannot omit closing 'a lơ' without breaking ritual integrity. Sacred formula.",

        "contextDependence": 9,
        "explanation": "Full meaning only in ceremonial context with opening-closing symmetry. Isolated 'a lơ' loses structural significance.",

        "pedagogicalChallenge": 9,
        "explanation": "Very difficult to convey circular structure's spiritual significance to outsiders. Requires teaching highland cosmology and ceremonial worldview."
      },

      "semanticNetwork": {
        "sourceDomain": "CIRCULAR_SOUND_PATTERN",
        "targetDomain": "COSMIC_CYCLE/RITUAL_WHOLENESS",
        "mappings": [
          {"source": "opening 'a lơ'", "target": "ritual initiation/gateway opening"},
          {"source": "closing 'a lơ'", "target": "ritual completion/gateway sealing"},
          {"source": "circular return", "target": "cosmic cycle/eternal return"},
          {"source": "sonic symmetry", "target": "spiritual balance/harmony"}
        ],
        "conceptualMetaphor": "CIRCLE IS WHOLENESS / RETURN IS COMPLETION / SYMMETRY IS SPIRITUAL BALANCE"
      },

      "usagePatterns": {
        "phrasePosition": "beginning_and_ending",
        "explanation": "Phrase 1 opening, phrase 4 closing - creates symmetrical frame",

        "syntacticRole": "structural_framing_device",
        "explanation": "Not grammatical, functions as ritual architecture/structure",

        "discourseFunction": "ceremonial_framing",
        "explanation": "Opens and closes sacred space, marks ritual boundaries",

        "participationPattern": "communal_responsive",
        "explanation": "May be call-response between leader and community, or unison",

        "emotionalValence": "solemn_completing",
        "explanation": "Opening creates anticipation, closing creates resolution and satisfaction"
      },

      "statistics": {
        "occurrences": 2,
        "phraseIds": [1, 4],
        "totalPhrases": 4,
        "coverage": "50%",
        "positionDistribution": {"beginning": 1, "middle": 0, "ending": 1}
      },

      "comparativeContext": {
        "uniquenessScore": 10,
        "explanation": "Circular structure using specific vocable 'a lơ' unique in collection. Represents highland ceremonial architecture not found in Vietnamese folk songs.",

        "similarExpressions": [
          {
            "expression": "Vietnamese ca dao refrains (e.g., 'Lý' songs)",
            "similarity": "medium",
            "difference": "Vietnamese refrains repeat full phrase/melody. 'a lơ' creates circular frame with single vocable. Different structural principles."
          },
          {
            "expression": "Ritual framing in other ethnic minority songs",
            "similarity": "high",
            "difference": "Circular structures common in highland ceremonies, but specific vocables vary by ethnic group. 'a lơ' specific to this tradition."
          }
        ],

        "regionalDistribution": "Central Highlands ethnic minority ceremonial songs",
        "genreDistribution": "Ritual/ceremonial contexts requiring sacred framing",
        "historicalPersistence": "Ancient circular structures in highland cosmology, preserved through oral ceremonial tradition"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Opening 'a lơ' should create sense of beginning - clear, inviting vocal quality",
          "Closing 'a lơ' should mirror opening but with resolution - slightly lower/softer to signal completion",
          "Imagine opening a door (phrase 1) and closing it (phrase 4) - sonic symmetry",
          "If performing with group, closing 'a lơ' can be unison to emphasize communal completion",
          "Leave slight pause before closing 'a lơ' to heighten anticipation of circular return"
        ],

        "culturalSensitivity": [
          "Circular structure has deep cosmological meaning in highland traditions - not mere aesthetic device",
          "Opening-closing symmetry may have spiritual power - approach with reverence",
          "Breaking circle (omitting closing 'a lơ') could be spiritually problematic in highland belief",
          "Respect that this represents centuries of ceremonial knowledge and spiritual practice"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach concept of cyclical time in highland cosmology (vs. linear Western time)",
          "Step 2: Explain ritual framing - opening sacred space, closing it properly",
          "Step 3: Listen for opening 'a lơ' and closing 'a lơ' - mark in score/lyrics",
          "Step 4: Practice circular phrasing in other contexts to internalize concept",
          "Step 5: Study other circular structures in world music (rondo form, etc.) for comparison",
          "Step 6: Reflect on emotional/spiritual impact of circular return - completion feeling"
        ],

        "commonMisinterpretations": [
          "❌ 'Repetition for emphasis' → ✅ Circular structure for ritual completion and cosmological symbolism",
          "❌ 'Just a refrain like Vietnamese songs' → ✅ Sacred framing device, not entertainment refrain",
          "❌ 'Can omit closing a lơ to shorten song' → ✅ Spiritually essential - breaking circle destroys ceremony",
          "❌ 'Coincidental that vocables match' → ✅ Intentional circular architecture with spiritual significance"
        ]
      }
    },

    {
      "expression": "lởư lù lua tùa",
      "literal": "Partial phonetic reduplication of 'lởư lù'",
      "meaning": "Highland vocable sequence with sound-based emphasis through partial reduplication",
      "category": "Từ láy (Partial reduplication - highland variant)",
      "phraseId": 4,

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Ancient reduplication pattern in highland linguistic tradition. Part of oral ceremonial language preserved through generations.",

        "regionalSpecificity": 9,
        "explanation": "Highland ethnic minority reduplication distinct from Vietnamese. Specific to Tây Nguyên linguistic families.",

        "symbolicLoad": 6,
        "explanation": "Sound-based emphasis through phonetic variation. Part of closing ritual sequence, carries some ceremonial weight.",

        "ritualSignificance": 7,
        "explanation": "Embedded in closing ritual formula. Contributes to ceremonial completion though not independently sacred.",

        "transmissionImportance": 9,
        "explanation": "Preserves highland linguistic reduplication patterns. Essential for language and ceremonial knowledge transmission.",

        "emotionalResonance": 6,
        "explanation": "Creates rhythmic pleasure and phonetic play in closing. Reinforces cultural linguistic identity."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "1) Phonetic reduplication 2) Rhythmic emphasis 3) Cultural linguistic marker. Similar to 'minh cầu mông' pattern.",

        "crossDomainMapping": 5,
        "explanation": "Moderate mapping: SOUND REPETITION → EMPHASIS → CULTURAL IDENTITY. Highland reduplication as ceremonial device.",

        "culturalPrerequisites": 8,
        "explanation": "Requires highland linguistic knowledge to recognize partial reduplication. Vietnamese speakers may not perceive phonetic relationship.",

        "idiomaticity": 7,
        "explanation": "Fixed within closing sequence. Follows highland linguistic rules, not freely variable.",

        "contextDependence": 7,
        "explanation": "Enhanced by closing ritual context, but phonetic pattern recognizable independently.",

        "pedagogicalChallenge": 7,
        "explanation": "Challenging to teach highland phonetic system and reduplication rules to outsiders."
      },

      "semanticNetwork": {
        "sourceDomain": "PHONETIC_REPETITION",
        "targetDomain": "RHYTHMIC_EMPHASIS/CLOSURE",
        "mappings": [
          {"source": "base vocable 'lởư lù'", "target": "core semantic/ritual content"},
          {"source": "variant 'lua tùa'", "target": "phonetic echo/emphasis"},
          {"source": "partial reduplication", "target": "highland linguistic identity marker"},
          {"source": "closing position", "target": "ceremonial completion device"}
        ],
        "conceptualMetaphor": "REPETITION IS EMPHASIS / SOUND VARIATION IS CULTURAL MARKING / FINAL REPETITION IS CLOSURE"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Phrase 4 middle position, within closing ritual sequence before final 'a lơ'",

        "syntacticRole": "phonetic_reduplication",
        "explanation": "Functions as reduplication device in closing formula",

        "discourseFunction": "rhythmic_emphasis_closure",
        "explanation": "Adds rhythmic weight to closing, builds toward final 'a lơ'",

        "participationPattern": "communal_or_solo",
        "explanation": "Performed with closing vocables - either lead or communal",

        "emotionalValence": "rhythmic_completing",
        "explanation": "Creates sonic satisfaction and sense of ceremonial winding down"
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [4],
        "totalPhrases": 4,
        "coverage": "25%",
        "positionDistribution": {"beginning": 0, "middle": 0, "ending": 1}
      },

      "comparativeContext": {
        "uniquenessScore": 9,
        "explanation": "Unique highland reduplication pattern mirroring 'minh cầu mông' in phrase 1. Creates symmetry across song structure.",

        "similarExpressions": [
          {
            "expression": "minh cầu mông (same song, phrase 1)",
            "similarity": "very_high",
            "difference": "Same partial reduplication mechanism. Opening vs. closing position creates structural balance."
          },
          {
            "expression": "Vietnamese từ láy patterns",
            "similarity": "medium",
            "difference": "Both use reduplication but highland follows distinct phonetic rules and ceremonial function."
          }
        ],

        "regionalDistribution": "Central Highlands ethnic minority languages",
        "genreDistribution": "Ceremonial highland songs with ritual vocables",
        "historicalPersistence": "Ancient linguistic pattern preserved in closing ceremonial formulas"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce 'lởư lù' and 'lua tùa' with highland phonetic system - listen for vowel/consonant echoes",
          "Keep rhythm flowing toward closing 'a lơ' - this reduplication builds momentum",
          "Slightly emphasize 'lua tùa' to bring out phonetic variation",
          "Imagine this as part of winding down ceremony - gentle but deliberate"
        ],

        "culturalSensitivity": [
          "Highland reduplication mirrors opening pattern - shows structural sophistication",
          "Part of endangered language systems - preservation through performance valuable",
          "Reduplication in closing may have spiritual significance for ceremonial completion"
        ],

        "pedagogicalApproach": [
          "Step 1: Compare to 'minh cầu mông' to show consistent reduplication pattern",
          "Step 2: Analyze base → variant relationship (lởư lù → lua tùa)",
          "Step 3: Practice highland phonetic system to execute properly",
          "Step 4: Understand closing context - how reduplication contributes to ceremonial completion"
        ],

        "commonMisinterpretations": [
          "❌ 'Random closing vocables' → ✅ Structured partial reduplication mirroring opening pattern",
          "❌ 'Same as Vietnamese từ láy' → ✅ Highland mechanism with different phonetic and ceremonial rules",
          "❌ 'Unrelated to opening minh cầu mông' → ✅ Parallel reduplication creating structural symmetry"
        ]
      }
    },

    {
      "expression": "câu cầu lởư lù lua tùa tró sầu khấu a lơ (closing formula)",
      "literal": "Highland ritual closing vocable sequence",
      "meaning": "Ceremonial closing formula returning to 'a lơ' vocable, completing circular structure",
      "category": "Ca dao formula (highland closing ritual pattern)",
      "phraseId": 4,

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Ancient closing formula in highland ceremonial tradition. Preserved through oral transmission across generations.",

        "regionalSpecificity": 10,
        "explanation": "Exclusively Central Highlands ethnic minority ceremonial music. Not found in Kinh Vietnamese or other traditions.",

        "symbolicLoad": 8,
        "explanation": "Closing vocables carry symbolic weight of completion and cosmic return. Each vocable may have layered meanings in original language.",

        "ritualSignificance": 9,
        "explanation": "Essential closing sequence for highland ceremony. Properly seals sacred space, completes spiritual work, releases participants back to ordinary time.",

        "transmissionImportance": 10,
        "explanation": "Critical for ceremonial competence. Loss of closing formulas means inability to complete rituals properly, disrupting spiritual continuity.",

        "emotionalResonance": 8,
        "explanation": "Evokes sense of completion, resolution, and communal satisfaction. Closing 'a lơ' brings powerful emotional release and spiritual closure."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "1) Vocable sequence 2) Closing ritual function 3) Circular completion (return to 'a lơ') 4) Spiritual release. Multi-layered closing.",

        "crossDomainMapping": 9,
        "explanation": "Complex mapping: SOUND SEQUENCE → RITUAL CLOSING → CIRCULAR COMPLETION → SPIRITUAL RELEASE. Abstract ceremonial function.",

        "culturalPrerequisites": 10,
        "explanation": "Requires extensive knowledge of highland ceremony structure, closing protocols, and spiritual cosmology. Only accessible through deep cultural immersion.",

        "idiomaticity": 10,
        "explanation": "Completely frozen closing formula. Cannot alter sequence without destroying ceremonial function. Sacred by tradition.",

        "contextDependence": 9,
        "explanation": "Full meaning only in ceremonial context with proper opening (phrase 1). Isolated closing loses circular significance.",

        "pedagogicalChallenge": 10,
        "explanation": "Extremely difficult to teach closing protocols to outsiders. Requires understanding entire ceremonial arc from opening to closing."
      },

      "semanticNetwork": {
        "sourceDomain": "VOCAL_SOUND_SEQUENCE",
        "targetDomain": "RITUAL_CLOSURE/COSMIC_COMPLETION",
        "mappings": [
          {"source": "closing vocable sequence", "target": "spiritual work completion"},
          {"source": "return to 'a lơ'", "target": "circular cosmic return/wholeness"},
          {"source": "final vocal release", "target": "participants released from sacred time"},
          {"source": "highland phonemes", "target": "ancestral closing language"}
        ],
        "conceptualMetaphor": "SOUND IS SPIRITUAL SEALING / CLOSING IS COSMIC RETURN / FINAL VOCABLE IS RELEASE"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Phrase 4, closing position - final ritual sequence",

        "syntacticRole": "ritual_closing_formula",
        "explanation": "Functions as ceremonial architecture, not grammar",

        "discourseFunction": "ceremonial_closure_completion",
        "explanation": "Seals sacred space, completes circular structure, releases spiritual energy",

        "participationPattern": "communal_unison_or_call_response",
        "explanation": "May be unison communal closing or leader with community response",

        "emotionalValence": "solemn_releasing_satisfied",
        "explanation": "Serious ceremonial tone with sense of completion, release, and communal satisfaction"
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [4],
        "totalPhrases": 4,
        "coverage": "25%",
        "positionDistribution": {"beginning": 0, "middle": 0, "ending": 1}
      },

      "comparativeContext": {
        "uniquenessScore": 10,
        "explanation": "Absolutely unique closing formula in collection. Paired with opening 'A già tù dua...' creates complete highland ceremonial arc not found elsewhere.",

        "similarExpressions": [
          {
            "expression": "A già tù dua minh cầu mông a lơ (opening, phrase 1)",
            "similarity": "very_high",
            "difference": "Opening and closing formulas - paired set creating circular structure. Opening invokes, closing completes."
          },
          {
            "expression": "Vietnamese ca dao closing patterns (e.g., 'xa xôi', 'mờ xa')",
            "similarity": "low",
            "difference": "Vietnamese closings are poetic/semantic. Highland closing is ritual/ceremonial with specific vocable return."
          }
        ],

        "regionalDistribution": "Central Highlands ethnic minority ceremonial songs",
        "genreDistribution": "Ritual/ceremonial contexts requiring proper closing",
        "historicalPersistence": "Ancient closing formulas preserved through highland oral ceremonial tradition"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Build intensity through middle vocables (tró sầu khấu) toward final 'a lơ'",
          "Final 'a lơ' should echo opening but with sense of completion - slightly softer/lower",
          "Allow brief silence before final 'a lơ' to heighten sense of circular return",
          "Imagine sealing ceremonial space - sonic closure matching spiritual closure",
          "If with group, final 'a lơ' works well as unison for communal completion feeling"
        ],

        "culturalSensitivity": [
          "Closing formula has sacred function - seals ceremony properly in highland tradition",
          "Omitting or altering closing may be spiritually problematic in highland cosmology",
          "Return to 'a lơ' represents cosmic completion - deep cosmological significance",
          "Performance requires understanding entire ceremonial arc from opening to closing",
          "Respect this as living ceremonial knowledge, not historical artifact"
        ],

        "pedagogicalApproach": [
          "Step 1: Review opening formula (phrase 1) to understand paired relationship",
          "Step 2: Trace 'a lơ' from opening through closing - mark circular structure",
          "Step 3: Study closing protocols in highland ceremonies - how rituals end properly",
          "Step 4: Practice entire song to feel opening-closing arc emotionally/spiritually",
          "Step 5: Reflect on circular completion - how closing 'a lơ' brings resolution",
          "Step 6: Compare to other world ceremonial music with opening-closing pairs"
        ],

        "commonMisinterpretations": [
          "❌ 'Just final vocables/filler' → ✅ Sacred closing formula with specific ritual function",
          "❌ 'Can end anywhere in phrase 4' → ✅ Must complete full sequence and return to 'a lơ' for proper closure",
          "❌ 'Same as Vietnamese song endings' → ✅ Highland ritual closing, not Vietnamese poetic conclusion",
          "❌ 'Closing a lơ coincidentally matches opening' → ✅ Intentional circular architecture with cosmological meaning"
        ]
      }
    }
  ],

  "aggregateStatistics": {
    "totalExpressions": 5,
    "uniqueExpressions": 5,
    "totalOccurrences": 6,
    "phrasesCovered": 2,
    "phraseCoverage": "50%",

    "averageCulturalWeight": 8.68,
    "explanation": "Very high cultural weight - highland ethnic minority sacred ceremonial language with UNESCO-level significance",

    "averageComplexity": 7.73,
    "explanation": "Very high complexity - requires extensive highland cultural knowledge, cosmology, and ceremonial understanding",

    "dominantMechanism": "Highland ritual vocables and ceremonial formulas with circular structure and partial reduplication",

    "culturalRichness": "exceptional",
    "explanation": "Represents endangered Central Highlands ethnic minority ceremonial tradition with ancient origins, deep cosmological symbolism, and critical cultural transmission importance"
  },

  "collectionContext": {
    "genreClassification": "Highland ethnic minority ceremonial song (Hầu tradition)",

    "culturalSignificance": "Extremely significant - represents one of Vietnam's 54 ethnic minority groups with endangered language and ceremonial tradition. Circular structure and ritual vocables show sophisticated highland spiritual cosmology. Part of Vietnam's intangible cultural heritage requiring urgent documentation and revitalization.",

    "linguisticProfile": "Highland ethnic minority language (likely H'Mong, Ê Đê, or Jarai) - NOT Kinh Vietnamese. Features: highland phonetic system, partial reduplication patterns, ritual vocable sequences, ceremonial language distinct from daily speech. Non-tonal or different tonal system from Vietnamese.",

    "performanceContext": "Ceremonial/ritual contexts in Central Highlands (Tây Nguyên) communities. May be performed for: seasonal ceremonies, spiritual rituals, community gatherings, cultural preservation events. Requires cultural permission and proper ceremonial framing for authentic performance.",

    "pedagogicalValue": "Extremely valuable for: (1) Ethnomusicology - studying highland ceremonial music structures; (2) Linguistics - documenting endangered minority languages and reduplication patterns; (3) Cultural anthropology - understanding highland cosmology and ritual protocols; (4) Vietnamese ethnic diversity - recognizing 54 ethnic groups beyond Kinh majority; (5) Intangible heritage preservation - urgent documentation of endangered ceremonial traditions; (6) Decolonial music education - centering highland voices vs. Vietnamese/Western perspectives"
  }
}
