{
  "metadata": {
    "songTitle": "Cô nói sao",
    "totalSyllables": 66,
    "totalPhrases": 9,
    "enhancementVersion": "3.0-DEEP",
    "enhancedDate": "2025-10-05",
    "enhancedBy": "Claude LLM",
    "processingTime": "Complete 7-component analysis"
  },
  "collectionContext": {
    "genreClassification": "Narrative folk song, Social commentary",
    "culturalSignificance": "Addresses themes of family honor, deception, arranged marriage, and community expectations in traditional Vietnamese society",
    "linguisticProfile": "Standard Vietnamese with cultural idioms related to traditional women's work and kinship terminology",
    "performanceContext": "Sung in community settings to discuss social norms, typically by women sharing stories of marriage arrangements and family dynamics",
    "pedagogicalValue": "Excellent for teaching Vietnamese cultural values, family structures, marriage customs, and the role of euphemism in traditional communication"
  },
  "figurativeExpressions": [
    {
      "expression": "đi suối",
      "literal": "go to stream",
      "figurativeMeaning": "Euphemistic excuse for a woman's absence from home",
      "phraseIds": [3],
      "vietnameseCategory": "thành ngữ văn hóa (cultural idiom)",
      "semanticMechanism": "euphemism",
      "culturalScope": "community_specific",
      "meaningDepth": "symbolic",
      "culturalWeights": {
        "historicalDepth": 8,
        "historicalDepthExplanation": "Ancient practice dating back centuries in Vietnamese agrarian society. Going to the stream for water/washing was essential daily women's work, making it a believable and socially acceptable excuse for absence. Reflects pre-modern rural life patterns (200-1000 years).",
        "regionalSpecificity": 7,
        "regionalSpecificityExplanation": "Common throughout rural Vietnam, particularly in regions with streams/rivers. While widespread in Vietnamese culture, the specific phrasing and cultural weight varies by region. More prevalent in Northern and Central Vietnam where streams were central to daily life.",
        "symbolicLoad": 6,
        "symbolicLoadExplanation": "Moderate symbolic meaning - represents the mundane excuse covering significant life events. The contrast between ordinary errand and hidden wedding creates ironic symbolism. Stream = daily necessity vs. hidden reality = life-changing event.",
        "ritualSignificance": 4,
        "ritualSignificanceExplanation": "Not directly ritual but connected to marriage ceremony preparations which are highly ritualized. The excuse itself reflects the ritual secrecy sometimes surrounding arranged marriages. Moderate role in traditional social customs.",
        "transmissionImportance": 7,
        "transmissionImportanceExplanation": "Important for understanding traditional Vietnamese communication patterns, gender roles, and marriage customs. Essential for cultural literacy about how families navigated social expectations and privacy. Critical for understanding historical women's experiences.",
        "emotionalResonance": 6,
        "emotionalResonanceExplanation": "Evokes understanding and perhaps sympathy for the deception, or disapproval depending on perspective. Resonates with anyone who has experienced or witnessed family secrecy around major life events. Moderate emotional impact through recognition of familiar social patterns."
      },
      "complexityMetrics": {
        "layersOfMeaning": 3,
        "layersOfMeaningExplanation": "Three layers: 1) Literal - actually going to stream for water/washing, 2) Excuse - cover story for absence, 3) Social commentary - reveals family's attempt to hide wedding preparations. Multiple interpretive dimensions.",
        "crossDomainMapping": 5,
        "crossDomainMappingExplanation": "DAILY ROUTINE → SOCIAL DECEPTION. Maps ordinary domestic activity (going to stream) onto concealment of major life event (wedding). Moderate metaphorical complexity - everyday action stands in for extraordinary circumstances.",
        "culturalPrerequisites": 8,
        "culturalPrerequisitesExplanation": "Requires understanding of: 1) Traditional Vietnamese women's daily work, 2) Social acceptability of certain absences, 3) Marriage arrangement customs, 4) Family honor concerns, 5) Why parents would conceal wedding preparations. Extensive cultural knowledge needed for full appreciation.",
        "idiomaticity": 7,
        "idiomaticityExplanation": "Semi-fixed expression in traditional contexts. 'Đi suối' as excuse has conventional meaning beyond literal interpretation. Not completely frozen (can say 'đi lấy nước' - go get water), but specific cultural weight as wedding concealment excuse makes it somewhat idiomatic.",
        "contextDependence": 8,
        "contextDependenceExplanation": "Highly context-dependent. Meaning shifts dramatically based on: 1) Who is absent (young woman), 2) What's actually happening (wedding), 3) Who's speaking (parents vs. narrator), 4) Social setting (community gossip). Without context, just means 'go to stream.'",
        "pedagogicalChallenge": 7,
        "pedagogicalChallengeExplanation": "Challenging for non-Vietnamese learners because it requires explaining: traditional gender roles, marriage customs, acceptable vs. suspicious excuses, family honor systems, and the social function of euphemism. Needs substantial cultural background to teach effectively."
      },
      "semanticNetwork": {
        "sourceDomain": "DAILY DOMESTIC ROUTINE",
        "targetDomain": "SOCIAL CONCEALMENT",
        "mappings": [
          {
            "source": "Going to stream (necessary daily task)",
            "target": "Providing believable excuse for daughter's absence"
          },
          {
            "source": "Water fetching (ordinary, expected)",
            "target": "Wedding preparation (extraordinary, concealed)"
          },
          {
            "source": "Stream (public, visible destination)",
            "target": "Wedding venue (private, hidden location)"
          },
          {
            "source": "Women's work routine (socially acceptable)",
            "target": "Arranged marriage process (socially sensitive)"
          }
        ],
        "conceptualMetaphor": "ORDINARY ROUTINE IS COVER FOR EXTRAORDINARY EVENTS"
      },
      "usagePatterns": {
        "phrasePosition": "middle",
        "phrasePositionExplanation": "Appears in phrase 3 of 9, during the narrative buildup where evidence of deception is being presented. Part of the sequence of lies being exposed.",
        "syntacticRole": "predicate",
        "syntacticRoleExplanation": "Functions as the verb phrase in 'Nói cô đã đi suối' (They said she went to the stream). Main action being reported/questioned.",
        "discourseFunction": "contrast",
        "discourseFunctionExplanation": "Creates contrast between stated reason (going to stream) and actual evidence (seeing invitations). Sets up the revelation of deception. Functions to highlight the lie.",
        "participationPattern": "listening",
        "participationPatternExplanation": "Audience listens to narrator's observation. This is storytelling/commentary, not call-and-response. Listeners reflect on similar experiences of family secrecy.",
        "emotionalValence": "negative",
        "emotionalValenceExplanation": "Negative connotation - marks deception, dishonesty, concealment. Even if the family's reasons are understandable, the expression itself signals lying. Conveys disapproval or at least recognition of wrongdoing."
      },
      "statistics": {
        "occurrences": 1,
        "phraseIds": [3],
        "totalPhrases": 9,
        "coverage": "11.1%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },
      "comparativeContext": {
        "uniquenessScore": 5,
        "uniquenessScoreExplanation": "Moderately common expression in Vietnamese folk songs dealing with marriage and family honor. Not unique to this song, but the specific context of using it to expose deception (rather than accepting it) adds some uniqueness. Found in similar narrative songs about arranged marriages.",
        "similarExpressions": [
          {
            "expression": "đi chợ (going to market)",
            "similarity": "high",
            "difference": "Market is another common euphemistic excuse for women's absence, but typically for shorter durations. Stream implies more time/distance, suitable for extended absence during wedding preparations."
          },
          {
            "expression": "đi thăm bà con (visiting relatives)",
            "similarity": "medium",
            "difference": "More directly related to family matters, so closer to truth but still euphemistic. Less mundane than 'going to stream,' might raise more questions."
          },
          {
            "expression": "đi làm đồng (going to work in fields)",
            "similarity": "high",
            "difference": "Another traditional women's work excuse. Similar function but implies agricultural work rather than water-related tasks. Regional variations in which excuse is more common."
          }
        ],
        "regionalDistribution": "Common throughout rural Vietnam, particularly Northern and Central regions where streams/rivers were central to village life and women's daily routines",
        "genreDistribution": "Frequent in narrative folk songs about marriage, family honor, and women's experiences. Also appears in love songs as explanation for secret meetings",
        "historicalPersistence": "Used for centuries in Vietnamese culture, declining in modern urban contexts where 'going to stream' is no longer a daily necessity, but persists in traditional song repertoire"
      },
      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'đi suối' with a questioning or knowing tone to emphasize the narrator's skepticism about this excuse",
          "Slightly emphasize 'mà sao thấy mời' (but why do I see invitations) to highlight the contradiction being exposed",
          "Use facial expressions or gestures suggesting doubt when mentioning the stream excuse",
          "Pace this phrase slightly faster than the refrain to convey the building narrative momentum",
          "Consider ensemble performance where one voice states the excuse and another voice questions it"
        ],
        "culturalSensitivity": [
          "Recognize that this reflects traditional marriage customs that may differ from modern practices - avoid judging historical practices by contemporary standards",
          "Understand that family honor and privacy around marriage negotiations were (and in some communities still are) important cultural values",
          "Avoid portraying the parents as simply deceitful - their actions reflected complex social pressures and customs",
          "Be aware that this represents one perspective (narrator/community) and the young woman's own feelings may not be voiced",
          "Respect that arranged marriages and family decision-making had (and have) different meanings in Vietnamese culture than in Western contexts"
        ],
        "pedagogicalApproach": [
          "Step 1: Establish literal meaning - teach 'đi suối' as 'going to the stream,' explain traditional water-fetching practices",
          "Step 2: Explain cultural context - describe why this was a common women's task and believable excuse for absence",
          "Step 3: Reveal figurative layer - show how this phrase functions as euphemism in marriage/family contexts",
          "Step 4: Discuss social function - explore why families used such euphemisms and what this reveals about marriage customs",
          "Step 5: Compare to modern equivalents - ask students to think of contemporary euphemisms for concealing events",
          "Step 6: Performance practice - have students sing the line with appropriate questioning/knowing tone"
        ],
        "commonMisinterpretations": [
          "❌ Thinking the woman literally went to the stream and parents are confused → ✅ Understanding parents deliberately used this as false excuse",
          "❌ Viewing this as simple lie with no cultural context → ✅ Recognizing this as culturally conventional euphemism with social function",
          "❌ Assuming narrator approves of the deception → ✅ Seeing narrator is exposing/questioning the deception",
          "❌ Reading this as criticism of the woman → ✅ Understanding criticism is directed at parents' deception",
          "❌ Missing the contrast structure → ✅ Recognizing 'đi suối' is immediately contradicted by 'thấy mời' (seeing invitations)"
        ]
      }
    },
    {
      "expression": "lấy củi trong rừng",
      "literal": "gather firewood in the forest",
      "figurativeMeaning": "Euphemistic excuse for a woman's extended absence, similar to 'going to stream'",
      "phraseIds": [6],
      "vietnameseCategory": "thành ngữ văn hóa (cultural idiom)",
      "semanticMechanism": "euphemism",
      "culturalScope": "community_specific",
      "meaningDepth": "symbolic",
      "culturalWeights": {
        "historicalDepth": 8,
        "historicalDepthExplanation": "Ancient practice in Vietnamese agrarian/forest communities. Firewood gathering was essential women's work for centuries, making it perfect cover story. Reflects traditional rural subsistence economy (200-1000 years). Part of gendered labor division deeply rooted in history.",
        "regionalSpecificity": 8,
        "regionalSpecificityExplanation": "Particularly strong in Central and Highland regions with forest access. Less common in purely agricultural/delta regions. Reflects geographic variation in Vietnamese communities - forest vs. river regions used different excuses based on local women's work patterns.",
        "symbolicLoad": 7,
        "symbolicLoadExplanation": "Higher symbolic weight than 'stream' - forest implies longer absence, more distance, isolation. Firewood = essential but takes time, justifying extended absence needed for wedding prep. Forest = remote, hidden space paralleling the hidden wedding. Rich metaphorical layers.",
        "ritualSignificance": 4,
        "ritualSignificanceExplanation": "Like 'going to stream,' not directly ritual but connected to marriage ceremony secrecy. Firewood gathering itself has some ritual aspects (timing, methods) but primarily functional. Moderate significance through connection to wedding preparations.",
        "transmissionImportance": 7,
        "transmissionImportanceExplanation": "Important for understanding regional variations in Vietnamese culture, gender roles in forest-based communities, and how environment shapes social practices. Essential for cultural literacy about forest-dwelling traditions and marriage customs.",
        "emotionalResonance": 6,
        "emotionalResonanceExplanation": "Similar to 'stream' excuse but perhaps slightly more knowing - forest allows longer absence, suggesting more elaborate deception. Evokes recognition of familiar social patterns. Moderate emotional impact through community memory of such euphemisms."
      },
      "complexityMetrics": {
        "layersOfMeaning": 3,
        "layersOfMeaningExplanation": "Three layers: 1) Literal - actually gathering firewood for fuel, 2) Excuse - elaborate cover story for longer absence, 3) Social pattern - second lie in series, reinforcing theme of systematic deception. Multiple interpretations.",
        "crossDomainMapping": 6,
        "crossDomainMappingExplanation": "FOREST LABOR → SOCIAL CONCEALMENT. Maps arduous physical work in remote location onto concealment of wedding. Slightly more complex than 'stream' metaphor because forest = danger, isolation, hardship, all paralleling the emotional/social complexity of arranged marriage.",
        "culturalPrerequisites": 8,
        "culturalPrerequisitesExplanation": "Requires understanding of: 1) Traditional fuel sources and women's labor, 2) Forest access and use patterns, 3) Why forest excuse allows longer absence than stream, 4) Parallel structure of lies in song, 5) Regional variations in women's work. Extensive background needed.",
        "idiomaticity": 7,
        "idiomaticityExplanation": "Semi-fixed expression in forest communities. 'Lấy củi' (gather firewood) has conventional meaning as absence excuse. The addition of 'trong rừng' (in forest) emphasizes remoteness/duration. Moderate idiomaticity - not completely frozen but culturally weighted.",
        "contextDependence": 8,
        "contextDependenceExplanation": "Highly context-dependent like 'stream' excuse. Interpretation depends on: 1) Who is gathering (young marriageable woman), 2) When (just before wedding), 3) Pattern (second lie after stream excuse), 4) Geography (forest-accessible region). Context determines meaning.",
        "pedagogicalChallenge": 8,
        "pedagogicalChallengeExplanation": "Very challenging for non-Vietnamese learners because requires: explaining forest-based subsistence economy, gender-specific labor division, geographic variations, why forest implies longer absence, plus all the marriage custom context. Needs extensive cultural scaffolding."
      },
      "semanticNetwork": {
        "sourceDomain": "FOREST SUBSISTENCE LABOR",
        "targetDomain": "EXTENDED CONCEALMENT",
        "mappings": [
          {
            "source": "Gathering firewood (time-consuming necessity)",
            "target": "Justifying extended absence for wedding preparations"
          },
          {
            "source": "Forest (remote, isolated, dangerous)",
            "target": "Wedding venue (hidden, private, socially sensitive)"
          },
          {
            "source": "Heavy labor (carrying wood bundle)",
            "target": "Emotional burden of arranged marriage"
          },
          {
            "source": "Daily/weekly routine (regular necessity)",
            "target": "Habitual deception pattern"
          }
        ],
        "conceptualMetaphor": "REMOTE LABOR IS COVER FOR REMOTE TRUTH"
      },
      "usagePatterns": {
        "phrasePosition": "middle",
        "phrasePositionExplanation": "Appears in phrase 6 of 9, continuing the pattern of exposing lies. Parallel structure to earlier 'stream' excuse (phrase 3). Part of systematic revelation of deception.",
        "syntacticRole": "predicate",
        "syntacticRoleExplanation": "Functions as verb phrase in 'Nói cô lấy củi trong rừng' (They said she went to gather firewood in forest). Main action being reported as false excuse.",
        "discourseFunction": "contrast",
        "discourseFunctionExplanation": "Creates second contrast between excuse and reality. Reinforces pattern established by 'stream' excuse. Builds evidence that this is systematic, not accidental deception. Strengthens narrative climax.",
        "participationPattern": "listening",
        "participationPatternExplanation": "Audience continues listening to accumulating evidence of lies. Participates through recognition and perhaps emotional response (disapproval, understanding). Not interactive, but engaged.",
        "emotionalValence": "negative",
        "emotionalValenceExplanation": "Negative - second lie intensifies disapproval. Repetition of deception pattern increases emotional weight. Conveys moral judgment on systematic dishonesty, even as it reflects cultural norms around marriage privacy."
      },
      "statistics": {
        "occurrences": 1,
        "phraseIds": [6],
        "totalPhrases": 9,
        "coverage": "11.1%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },
      "comparativeContext": {
        "uniquenessScore": 6,
        "uniquenessScoreExplanation": "Somewhat less common than 'stream' excuse in folk songs, more regionally specific to forest areas. The parallel structure (stream excuse, then forest excuse) adds uniqueness to this song. Not found in every marriage song, but appears in forest-region variants.",
        "similarExpressions": [
          {
            "expression": "đi hái rau trong rừng (gather vegetables in forest)",
            "similarity": "high",
            "difference": "Similar forest-based excuse but gathering vegetables implies shorter time than firewood. Less arduous labor, might not justify as extended absence."
          },
          {
            "expression": "đi kiếm củi (search for firewood)",
            "similarity": "high",
            "difference": "'Kiếm' (search) vs 'lấy' (gather) - subtle difference. 'Kiếm' might imply more uncertainty/longer time searching, while 'lấy' assumes known location."
          },
          {
            "expression": "đi rừng (go to forest)",
            "similarity": "medium",
            "difference": "More general, less specific about task. Could mean many things (foraging, hunting, traveling). 'Lấy củi' is more precise and therefore more believable as women's work."
          }
        ],
        "regionalDistribution": "Most common in Central Highland and Northern mountain regions with forest access. Less prevalent in Southern Delta regions where forests are scarcer. Reflects geographic diversity of Vietnamese culture.",
        "genreDistribution": "Found in narrative folk songs about marriage from forest regions, work songs about forest labor, and songs celebrating forest-dwelling communities. Less common in urban/coastal song traditions.",
        "historicalPersistence": "Used for centuries, declining with deforestation and modern fuel sources, but persists in traditional song repertoire and in remaining forest communities. Still understood metaphorically even where literal practice has ended."
      },
      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'lấy củi trong rừng' with knowing tone, emphasizing this is the second excuse in pattern of lies",
          "Stress 'trong rừng' (in forest) to highlight the remoteness/elaborateness of excuse",
          "Use slight pause before 'Sao tôi thấy...' (Why do I see...) to build anticipation of contradiction",
          "Consider slowing tempo slightly on this phrase to emphasize weight of accumulated evidence",
          "Facial expression should convey increasing certainty that deception is occurring",
          "If performing with ensemble, second voice could echo 'trong rừng' with skeptical tone"
        ],
        "culturalSensitivity": [
          "Recognize this reflects specific regional traditions - forest-based communities vs. river/agricultural communities",
          "Understand that firewood gathering was essential, often dangerous labor for women - not trivial",
          "Avoid romanticizing forest labor - it was hard, time-consuming work that women had to perform regularly",
          "Respect that forest-dwelling communities have distinct cultural practices that may differ from lowland Vietnamese traditions",
          "Be aware of environmental context - deforestation has changed these practices, but song preserves historical memory"
        ],
        "pedagogicalApproach": [
          "Step 1: Teach literal meaning - explain 'lấy củi' and traditional fuel gathering practices",
          "Step 2: Discuss forest ecology - help students understand why forests provided resources and why trips took time",
          "Step 3: Compare to 'stream' excuse - show parallel structure and escalation (stream → forest = closer → farther)",
          "Step 4: Explain regional variation - discuss geographic differences in Vietnamese women's work patterns",
          "Step 5: Analyze pattern - help students see this is second lie in series, building narrative tension",
          "Step 6: Cultural comparison - ask students about excuses in their own cultures for concealing events",
          "Step 7: Performance - practice singing with appropriate knowing/skeptical tone"
        ],
        "commonMisinterpretations": [
          "❌ Thinking this is just about firewood gathering → ✅ Understanding it's euphemistic excuse for wedding absence",
          "❌ Missing parallel with 'stream' excuse → ✅ Recognizing this is second lie in systematic pattern",
          "❌ Assuming forest work is trivial → ✅ Understanding firewood gathering was essential, time-consuming labor",
          "❌ Not noticing regional specificity → ✅ Recognizing this reflects forest-region traditions",
          "❌ Reading as identical to 'stream' excuse → ✅ Seeing escalation - forest is farther, takes longer, more elaborate lie"
        ]
      }
    },
    {
      "expression": "thông gia",
      "literal": "connected families / mutually related families",
      "figurativeMeaning": "Kinship term for the relationship between two families joined by marriage of their children",
      "phraseIds": [7],
      "vietnameseCategory": "thuật ngữ thân tộc (kinship terminology)",
      "semanticMechanism": "cultural_concept",
      "culturalScope": "nationwide",
      "meaningDepth": "cultural_specific",
      "culturalWeights": {
        "historicalDepth": 9,
        "historicalDepthExplanation": "Ancient kinship term dating back many centuries in Vietnamese family system. Reflects Confucian influence on Vietnamese kinship structure where marriage creates formal relationship between entire families, not just individuals. Pre-colonial tradition (500+ years).",
        "regionalSpecificity": 3,
        "regionalSpecificityExplanation": "Nationwide term used throughout Vietnam with minimal regional variation. Universal in Vietnamese culture, though specific customs around thông gia relationship may vary by region. Part of standard Vietnamese kinship vocabulary understood across all regions.",
        "symbolicLoad": 7,
        "symbolicLoadExplanation": "High symbolic weight - represents fundamental Vietnamese concept that marriage unites families, not just individuals. Symbolizes extended kinship network, mutual obligations, social ties. Embodies values of family honor, collective responsibility, and intergenerational relationships.",
        "ritualSignificance": 9,
        "ritualSignificanceExplanation": "Essential to wedding rituals - inviting thông gia is crucial step in marriage ceremony. Formal recognition of thông gia relationship is part of wedding protocol. Term used in ceremonial toasts, speeches, gift exchanges. Central to marriage ritual structure.",
        "transmissionImportance": 9,
        "transmissionImportanceExplanation": "Critically important for cultural transmission - understanding thông gia concept is essential for Vietnamese kinship literacy. Carries core cultural values about family, marriage, and social relationships. Loss of this concept would represent significant cultural loss.",
        "emotionalResonance": 8,
        "emotionalResonanceExplanation": "Strong emotional impact - invokes complex feelings about family bonds, social obligations, wedding joy, and kinship duties. For Vietnamese audiences, 'thông gia' immediately evokes wedding ceremonies, family gatherings, and lifelong family relationships. Powerful resonance."
      },
      "complexityMetrics": {
        "layersOfMeaning": 3,
        "layersOfMeaningExplanation": "Three layers: 1) Literal - families connected by marriage, 2) Social - network of mutual obligations and relationships, 3) Symbolic - represents Vietnamese collective family values vs. individualistic marriage concept. Multiple dimensions.",
        "crossDomainMapping": 4,
        "crossDomainMappingExplanation": "FAMILY NETWORK → SOCIAL STRUCTURE. Maps kinship connection onto broader social organization. Moderate metaphorical complexity - thông gia relationship serves as model for understanding Vietnamese social relationships more broadly.",
        "culturalPrerequisites": 9,
        "culturalPrerequisitesExplanation": "Requires deep understanding of: 1) Vietnamese kinship system, 2) Marriage as family union not individual choice, 3) Extended family obligations, 4) Confucian influence on family structure, 5) Wedding ceremony protocols. Extensive cultural knowledge essential for full appreciation.",
        "idiomaticity": 9,
        "idiomaticityExplanation": "Highly fixed cultural term with no real synonym in Vietnamese. Cannot be paraphrased or explained with other words without losing cultural specificity. Frozen lexical item essential to Vietnamese kinship vocabulary.",
        "contextDependence": 6,
        "contextDependenceExplanation": "Moderately context-dependent. Core meaning is stable (in-law families), but full significance depends on: 1) Wedding context, 2) Social class of families, 3) Rural vs. urban setting, 4) Traditional vs. modern marriage. Some context needed but less than euphemisms.",
        "pedagogicalChallenge": 9,
        "pedagogicalChallengeExplanation": "Extremely challenging for non-Vietnamese learners because it represents entire cultural concept with no English equivalent. 'In-laws' is inadequate translation. Requires teaching whole framework of Vietnamese family system, marriage customs, kinship terminology. Very difficult to convey full meaning."
      },
      "semanticNetwork": {
        "sourceDomain": "KINSHIP NETWORK",
        "targetDomain": "SOCIAL ALLIANCE",
        "mappings": [
          {
            "source": "Two families (separate lineages)",
            "target": "Newly unified social unit with shared interests"
          },
          {
            "source": "Marriage bond (couple's connection)",
            "target": "Inter-family alliance with mutual obligations"
          },
          {
            "source": "Thông gia relationship (formal kinship)",
            "target": "Extended support network across generations"
          },
          {
            "source": "Inviting thông gia (ceremony inclusion)",
            "target": "Public recognition of family alliance"
          }
        ],
        "conceptualMetaphor": "MARRIAGE IS FAMILY ALLIANCE"
      },
      "usagePatterns": {
        "phrasePosition": "middle",
        "phrasePositionExplanation": "Appears in phrase 7 of 9, at the climax of evidence presentation. Placement before final revelation creates dramatic peak - seeing thông gia invitations is undeniable proof of wedding.",
        "syntacticRole": "object",
        "syntacticRoleExplanation": "Functions as object in 'mời những người thông gia' (invite the in-law families). Specific noun phrase identifying who is being invited, making the wedding undeniable.",
        "discourseFunction": "climax",
        "discourseFunctionExplanation": "Creates narrative climax - after stream and forest excuses, thông gia invitation is irrefutable evidence. No more ambiguity. Functions to resolve doubt and confirm suspicions definitively.",
        "participationPattern": "listening",
        "participationPatternExplanation": "Audience reaches understanding together with narrator - 'Ah, they're inviting thông gia, so it IS a wedding!' Collective recognition of truth. Participates through shared cultural knowledge of what thông gia means.",
        "emotionalValence": "mixed",
        "emotionalValenceExplanation": "Mixed valence - thông gia itself is positive (wedding celebration, family unity), but in this context it's evidence of deception, which is negative. Joy of wedding mixed with disapproval of lies. Complex emotional response."
      },
      "statistics": {
        "occurrences": 1,
        "phraseIds": [7],
        "totalPhrases": 9,
        "coverage": "11.1%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },
      "comparativeContext": {
        "uniquenessScore": 2,
        "uniquenessScoreExplanation": "Very common term in Vietnamese, appears in countless wedding-related songs, poems, and conversations. Not unique to this song. Universal in Vietnamese marriage discourse. Low uniqueness, high cultural ubiquity.",
        "similarExpressions": [
          {
            "expression": "họ hàng (relatives, extended family)",
            "similarity": "medium",
            "difference": "More general term for all relatives. Thông gia is specific to marriage-connected families, more precise than họ hàng. Different level of relationship specificity."
          },
          {
            "expression": "gia đình hai bên (families from both sides)",
            "similarity": "high",
            "difference": "More descriptive phrase explaining same concept. Thông gia is single compact term, 'gia đình hai bên' is multi-word explanation. Thông gia more culturally loaded."
          },
          {
            "expression": "bên vợ/bên chồng (wife's side/husband's side)",
            "similarity": "medium",
            "difference": "Describes sides from one person's perspective. Thông gia describes relationship between families from neutral perspective. Different relational orientation."
          }
        ],
        "regionalDistribution": "Used universally throughout Vietnam with no significant regional variation. Core kinship term in all Vietnamese dialects. May have slight pronunciation differences but concept is identical across regions.",
        "genreDistribution": "Appears in virtually all wedding songs, marriage-related folk songs, ceremonial speeches, and family narratives. One of most common terms in Vietnamese wedding discourse. Essential vocabulary for any marriage-themed song.",
        "historicalPersistence": "Used for many centuries, persists strongly in modern Vietnamese despite social changes. Even in urban contexts with love marriages, thông gia relationship remains important. Term shows remarkable historical stability."
      },
      "interpretiveGuidance": {
        "performanceTips": [
          "Emphasize 'thông gia' with clear enunciation - this is the crucial word that reveals the truth",
          "Slightly slow tempo on 'những người thông gia' to let the significance sink in",
          "Use tone of revelation or 'aha!' - this is the definitive evidence",
          "Facial expression should shift to knowing certainty - no more doubt after this",
          "Consider brief pause after 'thông gia' before continuing, allowing audience to process the implication",
          "In ensemble, other voices might echo 'thông gia!' with recognition"
        ],
        "culturalSensitivity": [
          "Understand that thông gia relationship is culturally important and generally positive - the issue here is not the relationship itself but the deception around it",
          "Recognize that in Vietnamese culture, marriage unites families in ways that may differ from Western nuclear family concepts",
          "Respect that thông gia obligations (mutual support, ongoing relationship) extend beyond wedding day - this is lifelong connection",
          "Be aware that thông gia relationship involves complex etiquette and protocols that vary by social class and region",
          "Avoid reducing this to simple 'in-laws' concept - the Vietnamese thông gia system has specific cultural features"
        ],
        "pedagogicalApproach": [
          "Step 1: Introduce term - teach pronunciation and literal meaning ('mutually connected families')",
          "Step 2: Explain Vietnamese kinship system - show where thông gia fits in family structure",
          "Step 3: Compare to English 'in-laws' - explain why this translation is inadequate",
          "Step 4: Describe thông gia rituals - teach about wedding protocols involving thông gia",
          "Step 5: Discuss obligations - explain ongoing mutual support responsibilities",
          "Step 6: Contextual understanding - show how 'inviting thông gia' proves wedding is happening",
          "Step 7: Cultural comparison - ask students about family-to-family relationships in their cultures",
          "Step 8: Performance - practice singing with appropriate emphasis and revelatory tone"
        ],
        "commonMisinterpretations": [
          "❌ Translating simply as 'in-laws' → ✅ Understanding thông gia as unique Vietnamese family relationship concept",
          "❌ Thinking this only means the couple's parents → ✅ Recognizing it refers to both entire extended families",
          "❌ Missing the ceremonial significance → ✅ Understanding that inviting thông gia is formal wedding protocol",
          "❌ Viewing as negative relationship → ✅ Seeing thông gia as honored, positive (though here used to expose deception)",
          "❌ Assuming modern Vietnamese don't use this → ✅ Knowing term remains current even in contemporary urban weddings"
        ]
      }
    },
    {
      "expression": "kéo về",
      "literal": "pull toward / drag back",
      "figurativeMeaning": "Stream in, gather, converge (describing large-scale movement of people)",
      "phraseIds": [8],
      "vietnameseCategory": "ẩn dụ vận động (motion metaphor)",
      "semanticMechanism": "metaphor",
      "culturalScope": "nationwide",
      "meaningDepth": "figurative",
      "culturalWeights": {
        "historicalDepth": 6,
        "historicalDepthExplanation": "Metaphorical use of 'kéo' (pull) for crowd movement has been in Vietnamese language for several generations (50-200 years). Reflects communal gathering patterns in traditional Vietnamese villages where large groups would assemble for weddings, festivals. Modern traditional usage.",
        "regionalSpecificity": 2,
        "regionalSpecificityExplanation": "Widespread throughout Vietnam with minimal regional variation. Standard metaphorical expression in Vietnamese for describing crowd movement. Nearly universal, not regionally specific. Found in all dialects.",
        "symbolicLoad": 5,
        "symbolicLoadExplanation": "Moderate symbolism - 'kéo' (pull) suggests magnetic attraction, inevitable convergence, collective movement. Implies families are drawn together by social obligation/celebration. More than literal 'coming' - suggests social force pulling people. Some metaphorical depth.",
        "ritualSignificance": 7,
        "ritualSignificanceExplanation": "High ritual significance in wedding context - describes essential pattern of wedding ceremony where families converge. The gathering itself is crucial ritual element. 'Kéo về' captures the social imperative to attend family ceremonies.",
        "transmissionImportance": 5,
        "transmissionImportanceExplanation": "Moderately important for understanding Vietnamese social dynamics and language patterns. Useful metaphor for communal gathering behaviors. Not critical for cultural survival but valuable for linguistic/cultural competence.",
        "emotionalResonance": 6,
        "emotionalResonanceExplanation": "Moderate-to-strong emotional impact - evokes imagery of large family gatherings, bustling wedding preparations, sense of communal celebration. For Vietnamese audiences, 'kéo về' creates vivid mental picture of wedding day activity and energy."
      },
      "complexityMetrics": {
        "layersOfMeaning": 2,
        "layersOfMeaningExplanation": "Two layers: 1) Literal motion - physical movement of people toward location, 2) Metaphorical - social obligation and collective celebration pulling families together. Moderate interpretive depth.",
        "crossDomainMapping": 6,
        "crossDomainMappingExplanation": "PHYSICAL FORCE → SOCIAL OBLIGATION. Maps pulling/dragging motion onto social compulsion to attend family events. Moderate metaphorical complexity - physical force represents social/emotional force bringing people together.",
        "culturalPrerequisites": 4,
        "culturalPrerequisitesExplanation": "Requires some understanding of: 1) Vietnamese wedding scale (large extended family gatherings), 2) Social obligation to attend family events, 3) Common motion metaphors in Vietnamese. Moderate cultural knowledge needed, less than kinship terms.",
        "idiomaticity": 5,
        "idiomaticityExplanation": "Semi-idiomatic. 'Kéo về' for crowd gathering is conventional but not completely frozen. Could also say 'đổ về' (pour toward), 'tụ về' (gather toward). Moderately fixed expression with some acceptable variations.",
        "contextDependence": 5,
        "contextDependenceExplanation": "Moderately context-dependent. Basic meaning (converge) is stable, but full significance depends on: 1) What event they're gathering for (wedding), 2) Who is gathering (two extended families), 3) From where (everywhere - 'khắp nơi'). Some context needed for full understanding.",
        "pedagogicalChallenge": 4,
        "pedagogicalChallengeExplanation": "Moderate challenge for learners. Need to explain: 1) Literal meaning of 'kéo' (pull/drag), 2) Metaphorical extension to crowd movement, 3) Wedding gathering context. Less challenging than kinship terms but requires understanding Vietnamese motion metaphors."
      },
      "semanticNetwork": {
        "sourceDomain": "PHYSICAL PULLING FORCE",
        "targetDomain": "SOCIAL GATHERING IMPERATIVE",
        "mappings": [
          {
            "source": "Pulling force (mechanical action)",
            "target": "Social obligation to attend ceremony"
          },
          {
            "source": "Objects being pulled (passive movement)",
            "target": "Family members being drawn to wedding"
          },
          {
            "source": "Direction of pull (toward center)",
            "target": "Convergence at wedding venue"
          },
          {
            "source": "Strength of pull (irresistible)",
            "target": "Importance of family ceremony"
          }
        ],
        "conceptualMetaphor": "SOCIAL OBLIGATION IS PHYSICAL FORCE"
      },
      "usagePatterns": {
        "phrasePosition": "middle",
        "phrasePositionExplanation": "Appears in phrase 8 of 9, near the end, describing the culmination of wedding preparations. Follows revelation of thông gia invitations. Part of climactic description of ceremony.",
        "syntacticRole": "predicate",
        "syntacticRoleExplanation": "Functions as main verb in 'Hai họ khắp nơi kéo về' (Both families from everywhere are streaming in). Describes the action/state of gathering.",
        "discourseFunction": "atmosphere",
        "discourseFunctionExplanation": "Creates vivid atmosphere of bustling wedding preparation, large-scale gathering. Builds sensory image of families converging from all directions. Intensifies sense of major ceremony happening.",
        "participationPattern": "listening",
        "participationPatternExplanation": "Audience visualizes the scene being described. Participates through imagination and memory of similar wedding gatherings. Not interactive but evocative.",
        "emotionalValence": "positive",
        "emotionalValenceExplanation": "Positive emotional tone - 'kéo về' in wedding context suggests joyful gathering, celebration, family unity. Though the overall song criticizes deception, this particular phrase evokes the positive energy of wedding preparation."
      },
      "statistics": {
        "occurrences": 1,
        "phraseIds": [8],
        "totalPhrases": 9,
        "coverage": "11.1%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },
      "comparativeContext": {
        "uniquenessScore": 3,
        "uniquenessScoreExplanation": "Common metaphorical expression in Vietnamese for crowd gathering. Not unique to this song or even to wedding songs. Found in many contexts describing people converging (markets, festivals, battles). Moderate frequency, low uniqueness.",
        "similarExpressions": [
          {
            "expression": "đổ về (pour toward)",
            "similarity": "high",
            "difference": "Different physical metaphor - liquid pouring vs. pulling force. 'Đổ về' might emphasize larger numbers or more chaotic movement, 'kéo về' suggests more directed, purposeful convergence."
          },
          {
            "expression": "tụ về (gather toward, assemble)",
            "similarity": "high",
            "difference": "More literal, less metaphorical. 'Tụ về' simply means gather, while 'kéo về' adds force/pulling imagery. 'Kéo về' is more vivid and dynamic."
          },
          {
            "expression": "ùa về (surge toward, rush toward)",
            "similarity": "medium",
            "difference": "'Ùa về' suggests sudden, rushed movement, possibly chaotic. 'Kéo về' implies steadier, more organized convergence. Different emotional/temporal qualities."
          }
        ],
        "regionalDistribution": "Used throughout Vietnam with no significant regional variation. Standard Vietnamese motion metaphor found in all regions. May have slight dialect differences in pronunciation but concept is universal.",
        "genreDistribution": "Common in narrative songs describing gatherings (weddings, festivals, markets, battles). Also in everyday speech. Not limited to any specific song genre but frequent in social/celebratory contexts.",
        "historicalPersistence": "Relatively stable metaphorical usage over past century. Continues in modern Vietnamese for describing crowd movement. Not archaic, still current in contemporary speech and song."
      },
      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'kéo về' with energy and movement - this phrase should feel dynamic",
          "Use rising pitch on 'kéo' and falling on 'về' to create sense of gathering motion",
          "Consider hand gesture suggesting pulling or gathering inward when singing this phrase",
          "Emphasize 'khắp nơi' (from everywhere) to stress the scale of gathering",
          "Increase tempo slightly on this phrase to convey bustling activity",
          "Let your voice suggest the building energy and numbers of people converging"
        ],
        "culturalSensitivity": [
          "Recognize that large family gatherings for weddings are important Vietnamese cultural practice - this isn't excess but tradition",
          "Understand that 'kéo về' reflects communal values where family ceremonies are collective, not individual events",
          "Respect that extended family attendance at weddings is social obligation, not just courtesy",
          "Be aware that the scale of gathering described reflects traditional Vietnamese wedding customs which may differ from smaller Western ceremonies",
          "Avoid viewing large family convergence as intrusive - in Vietnamese culture, this is proper and expected"
        ],
        "pedagogicalApproach": [
          "Step 1: Teach literal meaning - explain 'kéo' as 'pull' and 'về' as 'toward/back'",
          "Step 2: Demonstrate metaphorical usage - show how 'kéo' is used for crowd movement in Vietnamese",
          "Step 3: Provide visual imagery - help students picture families streaming in from different directions",
          "Step 4: Compare to English - discuss equivalent expressions like 'pour in,' 'stream in,' 'converge'",
          "Step 5: Contextualize - explain typical Vietnamese wedding attendance (extended families, large numbers)",
          "Step 6: Practice motion metaphors - give other examples of 'kéo' used metaphorically in Vietnamese",
          "Step 7: Performance - practice singing with appropriate energy and movement",
          "Step 8: Cultural connection - discuss how motion metaphors reflect cultural values about social gatherings"
        ],
        "commonMisinterpretations": [
          "❌ Translating literally as 'pull back' without metaphorical sense → ✅ Understanding this means 'converge,' 'stream in,' 'gather'",
          "❌ Missing the wedding context → ✅ Recognizing this describes families arriving for ceremony",
          "❌ Thinking 'kéo' suggests unwillingness → ✅ Understanding this is standard motion metaphor, not implying reluctance",
          "❌ Assuming small gathering → ✅ Recognizing 'khắp nơi kéo về' indicates large-scale convergence from many locations",
          "❌ Viewing as unique to this song → ✅ Knowing this is common Vietnamese expression for crowd gathering"
        ]
      }
    },
    {
      "expression": "dối người",
      "literal": "deceive people",
      "figurativeMeaning": "Violation of community trust and social honesty norms",
      "phraseIds": [2, 5],
      "vietnameseCategory": "khái niệm đạo đức (moral concept)",
      "semanticMechanism": "cultural_value_statement",
      "culturalScope": "nationwide",
      "meaningDepth": "cultural_specific",
      "culturalWeights": {
        "historicalDepth": 8,
        "historicalDepthExplanation": "Honesty and trustworthiness have been core Vietnamese values for centuries, influenced by Confucian ethics. 'Dối người' (deceiving others) represents fundamental moral transgression in traditional value system. Ancient ethical concept (500+ years).",
        "regionalSpecificity": 2,
        "regionalSpecificityExplanation": "Universal Vietnamese value - honesty is prized nationwide with no significant regional variation. Confucian influence on ethics was nationwide. 'Dối người' carries similar moral weight across all Vietnamese regions.",
        "symbolicLoad": 8,
        "symbolicLoadExplanation": "High symbolic weight - represents broader themes of trust, social harmony, family honor, and moral integrity. 'Dối người' isn't just lying, it's breaking social contract. Symbolizes tension between family privacy and community transparency. Deep cultural symbolism.",
        "ritualSignificance": 5,
        "ritualSignificanceExplanation": "Moderate ritual significance - truth-telling is expected in various ceremonies and social interactions. Wedding negotiations traditionally involved formal honesty about family backgrounds. Deception about marriage particularly serious because ceremonies are public, social events.",
        "transmissionImportance": 8,
        "transmissionImportanceExplanation": "Very important for cultural transmission - understanding Vietnamese ethics, social norms, and community values. Teaching about honesty, trust, and social consequences of deception is crucial cultural education. High importance for value transmission.",
        "emotionalResonance": 7,
        "emotionalResonanceExplanation": "Strong emotional impact - 'dối người' evokes moral disapproval, betrayal of trust, damage to reputation. For Vietnamese audiences, this phrase carries weight of community judgment and violation of core values. Significant emotional resonance."
      },
      "complexityMetrics": {
        "layersOfMeaning": 3,
        "layersOfMeaningExplanation": "Three layers: 1) Literal - parents lied to community, 2) Social - violation of community trust and transparency norms, 3) Moral - fundamental ethical transgression in Vietnamese value system. Multiple interpretive dimensions.",
        "crossDomainMapping": 5,
        "crossDomainMappingExplanation": "INDIVIDUAL ACTION → COMMUNITY HARM. Maps personal deception onto collective social damage. Moderate metaphorical complexity - 'dối người' implies not just lying but breaking social fabric, harming community trust.",
        "culturalPrerequisites": 7,
        "culturalPrerequisitesExplanation": "Requires understanding of: 1) Confucian ethics in Vietnamese culture, 2) Community vs. individual orientation, 3) Family honor and public reputation concerns, 4) Why wedding secrecy is particularly problematic, 5) Social consequences of deception. Substantial cultural knowledge needed.",
        "idiomaticity": 6,
        "idiomaticityExplanation": "Moderately idiomatic. 'Dối người' is common collocation for 'deceive others,' more natural than alternatives like 'lừa dối người khác.' Conventional phrasing but not completely frozen - could use 'lừa người,' 'gạt người.'",
        "contextDependence": 6,
        "contextDependenceExplanation": "Moderately context-dependent. Core meaning (deception) is clear, but moral weight and social implications depend on: 1) What is being hidden (wedding), 2) Why (family privacy vs. shame), 3) Who judges (community), 4) Consequences (loss of face/trust).",
        "pedagogicalChallenge": 7,
        "pedagogicalChallengeExplanation": "Challenging for non-Vietnamese learners because requires understanding: 1) Vietnamese collective vs. individual values, 2) Concept of face/reputation, 3) Community role in family affairs, 4) Why wedding secrecy is particularly problematic. Needs cultural framework to fully appreciate."
      },
      "semanticNetwork": {
        "sourceDomain": "VERBAL DECEPTION",
        "targetDomain": "SOCIAL CONTRACT VIOLATION",
        "mappings": [
          {
            "source": "Lying (individual dishonest act)",
            "target": "Breaking community trust (collective harm)"
          },
          {
            "source": "Deceived people (victims of lies)",
            "target": "Community whose norms are violated"
          },
          {
            "source": "Truth (factual accuracy)",
            "target": "Social transparency and honor"
          },
          {
            "source": "Discovery of deception (revelation)",
            "target": "Loss of face and reputation"
          }
        ],
        "conceptualMetaphor": "HONESTY IS SOCIAL FABRIC"
      },
      "usagePatterns": {
        "phrasePosition": "middle",
        "phrasePositionExplanation": "Appears in phrases 2 and 5 (refrain), at key points in narrative. First occurrence introduces central accusation, second occurrence (refrain) reinforces moral judgment. Strategic placement for emphasis.",
        "syntacticRole": "predicate",
        "syntacticRoleExplanation": "Functions as main verb phrase in 'bố mẹ cô đã dối người' (her parents have deceived people). Central accusation and moral claim of the song.",
        "discourseFunction": "emphasis",
        "discourseFunctionExplanation": "Emphasizes moral dimension of story. By repeating in refrain, song ensures community judgment is central message. Not just reporting facts but making moral statement about deception.",
        "participationPattern": "communal",
        "participationPatternExplanation": "Refrain 'đã dối người' likely sung communally or with emphasis, expressing collective disapproval. Audience participates in moral judgment through singing. Communal reinforcement of ethical norms.",
        "emotionalValence": "negative",
        "emotionalValenceExplanation": "Strongly negative - 'dối' (deceive) is morally condemning term. Expresses disapproval, betrayal, moral failing. No ambiguity - deception is wrong and this phrase conveys that judgment clearly."
      },
      "statistics": {
        "occurrences": 2,
        "phraseIds": [2, 5],
        "totalPhrases": 9,
        "coverage": "22.2%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 2,
          "ending": 0
        }
      },
      "comparativeContext": {
        "uniquenessScore": 4,
        "uniquenessScoreExplanation": "Moderately common in Vietnamese folk songs addressing social/moral themes. Not unique to this song, but the specific application to parents deceiving about daughter's wedding has some specificity. Common moral language but contextually distinctive.",
        "similarExpressions": [
          {
            "expression": "lừa dối (deceive, cheat)",
            "similarity": "high",
            "difference": "Very similar meaning, 'lừa dối' might imply more calculated/strategic deception. 'Dối người' emphasizes the social dimension (deceiving people/community) more than 'lừa dối.'"
          },
          {
            "expression": "gạt người (trick people, fool people)",
            "similarity": "medium",
            "difference": "'Gạt' suggests trickery or cleverness in deception. Lighter connotation than 'dối' which is more morally serious. 'Dối người' carries stronger ethical condemnation."
          },
          {
            "expression": "che giấu sự thật (hide the truth)",
            "similarity": "medium",
            "difference": "More neutral description of concealing truth. 'Dối người' is more accusatory and morally loaded. 'Che giấu' could have legitimate reasons, 'dối người' implies wrongdoing."
          }
        ],
        "regionalDistribution": "Used nationwide in Vietnam. Standard moral language found across all regions. Universal Vietnamese expression for condemning deception.",
        "genreDistribution": "Common in didactic folk songs, moral tales, social commentary songs. Appears in songs addressing betrayal, broken trust, social norms. Frequent in narrative/moralistic song traditions.",
        "historicalPersistence": "Stable usage over centuries as Vietnamese ethical vocabulary. Continues in modern Vietnamese with same moral weight. Traditional term that remains current."
      },
      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'dối người' with clear moral judgment - this is the central accusation",
          "Emphasize 'dối' to stress the wrongness of deception",
          "Use slightly louder volume or stronger tone on 'dối người' in refrain (phrase 5)",
          "Facial expression should convey disapproval or moral seriousness",
          "In ensemble performance, all voices should unite strongly on 'đã dối người' to represent community judgment",
          "Consider slight pause before 'dối người' to let the weight of accusation settle",
          "Second occurrence (refrain) should be even stronger than first, reinforcing judgment"
        ],
        "culturalSensitivity": [
          "Understand that Vietnamese cultural values emphasize honesty and community trust - this isn't just personal preference but deep cultural norm",
          "Recognize that deception about marriage is particularly serious because weddings are community, not purely private, events",
          "Be aware that while the song condemns deception, it may reflect complex reality where families faced genuine dilemmas about privacy vs. transparency",
          "Respect that face/reputation concerns in Vietnamese culture mean deception can have severe social consequences",
          "Avoid viewing this as simple moral condemnation - it also reflects community's role in regulating family behavior",
          "Understand historical context where marriages were family/community matters, not individual choices"
        ],
        "pedagogicalApproach": [
          "Step 1: Teach literal meaning - 'dối' (deceive), 'người' (people)",
          "Step 2: Explain cultural weight - discuss Vietnamese values of honesty, trust, community transparency",
          "Step 3: Compare to students' cultures - ask about honesty values and social consequences of lying in their backgrounds",
          "Step 4: Contextualize in song - explain why parents' deception is being publicly condemned",
          "Step 5: Discuss complexity - explore possible reasons parents might have concealed wedding (privacy, shame, timing)",
          "Step 6: Analyze refrain function - show how repetition reinforces moral message",
          "Step 7: Performance practice - sing with appropriate moral weight and judgment tone",
          "Step 8: Ethical reflection - discuss tensions between privacy rights and community transparency expectations"
        ],
        "commonMisinterpretations": [
          "❌ Thinking this is just neutral reporting of facts → ✅ Understanding this is moral accusation and community judgment",
          "❌ Missing the community dimension → ✅ Recognizing 'người' (people) emphasizes social/collective harm, not just individual lying",
          "❌ Viewing parents as simply evil → ✅ Understanding they may have faced complex social pressures even while doing wrong",
          "❌ Not recognizing refrain's function → ✅ Seeing that repetition emphasizes central moral message",
          "❌ Assuming this is unique accusation → ✅ Knowing 'dối người' is common Vietnamese moral language in folk songs"
        ]
      }
    }
  ],
  "aggregateStatistics": {
    "totalExpressions": 5,
    "uniqueExpressions": 5,
    "totalOccurrences": 6,
    "phrasesCovered": 6,
    "phraseCoverage": "66.7%",
    "averageCulturalWeight": 7.1,
    "averageCulturalWeightCalculation": "Mean of all cultural weight dimensions: (8+7+6+4+7+6 + 8+8+7+4+7+6 + 9+3+7+9+9+8 + 6+2+5+7+7+6 + 8+2+8+5+8+7) / 30 = 213/30 = 7.1",
    "averageComplexity": 6.4,
    "averageComplexityCalculation": "Mean of all complexity metrics: (3+5+8+7+8+7 + 3+6+8+7+8+8 + 3+4+9+9+6+9 + 2+6+4+5+5+4 + 3+5+7+6+6+7) / 30 = 192/30 = 6.4",
    "dominantMechanism": "euphemism and cultural concepts",
    "culturalRichness": "high",
    "culturalRichnessExplanation": "High cultural richness with 5 culturally significant expressions covering traditional women's work euphemisms, kinship terminology, motion metaphors, and moral values. Average cultural weight of 7.1 indicates strong cultural embedding. Expressions reflect multiple dimensions of Vietnamese traditional society."
  },
  "phrases": [
    {
      "id": 1,
      "text": "Có bao giờ tôi thấy như vậy đâu à",
      "syllableCount": 9,
      "type": "question",
      "linguisticType": "rhetorical_question",
      "english": "Have I ever seen such a thing before?",
      "culturalContext": "Opening rhetorical question expressing surprise or disbelief about discovering the deception",
      "figurativeExpressions": []
    },
    {
      "id": 2,
      "text": "Có ai ngờ bố mẹ cô đã dối người",
      "syllableCount": 9,
      "type": "narrative",
      "linguisticType": "exclamatory",
      "english": "Who would have thought her parents had deceived people",
      "culturalContext": "Central moral accusation - parents have violated community trust by lying about daughter's whereabouts",
      "figurativeExpressions": ["dối người"]
    },
    {
      "id": 3,
      "text": "Nói cô đã đi suối mà sao thấy mời",
      "syllableCount": 9,
      "type": "narrative",
      "linguisticType": "observation",
      "english": "They said she went to the stream, but why do I see invitations",
      "culturalContext": "First euphemistic excuse exposed - 'going to stream' contradicted by wedding invitations",
      "figurativeExpressions": ["đi suối"]
    },
    {
      "id": 4,
      "text": "Những người anh em đã về đây",
      "syllableCount": 7,
      "type": "narrative",
      "linguisticType": "observation",
      "english": "Siblings and relatives have already arrived here",
      "culturalContext": "Family gathering provides evidence of wedding ceremony",
      "figurativeExpressions": []
    },
    {
      "id": 5,
      "text": "Có ai ngờ bố mẹ cô đã dối người",
      "syllableCount": 9,
      "type": "refrain",
      "linguisticType": "exclamatory",
      "english": "Who would have thought her parents had deceived people",
      "culturalContext": "Refrain reinforces central moral judgment on parental deception",
      "figurativeExpressions": ["dối người"]
    },
    {
      "id": 6,
      "text": "Nói cô lấy củi trong rừng",
      "syllableCount": 6,
      "type": "narrative",
      "linguisticType": "observation",
      "english": "They said she went to gather firewood in the forest",
      "culturalContext": "Second euphemistic excuse exposed - 'gathering firewood' as cover for wedding preparations",
      "figurativeExpressions": ["lấy củi trong rừng"]
    },
    {
      "id": 7,
      "text": "Sao tôi thấy mời những người thông gia",
      "syllableCount": 8,
      "type": "narrative",
      "linguisticType": "observation",
      "english": "Why do I see invitations to the in-law families",
      "culturalContext": "Climax of evidence - thông gia invitations are undeniable proof of wedding ceremony",
      "figurativeExpressions": ["thông gia"]
    },
    {
      "id": 8,
      "text": "Hai họ khắp nơi kéo về",
      "syllableCount": 6,
      "type": "narrative",
      "linguisticType": "descriptive",
      "english": "Both clans from everywhere are streaming in",
      "culturalContext": "Visual imagery of large-scale family convergence for wedding",
      "figurativeExpressions": ["kéo về"]
    },
    {
      "id": 9,
      "text": "Cô nói sao",
      "syllableCount": 3,
      "type": "question",
      "linguisticType": "direct_question",
      "english": "What do you say now, miss?",
      "culturalContext": "Direct confrontation demanding explanation from the young woman",
      "figurativeExpressions": []
    }
  ]
}
