{
  "songTitle": "Hò đối đáp",
  "totalSyllables": 176,
  "enhancementVersion": "V3.0 DEEP",
  "enhancedBy": "Claude LLM",
  "enhancementDate": "2025-10-06",
  "sourceFile": "lyrics-enhanced-tier1/Hò đối đáp.json",

  "figurativeLanguageAnalysis": {
    "expressions": [
      {
        "expression": "ơ ơ",
        "literal": "vocable repetition (ơ ơ)",
        "meaning": "Rhythmic vocable used in rowing songs for synchronization and breath marking",
        "category": "onomatopoeia_vocable_reduplication",
        "phraseIds": [3, 5, 6, 9, 11, 14, 16],

        "culturalWeights": {
          "historicalDepth": 8,
          "explanation": "Rowing songs (hò) are centuries old in Vietnamese Mekong Delta culture, documented since at least 18th century. This vocable pattern is integral to the genre's ancient origins.",

          "regionalSpecificity": 7,
          "explanation": "Strongly associated with Southern Vietnamese (Mekong Delta) rowing and river work traditions. While rowing songs exist in other regions, this particular vocable pattern is distinctly southern.",

          "symbolicLoad": 3,
          "explanation": "Minimal symbolic meaning - primarily functional as rhythmic marker. However, does symbolize communal labor and river life to some degree.",

          "ritualSignificance": 4,
          "explanation": "Part of work song tradition which has ritual/ceremonial aspects (work as communal bonding), but not used in formal religious rituals. Medium significance in occupational traditions.",

          "transmissionImportance": 7,
          "explanation": "Essential for preserving rowing song (hò) genre authenticity. Without these vocables, the genre loses its distinctive rhythmic character. Important for cultural survival of work song traditions.",

          "emotionalResonance": 5,
          "explanation": "Moderate emotional impact - evokes nostalgia for traditional river life, communal work, and rural Vietnamese culture. Creates atmospheric mood but not intensely emotional."
        },

        "complexityMetrics": {
          "layersOfMeaning": 1,
          "explanation": "Single primary function: rhythmic vocable for coordination. No additional metaphorical or symbolic layers - purely functional.",

          "crossDomainMapping": 2,
          "explanation": "Minimal metaphor - maps sound to physical movement (rowing coordination). Simple, direct mapping with little abstraction.",

          "culturalPrerequisites": 4,
          "explanation": "Moderate background needed - must understand work song context, rowing culture, and function of vocables in Vietnamese music. Not immediately obvious to outsiders.",

          "idiomaticity": 8,
          "explanation": "Highly fixed expression - cannot substitute with other sounds while maintaining genre authenticity. Frozen vocable pattern specific to rowing songs.",

          "contextDependence": 7,
          "explanation": "Heavily dependent on rowing song context - meaningless outside this genre. Requires performance setting to convey full function.",

          "pedagogicalChallenge": 3,
          "explanation": "Easy to pronounce and perform, but explaining its function requires cultural context teaching. Non-natives may trivialize it as 'filler' without proper instruction."
        },

        "semanticNetwork": {
          "sourceDomain": "SOUND_VOCALIZATION",
          "targetDomain": "PHYSICAL_COORDINATION",
          "mappings": [
            {
              "source": "vocable 'ơ' sound",
              "target": "rowing stroke timing"
            },
            {
              "source": "repetition pattern",
              "target": "repetitive rowing motion"
            },
            {
              "source": "breath pause",
              "target": "rhythmic work cycle"
            },
            {
              "source": "vocable duration",
              "target": "stroke phase timing"
            }
          ],
          "conceptualMetaphor": "SOUND IS MOVEMENT COORDINATION"
        },

        "usagePatterns": {
          "phrasePosition": "ending",
          "explanation": "Consistently appears at phrase endings (44% of phrases), marking phrase boundaries and breath points",

          "syntacticRole": "rhythmic_vocable",
          "explanation": "Non-grammatical element - serves musical/rhythmic function rather than semantic content",

          "discourseFunction": "rhythm_marking_and_breath",
          "explanation": "Provides rhythmic punctuation, allows singers to breathe, and maintains rowing coordination",

          "participationPattern": "communal_responsive",
          "explanation": "In traditional performance, rowers internalize this rhythm and coordinate movements. Call-and-response pattern with physical work.",

          "emotionalValence": "neutral_functional",
          "explanation": "Not emotionally charged - serves practical function. Creates atmospheric mood through repetition."
        },

        "statistics": {
          "occurrences": 8,
          "phraseIds": [3, 6, 9, 11, 14, 16],
          "totalPhrases": 18,
          "coverage": "44.4%",
          "positionDistribution": {
            "beginning": 0,
            "middle": 0,
            "ending": 8
          },
          "notes": "Appears in 8 different instances across 6 phrases (some phrases have multiple instances)"
        },

        "comparativeContext": {
          "uniquenessScore": 4,
          "explanation": "Common across many Vietnamese rowing songs (hò genre). Not unique to this song, but essential to the genre. Similar vocables found in regional variations.",

          "similarExpressions": [
            {
              "expression": "hò ơ (in Hò giã gạo, Hò mái nhì)",
              "similarity": "high",
              "difference": "Combines rowing call 'hò' with vocable 'ơ' - similar function but slightly different sound pattern"
            },
            {
              "expression": "ơi ơi (in love songs like Lý Chiều Chiều)",
              "similarity": "medium",
              "difference": "Similar sound but different function - 'ơi' is emotional calling vocable in love songs, not work coordination"
            },
            {
              "expression": "la la / na na (in quan họ folk songs)",
              "similarity": "medium",
              "difference": "Different region (Northern), different vocable sounds, but similar functional role as melodic filler"
            }
          ],

          "regionalDistribution": "Southern Vietnam (Mekong Delta) - dominant in river work song traditions. Less common in Northern or Central regions which have different vocable patterns.",

          "genreDistribution": "Exclusive to rowing/work songs (hò chèo, hò đối đáp, hò giã gạo). Not found in ceremonial songs, lullabies, or love songs except when those genres quote work song style.",

          "historicalPersistence": "Centuries-old tradition - documented in colonial-era ethnographic records. Continues in contemporary folk music preservation efforts, though less common as actual rowing work declines."
        },

        "interpretiveGuidance": {
          "performanceTips": [
            "Pronounce 'ơ' with relaxed, open throat - similar to English 'uh' but slightly more open, mid-central vowel",
            "Keep rhythm steady and consistent - vocables mark rowing strokes, must be metronomic",
            "Slight emphasis on first 'ơ' (downbeat), lighter on second 'ơ' (upbeat) - matches rowing stroke pattern",
            "Breathe naturally during and after vocables - they're designed as breath spaces between lyrical content",
            "If performing with movement, sync a rowing gesture (pull motion) with each 'ơ' vocable",
            "Maintain moderate volume - not shouted, but projected to be heard by rowing crew"
          ],

          "culturalSensitivity": [
            "These are NOT 'meaningless sounds' or 'filler' - they are functional work song elements with specific coordination purpose",
            "Respect the labor tradition behind rowing songs - these helped coordinate hard physical work in hot, difficult conditions",
            "Avoid mocking or trivializing vocables as 'gibberish' - they are essential musical structure with cultural-historical significance",
            "Acknowledge the Mekong Delta communities who created and preserved this tradition",
            "Be aware that traditional rowing work is declining - this music preserves endangered occupational culture",
            "Outside performers should credit the regional tradition and avoid claiming ownership of the style"
          ],

          "pedagogicalApproach": [
            "Step 1: Physical demonstration - show rowing motion in real time, sync vocables with oar pull and recovery strokes",
            "Step 2: Rhythmic practice - have students clap or tap steady beat while singing vocables, establishing metronomic consistency",
            "Step 3: Explain function - discuss how work songs coordinate group labor, with vocables as timing signals",
            "Step 4: Cultural context - show photos/videos of traditional Mekong rowing, discuss river transportation history",
            "Step 5: Comparative analysis - connect to similar vocables in other cultures (sea shanties, railroad work songs, agricultural songs)",
            "Step 6: Full integration - perform complete song with vocables properly placed at phrase endings"
          ],

          "commonMisinterpretations": [
            "❌ 'Just filler words with no meaning' → ✅ Essential rhythmic and coordinative elements - function IS the meaning",
            "❌ 'Can be skipped or removed for simplification' → ✅ Cannot remove without destroying song structure and genre authenticity",
            "❌ 'Vietnamese language has no meaning here' → ✅ Vocables transcend semantic meaning - they have pragmatic/functional meaning",
            "❌ 'All Vietnamese vocables are the same' → ✅ Different genres use different vocables ('ơ' for work, 'ơi' for emotion, 'la' for quan họ)",
            "❌ 'Modern versions don't need these old vocables' → ✅ Removing vocables modernizes away the genre's essential character"
          ]
        }
      },

      {
        "expression": "lang lắng",
        "literal": "lang (?) + lắng (settle/calm)",
        "meaning": "Rhyming compound phrase used for musicality and rhythmic flow, not literal meaning",
        "category": "rhyming_reduplication",
        "phraseIds": [4, 12],

        "culturalWeights": {
          "historicalDepth": 7,
          "explanation": "Rhyming compounds are ancient feature of Vietnamese poetry and folk songs, dating back centuries. This specific phrase appears in multiple traditional hò songs, suggesting long historical usage.",

          "regionalSpecificity": 6,
          "explanation": "Common in Southern Vietnamese folk music, though rhyming patterns exist across all regions. This specific 'lang lắng' pattern shows Southern dialect features.",

          "symbolicLoad": 2,
          "explanation": "Minimal symbolic content - primarily serves phonetic/musical function. 'Lắng' means 'settle' but phrase isn't used literally.",

          "ritualSignificance": 2,
          "explanation": "No ritual function - purely musical/poetic device within the song structure.",

          "transmissionImportance": 6,
          "explanation": "Important for teaching Vietnamese phonetic beauty and rhyming traditions. Preserves folk music's distinctive sound patterns.",

          "emotionalResonance": 4,
          "explanation": "Creates pleasant auditory effect through rhyme, contributing to song's musical charm. Mild emotional impact through sound beauty."
        },

        "complexityMetrics": {
          "layersOfMeaning": 1,
          "explanation": "Single layer - phonetic rhyming device. No deeper metaphorical or symbolic meaning beyond sound beauty.",

          "crossDomainMapping": 1,
          "explanation": "No metaphorical mapping - it's a sound pattern, not a conceptual metaphor.",

          "culturalPrerequisites": 3,
          "explanation": "Minimal prerequisite knowledge needed. Understanding enhances appreciation but not required for basic comprehension.",

          "idiomaticity": 6,
          "explanation": "Semi-fixed expression - 'lắng' (settle/listen carefully) is the meaningful word, 'lang' is added for rhyme. Moderately idiomatic.",

          "contextDependence": 5,
          "explanation": "Moderately context-dependent - works best in musical context where rhyme and rhythm matter. Can be understood outside context but loses impact.",

          "pedagogicalChallenge": 2,
          "explanation": "Easy to teach - simple concept (rhyming for beauty). Non-natives may need to practice the tones to get rhyme effect."
        },

        "semanticNetwork": {
          "sourceDomain": "SOUND_PATTERN",
          "targetDomain": "AESTHETIC_BEAUTY",
          "mappings": [
            {
              "source": "rhyming syllables",
              "target": "musical harmony"
            },
            {
              "source": "rhythmic flow",
              "target": "pleasing sound"
            },
            {
              "source": "redundancy (lang + lắng)",
              "target": "emphasis and memorability"
            }
          ],
          "conceptualMetaphor": "SOUND IS BEAUTY"
        },

        "usagePatterns": {
          "phrasePosition": "middle",
          "explanation": "Appears in mid-phrase position, embedded in larger calling phrase 'Chào bạn lang lắng tai nghe ta'",

          "syntacticRole": "phonetic_modifier",
          "explanation": "'Lang' modifies 'lắng' (settle/calm), creating rhyming compound before 'tai' (ear)",

          "discourseFunction": "musicality_and_flow",
          "explanation": "Adds rhythmic flow and phonetic beauty to the invitation phrase. Makes the calling phrase more melodious.",

          "participationPattern": "communal_call",
          "explanation": "Part of calling phrase directed at audience/partner in call-and-response structure",

          "emotionalValence": "positive_inviting",
          "explanation": "Creates friendly, inviting tone through pleasant rhyme. Enhances the welcoming nature of 'Chào bạn' (greetings friend)."
        },

        "statistics": {
          "occurrences": 2,
          "phraseIds": [4, 12],
          "totalPhrases": 18,
          "coverage": "11.1%",
          "positionDistribution": {
            "beginning": 0,
            "middle": 2,
            "ending": 0
          }
        },

        "comparativeContext": {
          "uniquenessScore": 5,
          "explanation": "Moderately unique - this specific 'lang lắng' compound appears in some other folk songs but not universally common. The pattern of rhyming compounds is universal, but this specific pairing is somewhat distinctive.",

          "similarExpressions": [
            {
              "expression": "lắng tai (in many folk songs)",
              "similarity": "high",
              "difference": "Without 'lang' prefix - just means 'listen carefully' without rhyming ornament"
            },
            {
              "expression": "lang thang (wandering)",
              "similarity": "medium",
              "difference": "Uses same 'lang' prefix for rhyme, but 'thang' has different meaning - both use rhyming reduplication pattern"
            },
            {
              "expression": "tình tang (love and affection)",
              "similarity": "medium",
              "difference": "Different rhyme pattern but similar function - phonetic beauty through rhyme"
            }
          ],

          "regionalDistribution": "Southern Vietnam predominantly, but rhyming compounds found across all regions with regional variations",

          "genreDistribution": "Common in work songs, love songs, and folk poetry. Part of broader Vietnamese tradition of tonal rhyming.",

          "historicalPersistence": "Centuries old - Vietnamese poetry has always emphasized tonal and phonetic patterns. This tradition continues in modern songwriting."
        },

        "interpretiveGuidance": {
          "performanceTips": [
            "Emphasize the rhyme - make sure 'lang' and 'lắng' have clear tonal connection",
            "'Lang' uses mid-level tone (ngang), 'lắng' uses high-rising tone (sắc) - practice the tonal relationship",
            "Keep the two syllables connected rhythmically - they form a compound unit",
            "Don't overthink literal meaning of 'lang' - it's there for sound, not sense",
            "The compound modifies 'lắng tai' (listen carefully) - perform as fluid three-syllable unit"
          ],

          "culturalSensitivity": [
            "Vietnamese rhyming is tonal - not just final syllable matching like English. Respect the tonal complexity.",
            "These rhyming patterns show Vietnamese linguistic artistry - don't dismiss as 'nonsense words'",
            "Folk music preserves linguistic features that might be lost in modern standard Vietnamese",
            "Regional pronunciations affect rhyme quality - Southern 'r' → 'l' pronunciation makes these rhymes work"
          ],

          "pedagogicalApproach": [
            "Step 1: Teach the meaningful word first - 'lắng tai' = listen carefully",
            "Step 2: Add 'lang' prefix and explain rhyming function",
            "Step 3: Practice tonal pronunciation - 'lang' (mid) vs 'lắng' (rising)",
            "Step 4: Compare to similar patterns in English ('lovey-dovey', 'super-duper') and other languages",
            "Step 5: Have students create their own rhyming compounds following Vietnamese tonal patterns"
          ],

          "commonMisinterpretations": [
            "❌ 'Lang must have a meaning I'm missing' → ✅ It's primarily phonetic - added for rhyme and rhythm",
            "❌ 'This is baby talk or informal speech' → ✅ It's sophisticated poetic device, not childish",
            "❌ 'Rhyming words always have related meanings' → ✅ In Vietnamese folk music, rhyme is often for sound beauty alone",
            "❌ 'I can skip 'lang' and just say 'lắng tai'' → ✅ You'd lose the poetic/musical quality that defines the genre"
          ]
        }
      },

      {
        "expression": "oan ương",
        "literal": "mandarin ducks / ill-fated lovers",
        "meaning": "Metaphor for star-crossed lovers or an ill-fated romantic bond, referencing mandarin ducks which mate for life",
        "category": "animal_metaphor_cultural_symbol",
        "phraseIds": [3],

        "culturalWeights": {
          "historicalDepth": 9,
          "explanation": "Ancient East Asian symbol dating back over 1000 years to Chinese Tang Dynasty poetry. Mandarin duck symbolism is deeply rooted in Vietnamese, Chinese, Korean literary traditions.",

          "regionalSpecificity": 4,
          "explanation": "Pan-East Asian symbol, not unique to Vietnam. However, the specific phrase 'nợ oan ương' (debt of ill-fated love) has Vietnamese folk song resonance.",

          "symbolicLoad": 9,
          "explanation": "Extremely rich symbolism - mandarin ducks represent fidelity, inseparable couples, destined love. The 'oan' (wronged/ill-fated) adds layer of tragedy and karmic debt.",

          "ritualSignificance": 6,
          "explanation": "Mandarin duck imagery appears in weddings (symbolizing lasting union) and in ancestral worship contexts. Moderate ritual significance in romantic/marriage ceremonies.",

          "transmissionImportance": 8,
          "explanation": "Core metaphor in Vietnamese romantic literature and folk songs. Essential for understanding love poetry and traditional narratives about fate and romance.",

          "emotionalResonance": 9,
          "explanation": "Highly emotionally charged - evokes deep feelings of tragic love, karmic bonds, inescapable romantic fate. Powerful resonance in Vietnamese romantic sensibility."
        },

        "complexityMetrics": {
          "layersOfMeaning": 4,
          "explanation": "Multiple layers: 1) Literal bird reference 2) Symbol of fidelity 3) Metaphor for destined couple 4) 'Oan' adds tragic/karmic dimension. Rich multi-layered symbol.",

          "crossDomainMapping": 8,
          "explanation": "Complex metaphor: ANIMALS (ducks) → HUMAN RELATIONSHIPS (lovers) → ABSTRACT CONCEPTS (fate, karma, debt). Multiple conceptual domains bridged.",

          "culturalPrerequisites": 7,
          "explanation": "Requires knowledge of: mandarin duck symbolism, East Asian concepts of fate (duyên), karmic debt, and traditional views of destined love. Significant cultural knowledge needed.",

          "idiomaticity": 9,
          "explanation": "Completely frozen metaphor - 'oan ương' always means ill-fated lovers, cannot decompose or substitute. Highly idiomatic cultural phrase.",

          "contextDependence": 6,
          "explanation": "Moderately context-dependent - works in isolation but full emotional impact requires romantic/tragic song context. Understood in most Vietnamese contexts.",

          "pedagogicalChallenge": 7,
          "explanation": "Challenging to teach non-Vietnamese - requires explaining animal symbolism, fate concepts, and cultural attitudes toward destined love. Multiple cultural frameworks needed."
        },

        "semanticNetwork": {
          "sourceDomain": "ANIMAL_BEHAVIOR",
          "targetDomain": "HUMAN_ROMANTIC_FATE",
          "mappings": [
            {
              "source": "mandarin ducks mate for life",
              "target": "lovers are inseparably bonded"
            },
            {
              "source": "ducks swim together always",
              "target": "lovers cannot escape each other"
            },
            {
              "source": "if one duck dies, other mourns",
              "target": "love persists beyond death"
            },
            {
              "source": "'oan' (wronged/ill-fate)",
              "target": "karmic debt from past lives"
            },
            {
              "source": "nợ (debt)",
              "target": "obligation that must be repaid"
            }
          ],
          "conceptualMetaphor": "DESTINED LOVE IS AN INESCAPABLE DEBT"
        },

        "usagePatterns": {
          "phrasePosition": "middle",
          "explanation": "Appears in middle of complaint phrase, as the object of 'nợ' (debt) - 'the debt of ill-fated love presses upon me'",

          "syntacticRole": "noun_phrase_object",
          "explanation": "Functions as noun phrase - 'nợ oan ương' (debt of ill-fated love) is the grammatical object that 'presses and follows'",

          "discourseFunction": "emotional_explanation",
          "explanation": "Explains the source of the speaker's emotional burden - the ill-fated romantic bond that cannot be escaped",

          "participationPattern": "individual_lament",
          "explanation": "Speaker expresses personal suffering - audience listens sympathetically to this lament",

          "emotionalValence": "negative_tragic",
          "explanation": "Strong negative emotional tone - burden, suffering, inescapable fate. Tragic rather than angry."
        },

        "statistics": {
          "occurrences": 1,
          "phraseIds": [3],
          "totalPhrases": 18,
          "coverage": "5.6%",
          "positionDistribution": {
            "beginning": 0,
            "middle": 1,
            "ending": 0
          }
        },

        "comparativeContext": {
          "uniquenessScore": 6,
          "explanation": "Moderately unique - 'oan ương' is common in Vietnamese literature, but 'nợ oan ương' (debt of ill-fated love) is a more specific, poetic construction found in folk songs.",

          "similarExpressions": [
            {
              "expression": "yuān yāng (鴛鴦) in Chinese poetry",
              "similarity": "very_high",
              "difference": "Same origin - Vietnamese borrowed from Chinese. Both mean mandarin ducks / fated lovers."
            },
            {
              "expression": "chim uyên ương (in other Vietnamese songs)",
              "similarity": "high",
              "difference": "Adds 'chim' (bird) for clarity - same basic metaphor but more explicit"
            },
            {
              "expression": "duyên kiếp (fate/destiny)",
              "similarity": "medium",
              "difference": "Similar concept of destined romantic bond, but uses abstract terms rather than animal metaphor"
            },
            {
              "expression": "tình nghiệp (romantic karma)",
              "similarity": "medium",
              "difference": "Similar idea of romantic obligation/burden but without specific animal imagery"
            }
          ],

          "regionalDistribution": "Nationwide - mandarin duck symbolism understood across all Vietnamese regions. Northern, Central, Southern folk songs all use this metaphor.",

          "genreDistribution": "Common in love songs, tragic romance tales, opera (cải lương). Also appears in poetry and literature. Universal romantic metaphor across genres.",

          "historicalPersistence": "Over 1000 years - from Tang Dynasty Chinese poetry → Vietnamese Nôm literature → modern folk songs. One of the most enduring romantic symbols in Vietnamese culture."
        },

        "interpretiveGuidance": {
          "performanceTips": [
            "Sing 'oan ương' with weight and sorrow - it carries the emotional burden of the entire phrase",
            "Emphasize 'nợ' (debt) before 'oan ương' - the debt metaphor is crucial to the meaning",
            "Don't rush these two words - give them space to convey the tragic weight",
            "If using gesture, a hand to the heart on 'oan ương' conveys the emotional burden effectively",
            "Tone: 'oan' (ngang - level), 'ương' (ngang - level) - keep both tones steady and sustained"
          ],

          "culturalSensitivity": [
            "This is not just a 'pretty bird reference' - it's a profound statement about fate and karma",
            "Understand traditional Vietnamese views of predestined love (duyên) before performing",
            "Respect the Buddhist/Taoist concepts of karmic debt underlying this metaphor",
            "Avoid mocking or treating lightly - this expresses genuine suffering in Vietnamese folk tradition",
            "Be aware that modern Vietnamese may have different views on fate vs. free will in love"
          ],

          "pedagogicalApproach": [
            "Step 1: Show images of mandarin ducks - explain they mate for life, stay together always",
            "Step 2: Introduce East Asian symbolism - how these ducks became metaphor for inseparable lovers",
            "Step 3: Explain 'oan' (wronged/ill-fated) - tragic dimension added to the symbol",
            "Step 4: Discuss Vietnamese concepts of duyên (destined romantic affinity) and nghiệp (karmic obligation)",
            "Step 5: Connect to similar concepts in other cultures (star-crossed lovers, soulmates, twin flames)",
            "Step 6: Analyze how this metaphor functions in the song - expressing inescapable romantic burden"
          ],

          "commonMisinterpretations": [
            "❌ 'Just means boyfriend/girlfriend' → ✅ Means fated, inseparable, karmically-bound lovers - much deeper than casual relationship",
            "❌ 'Positive symbol of happy couple' → ✅ In this context with 'oan' (ill-fated) and 'nợ' (debt), it's tragic and burdensome",
            "❌ 'Modern metaphor' → ✅ Over 1000 years old, deeply traditional symbol",
            "❌ 'Can translate as just 'love'' → ✅ Must preserve the fate/karma dimension - 'destined tragic love' is closer",
            "❌ 'Vietnamese-specific symbol' → ✅ Pan-East Asian (Chinese, Korean, Vietnamese all share this)"
          ]
        }
      },

      {
        "expression": "dồn dập",
        "literal": "pressing, crowding, relentless",
        "meaning": "Reduplication expressing relentless pressure, urgency, or overwhelming force",
        "category": "reduplication_intensification",
        "phraseIds": [3],

        "culturalWeights": {
          "historicalDepth": 6,
          "explanation": "Vietnamese reduplication patterns are centuries old. This specific form appears in folk songs and poetry from at least the 19th century, possibly earlier.",

          "regionalSpecificity": 5,
          "explanation": "Common across all Vietnamese regions, though pronunciation may vary slightly. Standard Vietnamese reduplication pattern.",

          "symbolicLoad": 4,
          "explanation": "Moderate symbolism - the doubling intensifies the meaning, suggesting overwhelming force. Symbolizes being trapped or pursued.",

          "ritualSignificance": 1,
          "explanation": "No ritual significance - purely descriptive/emotional language.",

          "transmissionImportance": 6,
          "explanation": "Important for teaching Vietnamese reduplication patterns and how they intensify meaning. Demonstrates Vietnamese linguistic structure.",

          "emotionalResonance": 7,
          "explanation": "Strong emotional impact - creates visceral sense of pressure and anxiety. The reduplication itself sounds urgent and relentless."
        },

        "complexityMetrics": {
          "layersOfMeaning": 2,
          "explanation": "Two layers: 1) Literal pressure/crowding 2) Emotional/psychological pressure. Moderate layering.",

          "crossDomainMapping": 5,
          "explanation": "Moderate metaphor - maps physical pressure to emotional burden. PHYSICAL FORCE → EMOTIONAL STATE.",

          "culturalPrerequisites": 3,
          "explanation": "Minimal cultural background needed - the emotion is relatively universal. Understanding Vietnamese reduplication patterns helps but not essential.",

          "idiomaticity": 7,
          "explanation": "Fairly fixed expression - 'dồn dập' is the standard way to express relentless pressure. Cannot easily substitute or decompose.",

          "contextDependence": 4,
          "explanation": "Moderately context-dependent - works in isolation but emotional impact enhanced by song context (karmic love debt).",

          "pedagogicalChallenge": 4,
          "explanation": "Moderate challenge - must explain Vietnamese reduplication as intensification device. The concept of pressure is universal, making it easier."
        },

        "semanticNetwork": {
          "sourceDomain": "PHYSICAL_FORCE",
          "targetDomain": "EMOTIONAL_BURDEN",
          "mappings": [
            {
              "source": "physical crowding/pushing",
              "target": "emotional pressure"
            },
            {
              "source": "relentless pressing",
              "target": "constant psychological stress"
            },
            {
              "source": "being surrounded",
              "target": "being overwhelmed by fate"
            }
          ],
          "conceptualMetaphor": "EMOTIONAL BURDEN IS PHYSICAL PRESSURE"
        },

        "usagePatterns": {
          "phrasePosition": "middle",
          "explanation": "Modifies 'nó' (it) referring to the karmic debt - describes how the debt 'presses relentlessly'",

          "syntacticRole": "adverbial_descriptor",
          "explanation": "Functions as adverb describing the manner of the pressing - 'presses in a dồn dập (relentless) way'",

          "discourseFunction": "intensification_emphasis",
          "explanation": "Intensifies the sense of being pursued by fate - not just pressing, but pressing relentlessly",

          "participationPattern": "individual_expression",
          "explanation": "Speaker expresses personal feeling - audience empathizes with the relentless pressure described",

          "emotionalValence": "negative_anxious",
          "explanation": "Strong negative tone - conveys anxiety, stress, feeling trapped and overwhelmed."
        },

        "statistics": {
          "occurrences": 1,
          "phraseIds": [3],
          "totalPhrases": 18,
          "coverage": "5.6%",
          "positionDistribution": {
            "beginning": 0,
            "middle": 1,
            "ending": 0
          }
        },

        "comparativeContext": {
          "uniquenessScore": 4,
          "explanation": "Common expression - 'dồn dập' appears frequently in Vietnamese to describe relentless pressure (work, debt, emotions). Standard Vietnamese reduplication.",

          "similarExpressions": [
            {
              "expression": "dồn dập (in news, literature)",
              "similarity": "identical",
              "difference": "Same expression used in various contexts - war, work, financial pressure"
            },
            {
              "expression": "liên miên (continuous)",
              "similarity": "medium",
              "difference": "Also expresses relentlessness but more neutral - 'continuous' rather than 'pressing'"
            },
            {
              "expression": "liên tục (without stop)",
              "similarity": "medium",
              "difference": "Emphasizes continuity without the pressure/force connotation"
            }
          ],

          "regionalDistribution": "Nationwide - standard Vietnamese across all regions",

          "genreDistribution": "Common in folk songs, literature, news media - used whenever describing relentless pressure or attacks",

          "historicalPersistence": "Centuries old - Vietnamese reduplication patterns have long history. Modern usage continues strong."
        },

        "interpretiveGuidance": {
          "performanceTips": [
            "Emphasize both syllables equally - 'dồn' 'dập' with equal weight shows the relentlessness",
            "Keep rhythm steady and unrelenting during these words - match meaning with delivery",
            "Tones: 'dồn' (rising tone), 'dập' (falling tone) - practice the tonal movement",
            "Slight crescendo through the word can enhance the sense of building pressure",
            "Connect 'dồn dập' closely with 'nó theo hoài' (it keeps following) - they form one continuous image of pursuit"
          ],

          "culturalSensitivity": [
            "Vietnamese reduplication is sophisticated linguistic device, not 'repetitive' or 'redundant'",
            "The doubling intensifies and adds nuance - it's not just emphasis but a specific type of relentlessness",
            "Respect that this describes real emotional experience in folk tradition - not poetic exaggeration"
          ],

          "pedagogicalApproach": [
            "Step 1: Teach base word 'dồn' (to push/press together)",
            "Step 2: Explain how reduplication with tonal variation intensifies and modifies meaning",
            "Step 3: Compare to English intensifiers ('press and press', 'over and over') but note Vietnamese does this through tone",
            "Step 4: Have students feel the rhythmic relentlessness by clapping or tapping the pattern",
            "Step 5: Practice with other Vietnamese reduplications (lảng vảng, ngọt ngào) to see the pattern"
          ],

          "commonMisinterpretations": [
            "❌ 'Just means pressing' → ✅ Means relentlessly, overwhelmingly pressing - the reduplication adds crucial intensity",
            "❌ 'Repetitive language' → ✅ Sophisticated grammatical intensification pattern",
            "❌ 'Can be translated as single English word' → ✅ Often needs phrase in English ('pressing relentlessly', 'overwhelming pressure')",
            "❌ 'Either syllable works alone' → ✅ The compound is the meaningful unit, cannot separate"
          ]
        }
      },

      {
        "expression": "quân tử",
        "literal": "nobleman / gentleman",
        "meaning": "Confucian ideal of the morally cultivated person, gentleman with virtue and integrity",
        "category": "confucian_philosophical_concept",
        "phraseIds": [9, 18],

        "culturalWeights": {
          "historicalDepth": 10,
          "explanation": "Ancient Confucian concept from 6th century BCE China, central to Vietnamese traditional education and moral philosophy for over 1000 years. Core concept in classical Vietnamese literature.",

          "regionalSpecificity": 3,
          "explanation": "Pan-East Asian concept - shared across China, Vietnam, Korea, Japan. Not regionally specific within Vietnam - understood nationwide.",

          "symbolicLoad": 9,
          "explanation": "Extremely rich symbolism - represents moral cultivation, self-discipline, righteousness, wisdom, and social responsibility. Contrasts with 'tiểu nhân' (petty person).",

          "ritualSignificance": 8,
          "explanation": "Central to Confucian rituals, ancestor worship, and traditional Vietnamese ceremonies. Scholar-officials embodied this ideal. High ritual importance in traditional society.",

          "transmissionImportance": 9,
          "explanation": "Essential for understanding Vietnamese traditional values, literature, and social hierarchy. Core concept for cultural transmission and moral education.",

          "emotionalResonance": 7,
          "explanation": "Strong emotional resonance - evokes respect, aspiration, nostalgia for traditional values. Carries weight of moral authority and social responsibility."
        },

        "complexityMetrics": {
          "layersOfMeaning": 5,
          "explanation": "Multiple layers: 1) Literal nobleman 2) Moral cultivated person 3) Social ideal 4) Political responsibility 5) Spiritual self-cultivation. Extremely multi-layered concept.",

          "crossDomainMapping": 7,
          "explanation": "Complex mapping: SOCIAL STATUS → MORAL QUALITY → BEHAVIORAL STANDARDS → SPIRITUAL CULTIVATION. Bridges multiple conceptual domains.",

          "culturalPrerequisites": 9,
          "explanation": "Requires extensive knowledge of Confucian philosophy, Vietnamese traditional social structure, classical education system, and moral philosophy. Very high prerequisites.",

          "idiomaticity": 10,
          "explanation": "Completely frozen term - 'quân tử' is the fixed classical Chinese term for this concept. Cannot decompose or translate literally. Fully idiomatic.",

          "contextDependence": 6,
          "explanation": "Moderately context-dependent - recognizable in isolation but full meaning requires philosophical context. Works across many contexts.",

          "pedagogicalChallenge": 9,
          "explanation": "Extremely challenging to teach non-Vietnamese - requires explaining Confucian philosophy, traditional Vietnamese social values, and historical context. One of the most complex cultural concepts."
        },

        "semanticNetwork": {
          "sourceDomain": "SOCIAL_STATUS",
          "targetDomain": "MORAL_CULTIVATION",
          "mappings": [
            {
              "source": "nobleman by birth",
              "target": "morally cultivated person"
            },
            {
              "source": "high social position",
              "target": "high moral standards"
            },
            {
              "source": "leadership role",
              "target": "ethical responsibility"
            },
            {
              "source": "education and refinement",
              "target": "self-cultivation and wisdom"
            }
          ],
          "conceptualMetaphor": "MORAL VIRTUE IS SOCIAL NOBILITY"
        },

        "usagePatterns": {
          "phrasePosition": "beginning",
          "explanation": "Opens moral commentary phrases - 'Quân tử tồn' (The gentleman endures). Sets philosophical tone.",

          "syntacticRole": "subject_noun",
          "explanation": "Functions as subject of the sentence - the gentleman who endures moral duty",

          "discourseFunction": "moral_authority_invocation",
          "explanation": "Invokes Confucian moral authority to frame the song's advice and philosophical content",

          "participationPattern": "collective_moral_teaching",
          "explanation": "Addresses community with shared moral framework - not personal but collective wisdom",

          "emotionalValence": "serious_respectful",
          "explanation": "Grave, respectful tone - invokes tradition and moral weight. Elevates the discourse."
        },

        "statistics": {
          "occurrences": 2,
          "phraseIds": [9, 18],
          "totalPhrases": 18,
          "coverage": "11.1%",
          "positionDistribution": {
            "beginning": 2,
            "middle": 0,
            "ending": 0
          }
        },

        "comparativeContext": {
          "uniquenessScore": 7,
          "explanation": "Moderately unique - 'quân tử' appears in classical literature and formal contexts, but less common in folk work songs. Its appearance here elevates the rowing song to philosophical discourse.",

          "similarExpressions": [
            {
              "expression": "君子 jūnzǐ (Chinese classical texts)",
              "similarity": "identical",
              "difference": "Same term - Vietnamese borrowed from Chinese Confucian texts"
            },
            {
              "expression": "bậc quân tử (Vietnamese elaboration)",
              "similarity": "high",
              "difference": "Adds 'bậc' (level/rank) for emphasis - 'level of gentleman'"
            },
            {
              "expression": "người tử tế (decent person)",
              "similarity": "medium",
              "difference": "Modern colloquial term - similar meaning but lacks classical/philosophical weight"
            }
          ],

          "regionalDistribution": "Nationwide - Confucian concepts permeate all Vietnamese regions, though stronger in scholarly/educated contexts",

          "genreDistribution": "Common in classical poetry, historical texts, moral teachings. Rare in work songs - its presence here shows blend of folk and literary traditions.",

          "historicalPersistence": "Over 2500 years (from Confucius) - remains relevant in Vietnamese culture today, though interpreted modernly. One of the most enduring philosophical concepts."
        },

        "interpretiveGuidance": {
          "performanceTips": [
            "Pronounce with gravity and respect - 'Quân tử' carries moral weight",
            "Tones: 'quân' (ngang - level), 'tử' (hỏi - falling-rising) - precise tonal execution shows education",
            "Pause slightly after 'quân tử' to let the concept register before continuing",
            "If using gesture, a slight bow or hand to chest shows respect for the concept",
            "Connect to 'tồn' (endure) - the gentleman's defining quality is perseverance in duty"
          ],

          "culturalSensitivity": [
            "This is not just 'gentleman' in English sense - it's a profound philosophical concept",
            "Respect the Confucian tradition - 'quân tử' represents 2500 years of moral philosophy",
            "Be aware of modern critiques - Confucian ideals can be seen as patriarchal or hierarchical",
            "Don't trivialize as 'old-fashioned' - these values still resonate in Vietnamese culture",
            "Understand that Vietnamese workers invoking 'quân tử' shows education and dignity - not class pretension"
          ],

          "pedagogicalApproach": [
            "Step 1: Introduce Confucius and basic Confucian philosophy - self-cultivation, moral duty, social harmony",
            "Step 2: Explain 'quân tử' vs 'tiểu nhân' (petty person) contrast - central to Confucian ethics",
            "Step 3: Show how Vietnamese traditional education centered on becoming 'quân tử'",
            "Step 4: Discuss why a rowing song references this concept - dignity of labor, moral education for all classes",
            "Step 5: Compare to Western concepts (gentleman, virtuous person) noting important differences",
            "Step 6: Analyze modern relevance - how these ideals persist or evolve in contemporary Vietnam"
          ],

          "commonMisinterpretations": [
            "❌ 'Just means gentleman/nobleman' → ✅ Means morally cultivated person regardless of birth - moral quality not social status",
            "❌ 'Elitist concept' → ✅ In folk song context, shows that moral cultivation belongs to all people, including workers",
            "❌ 'Old-fashioned irrelevant concept' → ✅ Still deeply influential in Vietnamese values and behavior",
            "❌ 'Simple translation to English' → ✅ No exact equivalent - requires explanation of Confucian framework",
            "❌ 'Only for scholars' → ✅ Rowing song shows common people internalized these ideals"
          ]
        }
      },

      {
        "expression": "sớm cháo chiều rau",
        "literal": "morning porridge, evening vegetables",
        "meaning": "Idiom for extreme poverty and frugal living - eating simple porridge for breakfast and only vegetables for dinner",
        "category": "set_phrase_poverty_metaphor",
        "phraseIds": [13],

        "culturalWeights": {
          "historicalDepth": 7,
          "explanation": "Centuries-old Vietnamese phrase describing peasant poverty. Reflects historical reality of rural Vietnamese subsistence living. Common in folk literature and songs.",

          "regionalSpecificity": 6,
          "explanation": "Specific to Vietnamese agricultural society - though poverty is universal, this specific food pattern is culturally Vietnamese. Understood across all regions.",

          "symbolicLoad": 6,
          "explanation": "Strong symbolism - the specific foods represent minimal sustenance. Porridge = watered-down rice (stretches limited grain), vegetables = free/cheap foraged greens.",

          "ritualSignificance": 2,
          "explanation": "No ritual significance - describes everyday poverty, not ceremonial context.",

          "transmissionImportance": 7,
          "explanation": "Important for understanding Vietnamese rural poverty, agricultural hardship, and folk song themes of testing true love through adversity.",

          "emotionalResonance": 8,
          "explanation": "Strong emotional impact - evokes sympathy, reflects real historical suffering, tests romantic commitment. Deeply resonant for those who lived through poverty."
        },

        "complexityMetrics": {
          "layersOfMeaning": 2,
          "explanation": "Two layers: 1) Literal description of poor diet 2) Symbol of overall poverty and hardship. Moderate layering.",

          "crossDomainMapping": 4,
          "explanation": "Moderate metaphor - uses specific meals to represent general poverty. FOOD QUALITY → ECONOMIC STATUS.",

          "culturalPrerequisites": 5,
          "explanation": "Moderate prerequisites - need to understand Vietnamese agricultural society, rice-based diet, and folk song themes of testing love through hardship.",

          "idiomaticity": 8,
          "explanation": "Highly fixed phrase - always this specific food pairing, in this order. Cannot substitute or rearrange. Set idiom.",

          "contextDependence": 5,
          "explanation": "Moderately context-dependent - works in isolation but full impact requires romantic testing context ('will you stay with me if we're poor?').",

          "pedagogicalChallenge": 5,
          "explanation": "Moderate challenge - concept of poverty is universal, but explaining specific Vietnamese foods and cultural context of romantic testing requires background."
        },

        "semanticNetwork": {
          "sourceDomain": "FOOD_QUALITY",
          "targetDomain": "ECONOMIC_STATUS",
          "mappings": [
            {
              "source": "watered-down porridge (cháo)",
              "target": "extreme poverty"
            },
            {
              "source": "only vegetables (rau)",
              "target": "no money for meat/fish"
            },
            {
              "source": "morning vs evening pattern",
              "target": "all-day deprivation"
            },
            {
              "source": "minimal sustenance",
              "target": "subsistence living"
            }
          ],
          "conceptualMetaphor": "POVERTY IS INADEQUATE FOOD"
        },

        "usagePatterns": {
          "phrasePosition": "middle",
          "explanation": "Embedded in hypothetical question - 'If you encounter hardship... morning porridge evening vegetables...'",

          "syntacticRole": "descriptive_elaboration",
          "explanation": "Elaborates on 'khó nghèo' (hardship and poverty) with specific vivid example",

          "discourseFunction": "romantic_test",
          "explanation": "Tests the beloved - 'Will you stay with me even if we're this poor?' Common folk song trope.",

          "participationPattern": "question_to_beloved",
          "explanation": "Speaker poses hypothetical to test romantic commitment - awaits implicit answer",

          "emotionalValence": "concern_testing",
          "explanation": "Anxious, testing tone - genuinely concerned about partner's commitment through hardship."
        },

        "statistics": {
          "occurrences": 1,
          "phraseIds": [13],
          "totalPhrases": 18,
          "coverage": "5.6%",
          "positionDistribution": {
            "beginning": 0,
            "middle": 1,
            "ending": 0
          }
        },

        "comparativeContext": {
          "uniquenessScore": 7,
          "explanation": "Moderately unique - this specific phrase is distinctly Vietnamese. While poverty metaphors exist everywhere, 'sớm cháo chiều rau' is a fixed Vietnamese idiom.",

          "similarExpressions": [
            {
              "expression": "ăn cháo đá bát (eat porridge and throw away bowl)",
              "similarity": "medium",
              "difference": "Different meaning - ungrateful behavior, not poverty description"
            },
            {
              "expression": "nghèo rớt mồng tơi (poor to the point of losing loincloth)",
              "similarity": "medium",
              "difference": "Also describes extreme poverty but through clothing metaphor, not food"
            },
            {
              "expression": "'bread and water' (English)",
              "similarity": "medium",
              "difference": "Similar concept (minimal food = poverty) but different cultural specifics"
            }
          ],

          "regionalDistribution": "Nationwide - poverty and rice-based diet universal across Vietnamese regions",

          "genreDistribution": "Common in folk songs testing romantic commitment. Also in literature describing rural hardship. Classic folk song trope.",

          "historicalPersistence": "Centuries old - reflects agricultural poverty from feudal era through modern times. Still understood today though less lived reality."
        },

        "interpretiveGuidance": {
          "performanceTips": [
            "Sing with genuine concern and vulnerability - this tests real commitment",
            "Emphasize 'sớm... chiều' (morning... evening) to show all-day deprivation",
            "Keep tone gentle, not accusatory - it's a sincere question, not challenge",
            "Tones: 'sớm' (sắc-rising), 'cháo' (sắc-rising), 'chiều' (huyền-falling), 'rau' (huyền-falling) - practice tonal flow",
            "Connect to the following advice 'hãy vui dạ' (please be content) - they form one complete thought"
          ],

          "culturalSensitivity": [
            "This describes real historical poverty - not romanticizing or trivializing hardship",
            "Understand that this was lived reality for millions of Vietnamese peasants",
            "The romantic test reflects real economic insecurity in traditional marriage",
            "Respect that 'staying through poverty' was/is a genuine test of love in Vietnamese culture",
            "Be aware modern Vietnamese may have different economic realities, but the metaphor persists"
          ],

          "pedagogicalApproach": [
            "Step 1: Explain Vietnamese rice-based diet - porridge (cháo) is watered-down rice, stretches limited grain",
            "Step 2: Discuss vegetable-only diet - no meat/fish shows extreme poverty in Vietnamese context",
            "Step 3: Show historical photos/descriptions of Vietnamese rural poverty to contextualize",
            "Step 4: Explain folk song trope: testing love through hypothetical hardship",
            "Step 5: Compare to similar romantic tests in other cultures (richer/poorer wedding vows)",
            "Step 6: Analyze why this specific phrase is so evocative in Vietnamese culture"
          ],

          "commonMisinterpretations": [
            "❌ 'Just describing meals' → ✅ Idiom for extreme poverty - the specific foods symbolize deprivation",
            "❌ 'Healthy vegetarian diet' → ✅ In context, means cannot afford meat/fish - sign of poverty, not choice",
            "❌ 'Modern concept' → ✅ Centuries-old phrase from agricultural society",
            "❌ 'Exaggeration' → ✅ Literal reality for many Vietnamese peasants historically",
            "❌ 'Unimportant detail' → ✅ Central to the romantic test - 'will you love me even in poverty?'"
          ]
        }
      },

      {
        "expression": "ông trời",
        "literal": "grandfather heaven / heavenly grandfather",
        "meaning": "Personification of heaven or fate as benevolent but judging authority figure",
        "category": "personification_religious_cultural",
        "phraseIds": [8],

        "culturalWeights": {
          "historicalDepth": 9,
          "explanation": "Ancient Vietnamese personification of heaven, blending indigenous beliefs with Chinese Tiān (heaven) concept. Centuries old, predating Buddhism/Christianity in Vietnam.",

          "regionalSpecificity": 5,
          "explanation": "Common across Vietnam with slight regional variations. Understood nationwide as referring to heaven/fate/divine judgment.",

          "symbolicLoad": 8,
          "explanation": "Rich symbolism - combines familial respect ('ông' = grandfather) with cosmic authority (heaven). Represents both judgmental and protective aspects of divine.",

          "ritualSignificance": 7,
          "explanation": "Invoked in prayers, oaths, and appeals for justice. Important in folk religion and ancestor worship. Moderate to high ritual significance.",

          "transmissionImportance": 8,
          "explanation": "Essential for understanding Vietnamese folk religion, concepts of divine judgment, karma, and moral causation. Core cultural concept.",

          "emotionalResonance": 7,
          "explanation": "Strong emotional resonance - evokes fear of judgment, hope for protection, respect for cosmic order. Familiar yet awesome."
        },

        "complexityMetrics": {
          "layersOfMeaning": 4,
          "explanation": "Multiple layers: 1) Literal sky 2) Personified deity 3) Karmic law 4) Familial authority figure. Rich multi-layered concept.",

          "crossDomainMapping": 7,
          "explanation": "Complex metaphor: FAMILY ELDER → COSMIC AUTHORITY → MORAL JUDGE → FATE. Bridges multiple domains.",

          "culturalPrerequisites": 6,
          "explanation": "Moderate to high prerequisites - need to understand Vietnamese folk religion, ancestor worship, familial respect, and concepts of divine judgment.",

          "idiomaticity": 9,
          "explanation": "Highly fixed expression - 'ông trời' is the standard way to personify heaven. Cannot decompose or substitute.",

          "contextDependence": 5,
          "explanation": "Moderately context-dependent - recognizable alone but full meaning requires understanding of fear, respect, and karmic consequences.",

          "pedagogicalChallenge": 6,
          "explanation": "Challenging to teach - must explain Vietnamese folk religion, familial honorifics, and concepts of divine judgment distinct from Western monotheism."
        },

        "semanticNetwork": {
          "sourceDomain": "FAMILY_AUTHORITY",
          "targetDomain": "COSMIC_MORAL_JUDGE",
          "mappings": [
            {
              "source": "grandfather (respected elder)",
              "target": "heaven (cosmic authority)"
            },
            {
              "source": "family patriarch judgment",
              "target": "divine/karmic judgment"
            },
            {
              "source": "elder protection",
              "target": "heavenly protection"
            },
            {
              "source": "respect for ancestor",
              "target": "reverence for cosmic order"
            }
          ],
          "conceptualMetaphor": "HEAVEN IS FAMILY PATRIARCH"
        },

        "usagePatterns": {
          "phrasePosition": "middle",
          "explanation": "Subject of fear clause - 'I fear ông trời will judge...' - expresses moral anxiety",

          "syntacticRole": "subject_agent",
          "explanation": "Subject who will perform the action of divine judgment/retribution",

          "discourseFunction": "moral_authority_invocation",
          "explanation": "Invokes cosmic moral authority to express fear of karmic consequences",

          "participationPattern": "individual_fear_expression",
          "explanation": "Speaker expresses personal fear - audience understands shared moral framework",

          "emotionalValence": "fearful_respectful",
          "explanation": "Fear mixed with respect - acknowledges superior moral authority."
        },

        "statistics": {
          "occurrences": 1,
          "phraseIds": [8],
          "totalPhrases": 18,
          "coverage": "5.6%",
          "positionDistribution": {
            "beginning": 0,
            "middle": 1,
            "ending": 0
          }
        },

        "comparativeContext": {
          "uniquenessScore": 7,
          "explanation": "Moderately unique - 'ông trời' is distinctly Vietnamese way of personifying heaven. Other cultures have heaven concepts but this specific familial framing is Vietnamese.",

          "similarExpressions": [
            {
              "expression": "Tiān (天) in Chinese",
              "similarity": "high",
              "difference": "Same concept but Vietnamese adds 'ông' (grandfather) - more personified and familial"
            },
            {
              "expression": "trời cao (high heaven)",
              "similarity": "medium",
              "difference": "More abstract, less personified - emphasizes distance rather than familial authority"
            },
            {
              "expression": "Chúa trời (Lord heaven/God)",
              "similarity": "medium",
              "difference": "Christian influence - 'Chúa' (Lord) rather than 'ông' (grandfather), more monotheistic"
            }
          ],

          "regionalDistribution": "Nationwide - folk religious concept across all Vietnamese regions",

          "genreDistribution": "Common in folk songs, prayers, oaths, moral teachings. Universal across Vietnamese oral traditions.",

          "historicalPersistence": "Ancient to modern - predates formal religions in Vietnam, persists despite Buddhism/Christianity/Communism. Enduring folk concept."
        },

        "interpretiveGuidance": {
          "performanceTips": [
            "Sing 'ông trời' with mixture of reverence and fear - not casual reference",
            "Tones: 'ông' (ngang-level), 'trời' (huyền-falling) - practice smooth tonal transition",
            "Connect 'sợ' (fear) closely with 'ông trời' - the fear is directed at divine judgment",
            "If using gesture, a slight glance upward on 'ông trời' indicates heaven",
            "Maintain serious tone - this is genuine moral anxiety, not superstition"
          ],

          "culturalSensitivity": [
            "This is not 'primitive superstition' - it's sophisticated folk religious concept",
            "Respect Vietnamese folk religion - not inferior to organized religions",
            "Understand 'ông' (grandfather) shows Vietnamese frame heaven as familial, not distant",
            "Be aware modern Vietnamese may mix this with Buddhist/Christian/secular views",
            "Don't trivialize as 'cute' - it expresses real moral fear and accountability"
          ],

          "pedagogicalApproach": [
            "Step 1: Explain Vietnamese familial respect - 'ông' (grandfather) is honored authority figure",
            "Step 2: Introduce concept of heaven (trời) in Vietnamese folk religion - not personal god but cosmic moral order",
            "Step 3: Show how combining 'ông' + 'trời' creates personified but familial deity",
            "Step 4: Discuss divine judgment and karma in Vietnamese folk belief",
            "Step 5: Compare to other cultures' heaven concepts, noting Vietnamese specific features",
            "Step 6: Analyze function in song - moral accountability even for common people"
          ],

          "commonMisinterpretations": [
            "❌ 'Same as Christian God' → ✅ Different concept - more impersonal cosmic order personified as family elder",
            "❌ 'Just means sky' → ✅ Means heaven as moral judge and fate-controller",
            "❌ 'Grandfather in heaven' → ✅ Heaven personified AS grandfather - not ancestor in heaven",
            "❌ 'Superstitious belief' → ✅ Sophisticated folk religious concept blending multiple traditions",
            "❌ 'Only old people believe this' → ✅ Phrase persists across generations, though interpreted variously"
          ]
        }
      },

      {
        "expression": "nghĩa vợ tình chồng",
        "literal": "wife's duty, husband's love",
        "meaning": "Balanced marital relationship - wife provides moral duty/righteousness, husband provides emotional love",
        "category": "parallel_structure_gender_roles",
        "phraseIds": [11],

        "culturalWeights": {
          "historicalDepth": 8,
          "explanation": "Centuries-old Vietnamese concept of gender roles in marriage. Reflects Confucian influence but with Vietnamese modifications. Appears in folk literature and songs.",

          "regionalSpecificity": 5,
          "explanation": "Common across all Vietnamese regions - traditional marriage concepts understood nationwide.",

          "symbolicLoad": 7,
          "explanation": "Rich symbolism - assigns different virtues to each gender (nghĩa = duty/righteousness for women, tình = emotion/love for men). Reflects traditional gender philosophy.",

          "ritualSignificance": 6,
          "explanation": "Important in wedding ceremonies and marriage advice. Moderate ritual significance in traditional Vietnamese marriage culture.",

          "transmissionImportance": 7,
          "explanation": "Important for understanding traditional Vietnamese gender roles, marriage ideals, and how folk songs transmit social values.",

          "emotionalResonance": 6,
          "explanation": "Moderate to strong resonance - evokes traditional family values, though modern Vietnamese may view differently. Some find it comforting, others restrictive."
        },

        "complexityMetrics": {
          "layersOfMeaning": 3,
          "explanation": "Three layers: 1) Literal division of marital roles 2) Complementary partnership ideal 3) Gendered virtue assignment. Moderate complexity.",

          "crossDomainMapping": 6,
          "explanation": "Moderate to complex metaphor: GENDER → VIRTUE TYPE → MARITAL FUNCTION. Maps social categories onto moral qualities.",

          "culturalPrerequisites": 7,
          "explanation": "Significant prerequisites - requires understanding Vietnamese traditional gender roles, Confucian influence, and concepts of nghĩa vs tình distinction.",

          "idiomaticity": 8,
          "explanation": "Highly fixed parallel phrase - always this specific pairing, cannot rearrange or substitute. Set idiom for marital roles.",

          "contextDependence": 5,
          "explanation": "Moderately context-dependent - recognizable alone but full meaning requires marriage advice context.",

          "pedagogicalChallenge": 7,
          "explanation": "Challenging to teach - must explain traditional gender roles without endorsing/rejecting, show historical context, discuss modern debates."
        },

        "semanticNetwork": {
          "sourceDomain": "GENDERED_VIRTUES",
          "targetDomain": "MARITAL_HARMONY",
          "mappings": [
            {
              "source": "wife's nghĩa (duty/righteousness)",
              "target": "moral foundation of marriage"
            },
            {
              "source": "husband's tình (emotion/love)",
              "target": "emotional bond of marriage"
            },
            {
              "source": "complementary virtues",
              "target": "balanced partnership"
            },
            {
              "source": "parallel structure",
              "target": "equal but different contributions"
            }
          ],
          "conceptualMetaphor": "MARRIAGE IS COMPLEMENTARY VIRTUES"
        },

        "usagePatterns": {
          "phrasePosition": "beginning",
          "explanation": "Opens advice clause about proper marital behavior - sets framework for following advice",

          "syntacticRole": "topic_subject",
          "explanation": "Topic that the following advice elaborates on - 'as for wife's duty and husband's love, then...'",

          "discourseFunction": "traditional_moral_instruction",
          "explanation": "Provides traditional teaching about proper marital roles and behavior",

          "participationPattern": "collective_wisdom_transmission",
          "explanation": "Transmits shared cultural values about marriage - speaks to community, not individual",

          "emotionalValence": "didactic_warm",
          "explanation": "Teaching tone but warm and affirming - presents traditional ideal gently."
        },

        "statistics": {
          "occurrences": 1,
          "phraseIds": [11],
          "totalPhrases": 18,
          "coverage": "5.6%",
          "positionDistribution": {
            "beginning": 1,
            "middle": 0,
            "ending": 0
          }
        },

        "comparativeContext": {
          "uniquenessScore": 7,
          "explanation": "Moderately unique - this specific parallel phrasing is distinctly Vietnamese. While gender roles exist everywhere, 'nghĩa vợ tình chồng' is a fixed Vietnamese idiom.",

          "similarExpressions": [
            {
              "expression": "vợ chồng (wife-husband)",
              "similarity": "low",
              "difference": "Simple noun compound - doesn't specify virtues or roles, just the relationship"
            },
            {
              "expression": "tình nghĩa (love and duty)",
              "similarity": "medium",
              "difference": "General moral pairing without gender assignment - used more broadly"
            },
            {
              "expression": "相夫教子 (Chinese: serve husband, teach children)",
              "similarity": "medium",
              "difference": "Similar Confucian gender role concept but focuses on women's duties only"
            }
          ],

          "regionalDistribution": "Nationwide - traditional marriage concepts understood across all regions",

          "genreDistribution": "Common in marriage advice songs, moral teachings, folk wisdom. Classic folk song theme.",

          "historicalPersistence": "Centuries old - reflects traditional marriage values. Modern interpretation varies, but phrase persists."
        },

        "interpretiveGuidance": {
          "performanceTips": [
            "Sing with warmth and respect - this is traditional wisdom, not commandment",
            "Emphasize the parallel structure - 'nghĩa vợ' and 'tình chồng' are balanced pair",
            "Tones: 'nghĩa' (ngã-falling-rising), 'vợ' (hỏi-falling-rising), 'tình' (huyền-falling), 'chồng' (huyền-falling) - practice tonal flow",
            "Connect to following advice 'núp lẻn yêu nhau' (hide and love secretly) - they form complete thought",
            "Avoid judgmental tone - present as folk wisdom, not prescription"
          ],

          "culturalSensitivity": [
            "This reflects traditional gender roles - understand historical context without necessarily endorsing",
            "Be aware modern Vietnamese have diverse views on gender roles - some embrace, others critique",
            "Respect that this was meaningful guidance in its time and context",
            "Don't dismiss as 'oppressive' or romanticize as 'beautiful' - complex cultural artifact",
            "Acknowledge that 'nghĩa' (duty/righteousness) for women vs 'tình' (emotion) for men shows gendered virtue assignment"
          ],

          "pedagogicalApproach": [
            "Step 1: Explain nghĩa (duty/righteousness/moral obligation) vs tình (emotion/love/affection) distinction in Vietnamese",
            "Step 2: Discuss traditional Vietnamese gender roles in Confucian-influenced society",
            "Step 3: Analyze why these specific virtues were assigned to each gender",
            "Step 4: Show how folk songs transmit and also subtly question social norms",
            "Step 5: Discuss modern Vietnamese debates about gender roles and marriage",
            "Step 6: Compare to gender role concepts in other cultures, noting similarities and differences"
          ],

          "commonMisinterpretations": [
            "❌ 'Wife only has duty, no love' → ✅ Both have love, but emphasis differs - wife's distinguished by moral duty, husband's by emotional expression",
            "❌ 'Unequal relationship' → ✅ Intended as complementary balance - different but equal contributions",
            "❌ 'Modern Vietnamese still follow this' → ✅ Modern interpretations vary greatly - some embrace, others reject",
            "❌ 'Simple gender stereotype' → ✅ Complex philosophical distinction about types of virtue and marital contributions",
            "❌ 'Only about hierarchy' → ✅ More about complementarity and balance than hierarchy (though hierarchy exists)"
          ]
        }
      }
    ]
  },

  "aggregateStatistics": {
    "totalExpressions": 8,
    "uniqueExpressions": 8,
    "totalOccurrences": 17,
    "phrasesCovered": 10,
    "phraseCoverage": "55.6%",
    "averageCulturalWeight": 6.44,
    "averageComplexity": 5.69,
    "dominantMechanism": "reduplication_and_cultural_symbols",
    "culturalRichness": "very_high"
  },

  "collectionContext": {
    "genreClassification": "Hò đối đáp (call-and-response rowing song)",
    "culturalSignificance": "Traditional work song from Mekong Delta representing river-based labor culture. Example of sophisticated call-and-response structure blending practical coordination with philosophical/romantic content.",
    "linguisticProfile": "Southern Vietnamese dialect features, extensive use of vocables for rowing coordination, rich reduplication patterns, blends Confucian concepts with folk romanticism",
    "performanceContext": "Traditionally sung by rowers on Mekong Delta rivers to coordinate rowing strokes and pass time during long journeys. Call-and-response structure between lead singer and crew. Modern performance in folk music preservation contexts.",
    "pedagogicalValue": "Excellent for teaching: Vietnamese vocable systems, reduplication intensification, cultural metaphors (mandarin ducks), work song traditions, call-and-response structures, and integration of literary concepts (quân tử) into folk music"
  }
}
