{
  "songName": "Đò Đưa quan họ",
  "songFolder": "Do_Dua",
  "lyrics": {
    "phrases": [
      {
        "text": "Bập ơ a bập bềnh sóng a nước đêm trăng.",
        "translation": "[Translation pending]"
      },
      {
        "text": "Thuyền ơ a băng sóng bạc a lướt dòng cuộn",
        "translation": "[Translation pending]"
      },
      {
        "text": "trôi mà trăng in mặt nước sáng ngời,",
        "translation": "[Translation pending]"
      },
      {
        "text": "Tiếng ơ a hò a vang vọng a nước non",
        "translation": "[Translation pending]"
      },
      {
        "text": "tâm tình,",
        "translation": "[Translation pending]"
      },
      {
        "text": "em ước a gì mà rằng có lưới giăng sông.",
        "translation": "[Translation pending]"
      }
    ],
    "syllables": [
      "Bập",
      "ơ",
      "a",
      "bập",
      "bềnh",
      "sóng",
      "a",
      "nước",
      "đêm",
      "trăng.",
      "Thuyền",
      "ơ",
      "a",
      "băng",
      "sóng",
      "bạc",
      "a",
      "lướt",
      "dòng",
      "cuộn",
      "trôi",
      "mà",
      "trăng",
      "in",
      "mặt",
      "nước",
      "sáng",
      "ngời,",
      "Tiếng",
      "ơ",
      "a",
      "hò",
      "a",
      "vang",
      "vọng",
      "a",
      "nước",
      "non",
      "tâm",
      "tình,",
      "em",
      "ước",
      "a",
      "gì",
      "mà",
      "rằng",
      "có",
      "lưới",
      "giăng",
      "sông."
    ],
    "hasLyrics": true
  },
  "musical": "<p>This traditional Vietnamese folk song demonstrates the pentatonic scale structure typical of Northern Vietnamese music. The melody follows the characteristic quan họ style with its distinctive call-and-response patterns.</p>",
  "performance": "<p>Play with gentle finger techniques, emphasizing the flowing melody that mimics the movement of water. The tempo should be moderate, allowing for expressive ornamentation on key notes.</p>",
  "cultural": "<p>Quan họ is a UNESCO-recognized folk singing tradition from Bắc Ninh and Bắc Giang provinces. This particular song represents the riverine culture of Northern Vietnam, where ferries were essential for transportation and social connection.</p>",
  "history": "<p>Dating back several centuries, this melody has been passed down through generations of Vietnamese musicians. The song emerged from the Red River Delta region where waterways formed the primary transportation network.</p>",
  "variations": "<p>Different regions of Vietnam have their own interpretations of this melody. The Southern version tends to use different ornamentations, while Central Vietnamese performers may adjust the tuning to match their regional scales.</p>"
}