{
  "songTitle": "Hát chúc tết",
  "analysisVersion": "V3.0_DEEP",
  "analysisDate": "2025-10-06",
  "sourceData": "lyrics-enhanced-tier1/Hát chúc tết.json",

  "expressions": [
    {
      "expression": "Phát rác",
      "literal": "greetings/felicitations",
      "meaning": "Traditional Tet greeting formula - ceremonial opening salutation",
      "type": "ceremonial_formula",

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Multi-century tradition of Tet visiting customs. Pre-colonial roots in Vietnamese village reciprocity systems, formalized during Lê dynasty (15th-18th century) when ritual greetings became codified in folk songs.",

        "regionalSpecificity": 7,
        "explanation": "Northern Vietnam highland minority pronunciation variant. Standard Vietnamese 'phát lộc' (wish prosperity) transformed to 'phát rác' in dialectal pronunciation, indicating Tày-Nùng ethnic minority regions of northern mountains.",

        "symbolicLoad": 7,
        "explanation": "Multi-layered symbolism: 1) Visitor announcing peaceful intent, 2) Invoking spirits' blessing through correct ritual speech, 3) Activating host-guest reciprocity obligations central to Vietnamese social structure.",

        "ritualSignificance": 9,
        "explanation": "Essential ceremonial opening for Tet house visits. Cannot be omitted without violating ritual protocol. Marks transition from ordinary time to sacred Tet time. Hosts expect this exact formula before accepting visitor.",

        "transmissionImportance": 8,
        "explanation": "Critical for preserving highland minority Tet customs. Younger generations must learn proper greeting sequence to maintain community cohesion. Loss of this formula indicates cultural assimilation pressure.",

        "emotionalResonance": 7,
        "explanation": "Evokes communal warmth, ancestral continuity, renewal of social bonds. Hearing this greeting triggers nostalgic memories of childhood Tet celebrations, reinforcing collective identity during diaspora."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "1) Literal: greetings, 2) Social: activating reciprocity, 3) Ritual: marking sacred time, 4) Historical: preserving pre-colonial customs. Dialectal form adds ethnic identity layer.",

        "crossDomainMapping": 6,
        "explanation": "SPEECH → SOCIAL_CONTRACT: Spoken formula creates binding obligation for host to welcome visitor and return blessings. Words have performative power beyond literal meaning.",

        "culturalPrerequisites": 8,
        "explanation": "Requires understanding: 1) Tet visiting customs, 2) Highland dialectal pronunciation, 3) Host-guest reciprocity obligations, 4) Ritual speech timing/sequence. Non-Vietnamese need extensive background.",

        "idiomaticity": 9,
        "explanation": "Completely frozen ceremonial formula. Cannot substitute words or reorder. 'Phát rác nhà ôông' is fixed chunk. Compositional analysis yields wrong meaning - must be learned as unit.",

        "contextDependence": 9,
        "explanation": "Meaningless outside Tet house-visiting context. Same words in different setting lose ritual force. Timing crucial - must be first words upon entering threshold, not before or after.",

        "pedagogicalChallenge": 8,
        "explanation": "Hard to teach non-natives: 1) Dialectal pronunciation unintuitive, 2) Ritual context unfamiliar, 3) Social obligations implicit, 4) Timing/delivery critical. Requires cultural immersion to use appropriately."
      },

      "semanticNetwork": {
        "sourceDomain": "RITUAL_SPEECH",
        "targetDomain": "SOCIAL_BONDING",
        "mappings": [
          {"source": "speaking greeting formula", "target": "activating community reciprocity network"},
          {"source": "dialectal pronunciation", "target": "asserting ethnic minority identity"},
          {"source": "ceremonial opening", "target": "marking transition to sacred Tet time"},
          {"source": "visitor's first words", "target": "requesting permission to enter social space"}
        ],
        "conceptualMetaphor": "RITUAL SPEECH IS SOCIAL GLUE"
      },

      "usagePatterns": {
        "phrasePosition": "phrase_1_opening",
        "explanation": "Always phrase-initial. Cannot appear mid-song. Marks beginning of entire Tet greeting sequence.",

        "syntacticRole": "vocative_formula",
        "explanation": "Functions as performative speech act, not predicate. Creates social reality through utterance.",

        "discourseFunction": "ritual_opening",
        "explanation": "Establishes ceremonial frame for entire song. Without this, subsequent blessings lack ritual efficacy.",

        "participationPattern": "solo_to_household",
        "explanation": "Singer addresses gathered household. Response expected: invitation to enter and sit. Call-response structure across physical threshold.",

        "emotionalValence": "formal_warm",
        "explanation": "Balances formality (ritual correctness) with warmth (genuine goodwill). Conveys respect while building intimacy."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [1],
        "totalPhrases": 15,
        "coverage": "6.7%",
        "positionDistribution": {"beginning": 1, "middle": 0, "ending": 0}
      },

      "comparativeContext": {
        "uniquenessScore": 8,
        "explanation": "Rare in standard Vietnamese folk songs. Appears primarily in northern highland minority Tet songs. Dialectal form distinguishes from mainstream 'phát lộc' variants.",

        "similarExpressions": [
          {
            "expression": "phát lộc (standard Vietnamese Tet songs)",
            "similarity": "high",
            "difference": "phát lộc = standard pronunciation, phát rác = dialectal. Lộc (luck) vs rác (dialectal equivalent). Same ritual function, different phonology."
          },
          {
            "expression": "chúc mừng năm mới (modern Vietnamese)",
            "similarity": "medium",
            "difference": "chúc mừng = generic well-wishing, phát rác = ritual formula. Modern vs traditional. Urban vs rural."
          }
        ],
        "regionalDistribution": "Northern highlands (Cao Bằng, Lạng Sơn, Bắc Kạn) - Tày-Nùng ethnic minority areas",
        "genreDistribution": "Tet visiting songs, ceremonial folk music, highland minority repertoire",
        "historicalPersistence": "Pre-colonial origins, survived through French colonial period, currently endangered due to urbanization"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce with highland dialect: 'Phát' (mid-level tone, slightly aspirated), 'rác' (not standard 'lộc')",
          "Deliver with confident formality - you are enacting ritual role, not casual speech",
          "Slight bow or hand gesture (chest level, palms together) while singing first syllable",
          "Pause 1-2 beats after 'ôông' to allow host to acknowledge greeting before continuing",
          "Volume slightly elevated on 'Phát' to mark ceremonial opening, then soften for 'rác nhà ôông'"
        ],

        "culturalSensitivity": [
          "This is living ceremonial practice for Tày-Nùng communities, not museum artifact",
          "Performers outside these communities should acknowledge source and context explicitly",
          "Avoid caricaturing highland dialect pronunciation - treat with same respect as any language variety",
          "If performing for Tet, research whether your audience expects traditional response protocol",
          "Some elders may expect you to wait for invitation to continue - be prepared to pause"
        ],

        "pedagogicalApproach": [
          "Step 1: Watch video of authentic Tet visiting ceremony (YouTube: 'Tết Tày-Nùng', 'hát phát lộc')",
          "Step 2: Learn standard 'phát lộc' version first, then shift to dialectal 'phát rác' pronunciation",
          "Step 3: Practice full opening sequence: threshold pause → greeting → bow → wait for response",
          "Step 4: Study Tet reciprocity customs (why hosts must welcome singers, what happens next)",
          "Step 5: Role-play with partner: one sings greeting, other responds as host, continue dialogue"
        ],

        "commonMisinterpretations": [
          "Phrase 'Phát rác nhà ôông' is NOT 'Please give me lucky money' (that comes later). It is 'I greet your honored household'.",
          "'Rác' is NOT garbage/trash (different tone). It is dialectal pronunciation of auspicious greeting.",
          "This is NOT optional introduction you can skip. Ritual efficacy of entire song depends on correct opening.",
          "Greeting is NOT directed to individual host only. 'Nhà ôông' = entire household including ancestors at altar."
        ]
      }
    },

    {
      "expression": "con con",
      "literal": "child child",
      "meaning": "Total reduplication intensifying 'many children' - blessing for numerous descendants",
      "type": "total_reduplication",

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Ancient fertility blessing rooted in pre-Buddhist animist traditions. 'Con' repetition invokes multiplication magic - saying twice makes it manifest. Found in Kinh Thi (Classic of Poetry, 1000 BCE Chinese influence) and indigenous Vietnamese oral traditions.",

        "regionalSpecificity": 5,
        "explanation": "Nationwide Vietnamese usage, but particularly emphasized in agricultural communities where children = labor force. Regional variation in delivery (northern: rapid repetition, southern: slower, more melodic).",

        "symbolicLoad": 9,
        "explanation": "Multi-symbolic: 1) Biological fertility, 2) Family lineage continuity, 3) Ancestral worship chain (need descendants for offerings), 4) Agricultural labor prosperity, 5) Social security in old age. Core Vietnamese value system.",

        "ritualSignificance": 8,
        "explanation": "Central blessing in wedding songs, Tet songs, new house blessings. Often paired with fruit tree metaphors (pear branches = family tree). Essential for rituals marking household establishment.",

        "transmissionImportance": 7,
        "explanation": "Important for maintaining traditional family values, though facing pressure from modern one-child urban norms. Elders teach as counterbalance to contemporary demographic shifts.",

        "emotionalResonance": 8,
        "explanation": "Deeply moving for married couples longing for children, elders hoping for grandchildren. Evokes joy, hope, continuity. Can also trigger sadness for childless couples - performed with sensitivity."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "1) Literal: many children, 2) Economic: prosperity through labor, 3) Religious: ancestral worship continuity, 4) Magical: performative multiplication through repetition.",

        "crossDomainMapping": 7,
        "explanation": "NATURAL ABUNDANCE (pear branches) → FAMILY FERTILITY. Fruit trees with many fruits = household with many children. Biological reproduction metaphor spans plant-human domains.",

        "culturalPrerequisites": 7,
        "explanation": "Requires understanding: 1) Vietnamese family structure (patrilineal descent), 2) Ancestral worship necessity, 3) Agricultural economy valuing children, 4) Reduplication as intensification mechanism.",

        "idiomaticity": 6,
        "explanation": "Semi-fixed expression. 'Con con' always means 'many children' in blessing context, but can be varied (con cháu - children grandchildren). Less frozen than pure idiom.",

        "contextDependence": 6,
        "explanation": "Meaning clear from context (Tet blessing song, pear tree metaphor). But could be ambiguous without context - might mean 'child child' literally. Context crucial.",

        "pedagogicalChallenge": 6,
        "explanation": "Moderate difficulty: 1) Reduplication concept exists cross-linguistically, 2) Fertility blessing universal, 3) But agricultural-family economics may be foreign to urbanites. Cultural values need explanation."
      },

      "semanticNetwork": {
        "sourceDomain": "PLANT_REPRODUCTION",
        "targetDomain": "HUMAN_FERTILITY",
        "mappings": [
          {"source": "pear tree branches (lê muêch cành)", "target": "family lineage branches"},
          {"source": "many fruits on branches", "target": "many children in household"},
          {"source": "counting fruits (ti pán)", "target": "blessing enumeration (innumerable offspring)"},
          {"source": "seasonal fruit abundance", "target": "generational continuity"}
        ],
        "conceptualMetaphor": "FAMILY IS A FRUIT TREE"
      },

      "usagePatterns": {
        "phrasePosition": "phrase_8_middle",
        "explanation": "Appears in middle section during enumeration of household assets (fruit trees → children blessing). Strategic placement after material blessings, before spiritual ones.",

        "syntacticRole": "noun_intensifier",
        "explanation": "Modifies and intensifies 'cành' (branches). Functions as attributive emphasizing abundance.",

        "discourseFunction": "blessing_climax",
        "explanation": "Marks shift from material blessings (trees, rice) to human fertility blessings (children, descendants). Emotional peak of song.",

        "participationPattern": "communal_affirmation",
        "explanation": "Audience may chorus 'con con' or nod/smile knowingly. Creates shared hope for household prosperity. Host family particularly attentive to this moment.",

        "emotionalValence": "joyful_hopeful",
        "explanation": "Peak positive emotion. Conveys deepest wish for family happiness and continuity. Delivered with warmth and enthusiasm."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [8],
        "totalPhrases": 15,
        "coverage": "6.7%",
        "positionDistribution": {"beginning": 0, "middle": 1, "ending": 0}
      },

      "comparativeContext": {
        "uniquenessScore": 4,
        "explanation": "Common across Vietnamese folk song genres. Appears in wedding songs, Tet songs, lullabies. Universal Vietnamese fertility blessing formula.",

        "similarExpressions": [
          {
            "expression": "con cháu đầy nhà (children grandchildren fill house)",
            "similarity": "high",
            "difference": "con cháu = explicit multi-generation, con con = simple intensification. Con cháu more elaborate, con con more poetic/musical."
          },
          {
            "expression": "trăm con nghìn cháu (hundred children thousand grandchildren)",
            "similarity": "medium",
            "difference": "trăm nghìn = hyperbolic numbers, con con = poetic repetition. Same intent, different rhetorical strategy."
          },
          {
            "expression": "đông con (many children - standard phrase)",
            "similarity": "high",
            "difference": "đông = direct adjective, con con = reduplicative evocation. Con con more emotionally resonant, đông more prosaic."
          }
        ],
        "regionalDistribution": "Nationwide Vietnamese usage, all regions and dialects",
        "genreDistribution": "Wedding songs, Tet blessings, new house blessings, lullabies, harvest songs",
        "historicalPersistence": "Ancient to present, stable through all historical periods, currently adapting to modern family planning contexts"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Deliver 'con con' with bright, ascending pitch contour - convey multiplication and joy",
          "Slight emphasis on second 'con' to highlight reduplication pattern",
          "Broaden vowel on second 'con' for warmth: 'con cawn' (not clipped)",
          "Smile while singing - this should sound like delighted announcement, not mechanical recitation",
          "Optional: slight ritardando (slowing) on 'con con' to let blessing sink in before continuing"
        ],

        "culturalSensitivity": [
          "Be aware this can be emotionally loaded for childless couples, infertility struggles",
          "In modern contexts, acknowledge diverse family structures - not everyone desires many children",
          "Traditional value of 'children = prosperity' may conflict with contemporary environmental/feminist concerns",
          "Some younger Vietnamese reject this as patriarchal pressure - perform with respect for multiple viewpoints",
          "When teaching, discuss how traditional values adapt to modern realities without losing cultural meaning"
        ],

        "pedagogicalApproach": [
          "Step 1: Explain Vietnamese family structure (patrilineal descent, ancestral worship necessity)",
          "Step 2: Teach reduplication as intensification mechanism (compare 'very' vs. 'very very' in English)",
          "Step 3: Connect to universal fertility blessing traditions across cultures (show commonality)",
          "Step 4: Discuss pear tree metaphor (FAMILY IS A TREE conceptual metaphor in Vietnamese thought)",
          "Step 5: Practice with gesture: hands spreading outward on 'con con' to visualize abundance"
        ],

        "commonMisinterpretations": [
          "'Con con' does NOT mean 'baby talk' or 'cute children'. It is formal fertility blessing using poetic reduplication.",
          "This is NOT pressure on specific couple to have children immediately. It is general household prosperity wish.",
          "Blessing is NOT about quantity only (just having many kids). 'Con con' implies quality too - healthy, thriving descendants.",
          "Repetition is NOT just for musicality/rhythm. Reduplication has semantic intensification function - 'very many children'."
        ]
      }
    },

    {
      "expression": "chót chim",
      "literal": "small bird",
      "meaning": "Partial reduplication creating rhythmic, onomatopoetic bird reference",
      "type": "partial_reduplication",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Traditional Vietnamese folk poetry technique dating to ca dao (folk poetry) traditions of pre-colonial era. Phonetic echoing of animal names for aesthetic effect common in oral literature (contrast with literary poetry which avoids this).",

        "regionalSpecificity": 5,
        "explanation": "Used across Vietnamese regions, but particularly characteristic of northern folk song style (compared to southern's preference for longer melismatic vowels). Reflects northern tonal music aesthetics.",

        "symbolicLoad": 7,
        "explanation": "Birds in garden = auspicious omen. Specifically small birds (chim chích - sparrow family) represent liveliness, fertility, abundance. Eating fruit = household prosperity attracts life. Part of cosmic harmony symbolism.",

        "ritualSignificance": 5,
        "explanation": "Not essential to ritual, but contributes to auspicious atmosphere. Natural omens (birds, weather) often invoked in Tet songs to reinforce blessings. Secondary ritual element.",

        "transmissionImportance": 6,
        "explanation": "Important for preserving traditional nature imagery system in Vietnamese folk art. Teaches younger generation to observe and value wildlife as prosperity indicators.",

        "emotionalResonance": 6,
        "explanation": "Evokes playful delight, pastoral charm, harmony with nature. Lighter emotional tone than heavy fertility blessings - provides rhythmic variety and sensory imagery."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "1) Literal: small birds, 2) Symbolic: prosperity attracts life, 3) Aesthetic: sound beauty through reduplication. Multiple functions simultaneously.",

        "crossDomainMapping": 5,
        "explanation": "WILDLIFE BEHAVIOR → HOUSEHOLD PROSPERITY. Active birds = thriving environment. Simple concrete metaphor, but culturally specific (Vietnamese birds-as-omens tradition).",

        "culturalPrerequisites": 5,
        "explanation": "Requires understanding: 1) Vietnamese folk poetry reduplication conventions, 2) Birds as auspicious symbols, 3) Nature observation as prosperity indicator. Moderate cultural load.",

        "idiomaticity": 4,
        "explanation": "Semi-fixed phrase. 'Chót chim' is conventional poetic collocation, but compositional enough that meaning is derivable. Reduplication pattern is productive (could create similar phrases).",

        "contextDependence": 4,
        "explanation": "Context helps (Tet blessing song, garden imagery), but 'chót chim' is fairly transparent even without context. Partial reduplication signals poetic register, but meaning accessible.",

        "pedagogicalChallenge": 4,
        "explanation": "Moderate challenge: 1) Reduplication concept may be unfamiliar, 2) But bird symbolism fairly universal, 3) Sound pattern aesthetics can be appreciated cross-culturally. Teaching musical delivery is key."
      },

      "semanticNetwork": {
        "sourceDomain": "WILDLIFE_ACTIVITY",
        "targetDomain": "HOUSEHOLD_VITALITY",
        "mappings": [
          {"source": "small birds present", "target": "household attracts life force"},
          {"source": "birds eating fruit", "target": "abundance so great even wildlife shares"},
          {"source": "birds climbing trees", "target": "upward mobility, rising prosperity"},
          {"source": "skillful bird behavior", "target": "cleverness, good fortune"}
        ],
        "conceptualMetaphor": "PROSPERITY ATTRACTS LIFE"
      },

      "usagePatterns": {
        "phrasePosition": "phrases_6_7_middle",
        "explanation": "Appears in middle section during nature imagery sequence (after human-made assets, before returning to food/celebration). Creates sensory interlude.",

        "syntacticRole": "subject_noun_phrase",
        "explanation": "'Chót chim' serves as subject of clauses about eating and climbing. Reduplication adds poetic register while maintaining grammatical function.",

        "discourseFunction": "vivid_imagery",
        "explanation": "Shifts from abstract blessings to concrete sensory scene. Provides visual/auditory imagery, engages audience's senses, creates imaginative experience.",

        "participationPattern": "observational_delight",
        "explanation": "Audience visualizes the scene, shares in noticing the birds. Creates moment of collective appreciation for natural beauty amid blessings.",

        "emotionalValence": "playful_delighted",
        "explanation": "Lighter, more whimsical tone than solemn blessings. Adds variety to emotional arc, prevents monotony, refreshes attention."
      },

      "statistics": {
        "occurrences": 2,
        "phraseIds": [6, 7],
        "totalPhrases": 15,
        "coverage": "13.3%",
        "positionDistribution": {"beginning": 0, "middle": 2, "ending": 0}
      },

      "comparativeContext": {
        "uniquenessScore": 5,
        "explanation": "Moderately common partial reduplication pattern. 'Chót chim' appears in some folk songs, but many other bird+reduplication combinations exist. Conventional but not ubiquitous.",

        "similarExpressions": [
          {
            "expression": "chim chích (sparrow - standard name)",
            "similarity": "high",
            "difference": "chim chích = full bird name (partial reduplication built into name), chót chim = size modifier + bird. Both use 'ch-' sound repetition."
          },
          {
            "expression": "chim chiền chiện (birds chirping - total reduplication)",
            "similarity": "medium",
            "difference": "chiền chiện = sound mimicry (onomatopoeia), chót chim = descriptive noun phrase. Different reduplication types, both evoke birds."
          },
          {
            "expression": "én nhỏ (small swallow - no reduplication)",
            "similarity": "low",
            "difference": "én nhỏ = plain descriptive, chót chim = poetic reduplication. Same referent, different registers."
          }
        ],
        "regionalDistribution": "Northern Vietnam folk song traditions, some central dialects",
        "genreDistribution": "Nature imagery songs, pastoral work songs, Tet blessing songs, children's songs",
        "historicalPersistence": "Medieval to present in folk poetry, stable pattern, productive reduplication type"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Articulate 'ch' consonant crisply on both syllables - mimic percussive bird chirps",
          "Pitch contour: 'chót' (high), 'chim' (mid-low) - descending pattern suggests small bird hopping down",
          "Keep tempo lively, light - match bird energy, not heavy solemnity",
          "Optional: slight head tilt or hand gesture suggesting bird movement while singing",
          "When repeated in phrase 7, vary slightly (dynamics, ornament) to avoid mechanical repetition"
        ],

        "culturalSensitivity": [
          "This reflects traditional agrarian worldview - nature observation integral to daily life",
          "Modern urban Vietnamese may have less familiarity with bird species, behavior patterns",
          "Small birds in Vietnam (chích, sẻ sparrows) are common, not exotic - avoid romanticizing as rare/distant",
          "Wildlife imagery connects to environmental awareness - can be bridge to conservation discussion",
          "Northern dialect speakers may hear this differently than southern - be aware of regional phonological variation"
        ],

        "pedagogicalApproach": [
          "Step 1: Show images/videos of Vietnamese sparrows (chim chích) in gardens, fruit trees",
          "Step 2: Explain partial reduplication pattern in Vietnamese: consonant echo for sound beauty",
          "Step 3: Compare to onomatopoeia in other languages (tweet-tweet, chirp-chirp) - universal pattern",
          "Step 4: Practice pronunciation: initial 'ch' (voiceless palatal affricate), rhotic vs. non-rhotic 'r'",
          "Step 5: Discuss birds-as-omens tradition cross-culturally (augury, feng shui, etc.) for context"
        ],

        "commonMisinterpretations": [
          "'Chót chim' is NOT baby talk or cutesy language. It is legitimate folk poetry reduplication technique.",
          "Reduplication does NOT necessarily mean intensification here (not 'very small bird'). It is aesthetic/rhythmic.",
          "Birds are NOT metaphor for people/children (unlike some traditions). They are literal birds indicating prosperity.",
          "'Eating and climbing' is NOT random bird behavior. Shows fruit abundance (enough to share) and vitality (active movement)."
        ]
      }
    },

    {
      "expression": "khướng rướng",
      "literal": "fields orchards",
      "meaning": "Rhyming reduplication combining agricultural land types for euphonic effect",
      "type": "rhyming_reduplication",

      "culturalWeights": {
        "historicalDepth": 7,
        "explanation": "Reflects ancient Vietnamese agricultural society's land classification system. 'Khướng' (rice fields) and 'rướng' (orchards/gardens) represent two primary wealth categories in pre-industrial Vietnam. Rhyming binomial dating to feudal land organization.",

        "regionalSpecificity": 6,
        "explanation": "Northern and central Vietnamese agricultural terminology. Southern Vietnam uses different terms (đồng ruộng, vườn). Regional dialectal pronunciation affects rhyme quality.",

        "symbolicLoad": 8,
        "explanation": "Symbolizes complete agricultural prosperity - both staple crops (rice in khướng) and commercial crops (fruit in rướng). Encompasses subsistence + wealth accumulation. Represents total household economic security.",

        "ritualSignificance": 6,
        "explanation": "Formulaic blessing for land abundance. Often appears in new year songs, harvest festivals, land blessing ceremonies. Not required ritual element, but conventional in prosperity blessings.",

        "transmissionImportance": 7,
        "explanation": "Important for preserving agricultural vocabulary as Vietnam urbanizes. Younger generations may not distinguish field types - this phrase teaches traditional land use categories and their cultural significance.",

        "emotionalResonance": 7,
        "explanation": "Evokes agrarian nostalgia, connection to land, traditional prosperity values. For rural Vietnamese: pride in landholding. For urban diaspora: longing for village roots."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "1) Literal: rice fields and orchards, 2) Economic: complete agricultural wealth, 3) Aesthetic: pleasing sound pattern through rhyme. Form and content integrated.",

        "crossDomainMapping": 4,
        "explanation": "Relatively concrete. LAND TYPES → WEALTH is straightforward metonymy. Limited abstraction - land directly produces wealth. Low metaphorical complexity.",

        "culturalPrerequisites": 7,
        "explanation": "Requires understanding: 1) Vietnamese agricultural land categories, 2) Economic significance of each type, 3) Rhyming binomial construction in Vietnamese, 4) Traditional agrarian economy. Specialized knowledge.",

        "idiomaticity": 7,
        "explanation": "Semi-fixed expression. 'Khướng rướng' is conventional collocation, though compositional. Rhyme pattern makes it more frozen than non-rhyming equivalents. Often learned as chunk.",

        "contextDependence": 5,
        "explanation": "Meaning fairly clear from morphemes (field words), but full cultural weight requires context (Tet blessing, prosperity emphasis). Literal meaning accessible, connotations require background.",

        "pedagogicalChallenge": 6,
        "explanation": "Moderate difficulty: 1) Agricultural terms unfamiliar to urban/non-Vietnamese, 2) Rhyming pattern needs explanation, 3) But concrete referents easier than abstract concepts. Visual aids help."
      },

      "semanticNetwork": {
        "sourceDomain": "AGRICULTURAL_LAND",
        "targetDomain": "WEALTH_SECURITY",
        "mappings": [
          {"source": "rice fields (khướng)", "target": "subsistence security (food)"},
          {"source": "orchards (rướng)", "target": "commercial wealth (cash crops)"},
          {"source": "expansive land holdings", "target": "social status, power"},
          {"source": "diverse land types", "target": "economic resilience"}
        ],
        "conceptualMetaphor": "LAND IS WEALTH"
      },

      "usagePatterns": {
        "phrasePosition": "phrase_3_middle",
        "explanation": "Appears during enumeration of household assets. Strategic placement early in song to establish prosperity baseline before specific blessings.",

        "syntacticRole": "object_noun_phrase",
        "explanation": "Object of verb 'ngó' (see/observe). 'Khướng rướng' receives action of seeing/appreciating. Reduplication adds poetic flavor while maintaining grammatical function.",

        "discourseFunction": "wealth_inventory",
        "explanation": "Part of systematic listing of household resources. Establishes material foundation for subsequent spiritual blessings. Creates credibility - observable prosperity.",

        "participationPattern": "admiring_witness",
        "explanation": "Audience joins singer in mentally surveying the household's lands. Creates shared appreciation, affirms host's status. Visual imagination engaged.",

        "emotionalValence": "admiring_respectful",
        "explanation": "Conveys impressed recognition of host's achievements. Respectful acknowledgment of hard work and prosperity. Positive but not ecstatic - measured appreciation."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [3],
        "totalPhrases": 15,
        "coverage": "6.7%",
        "positionDistribution": {"beginning": 0, "middle": 1, "ending": 0}
      },

      "comparativeContext": {
        "uniquenessScore": 6,
        "explanation": "Moderately unique. Rhyming binomials common in Vietnamese, but this specific combination is conventional in agricultural contexts. Not fully frozen idiom, but recognized collocation.",

        "similarExpressions": [
          {
            "expression": "ruộng vườn (fields gardens - standard phrase)",
            "similarity": "high",
            "difference": "ruộng vườn = standard prose term, khướng rướng = poetic variant with better rhyme. Same referent, different registers."
          },
          {
            "expression": "đồng ruộng (rice paddies - southern Vietnam)",
            "similarity": "medium",
            "difference": "đồng ruộng = only rice fields, khướng rướng = fields + orchards. Regional variation, khướng rướng more comprehensive."
          },
          {
            "expression": "làng mạc ruộng vườn (villages hamlets fields gardens)",
            "similarity": "medium",
            "difference": "làng mạc ruộng vườn = fuller enumeration (4 terms), khướng rướng = concise (2 terms). Both use rhyming pattern, different scope."
          }
        ],
        "regionalDistribution": "Northern and central Vietnam agricultural communities, some highland minority areas",
        "genreDistribution": "Harvest songs, Tet blessings, work songs, land blessing ceremonies",
        "historicalPersistence": "Feudal period to present, declining as Vietnam urbanizes, rural youth may be less familiar"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Emphasize rhyme: 'khướNG' (velar nasal) and 'rướNG' (matching final) - let rhyme ring out",
          "Slight rallentando (slowing) through 'khướng rướng' to savor the rhyme, then recover tempo",
          "Pitch contour: parallel melodic shape on both words to highlight phonological similarity",
          "Volume: slightly louder on 'rướng' to complete the pair with emphasis",
          "Articulation: crisp initial 'kh' (voiceless velar fricative) and 'r' (flap or trill, depending on dialect)"
        ],

        "culturalSensitivity": [
          "Landholding historically correlated with class status - avoid romanticizing feudal inequalities",
          "Land reform and collectivization (1950s-1980s) are sensitive topics - be aware of political history",
          "Current land tenure disputes (state vs. private ownership) make land imagery politically loaded",
          "Urban Vietnamese may have no direct agricultural experience - avoid assuming shared knowledge",
          "For diaspora communities, land loss (boat people exodus, etc.) can be painful memory - perform sensitively"
        ],

        "pedagogicalApproach": [
          "Step 1: Show visual diagram of Vietnamese agricultural land types (wet rice fields, dry gardens, orchards)",
          "Step 2: Explain economic function: khướng (subsistence), rướng (cash income) - parallel to Western 'livestock and crops'",
          "Step 3: Teach rhyming binomial construction in Vietnamese (common pattern: A-B where A and B rhyme)",
          "Step 4: Practice pronunciation focusing on final nasal /ŋ/ - critical for rhyme perception",
          "Step 5: Discuss land as wealth cross-culturally (European estates, American homesteading, etc.) for comparison"
        ],

        "commonMisinterpretations": [
          "'Khướng rướng' is NOT generic 'countryside' or 'farm'. It specifically means two distinct land categories.",
          "Rhyme is NOT just decorative. It signals this is formulaic blessing language, not casual speech.",
          "Phrase does NOT necessarily mean 'vast lands'. It emphasizes diversity (both types), not just quantity.",
          "This is NOT nostalgia for 'simple farm life'. It represents wealth, status, economic security - complex agrarian society."
        ]
      }
    },

    {
      "expression": "lố lố",
      "literal": "flying high (repeated)",
      "meaning": "Total reduplication intensifying upward motion - stork flying high with baby",
      "type": "total_reduplication",

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Stork-brings-baby motif ancient across Asia. Vietnamese 'cò' (stork/crane) in folklore delivers children, guards rice fields, represents longevity. Reduplication of flight intensifies auspiciousness - higher flight = greater blessing delivered.",

        "regionalSpecificity": 6,
        "explanation": "Stork imagery widespread in Vietnamese folk culture, but specific reduplication pattern may be northern/central. Southern Vietnam has variations. Highland minorities have distinct bird symbolism.",

        "symbolicLoad": 9,
        "explanation": "Multi-layered: 1) Fertility blessing (stork brings children), 2) Aspiration (upward flight), 3) Divine communication (earth-sky axis), 4) Transcendence (rising above mundane), 5) Tet renewal (new life arriving). Peak symbolic density.",

        "ritualSignificance": 7,
        "explanation": "Important in fertility blessings, wedding songs, new year wishes. Stork flight represents blessing in motion - not static wish but active delivery. Visual imagery for ritual efficacy.",

        "transmissionImportance": 7,
        "explanation": "Key for preserving traditional fertility symbolism, though competing with modern biomedical understanding of reproduction. Elders use to maintain cultural frameworks for discussing family expansion.",

        "emotionalResonance": 8,
        "explanation": "Evokes joy, hope, anticipation of new life. Powerful for couples desiring children, families awaiting grandchildren. Upward motion creates emotional lift. Can be bittersweet for those struggling with fertility."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "1) Literal: bird flying high, 2) Metaphorical: delivering blessing from above, 3) Performative: enacting arrival of fertility, 4) Kinesthetic: upward motion = positive trajectory.",

        "crossDomainMapping": 8,
        "explanation": "Complex mapping: VERTICAL MOTION (flying) → SPIRITUAL STATE (blessing), BIRD BEHAVIOR (carrying baby) → COSMIC PROCESS (fertility delivery). Abstracts natural event into metaphysical action.",

        "culturalPrerequisites": 8,
        "explanation": "Requires understanding: 1) Stork-brings-baby folklore (Asian variant of Western stork myth), 2) Vietnamese fertility blessing conventions, 3) Vertical axis cosmology (sky=divine), 4) Reduplication as intensification.",

        "idiomaticity": 7,
        "explanation": "Semi-frozen expression in fertility blessing context. 'Lố lố' always intensifies upward motion, but exact meaning depends on context (here: stork flight). Conventional but productive.",

        "contextDependence": 7,
        "explanation": "Context crucial. 'Lố lố' alone ambiguous - could be any high motion. Requires prior 'cò con khăng' (stork carrying baby) to establish fertility blessing frame. Sequential context essential.",

        "pedagogicalChallenge": 7,
        "explanation": "Challenging to teach: 1) Stork myth may seem childish to moderns, 2) Fertility blessing norms vary across cultures, 3) Reduplication + symbolism + folklore = multiple layers, 4) Musical delivery critical to emotional impact."
      },

      "semanticNetwork": {
        "sourceDomain": "BIRD_FLIGHT",
        "targetDomain": "BLESSING_DELIVERY",
        "mappings": [
          {"source": "stork ascending", "target": "blessing rising from earth to be granted"},
          {"source": "carrying baby upward", "target": "elevating new life into existence"},
          {"source": "high altitude flight", "target": "divine intervention (heaven realm)"},
          {"source": "sustained upward motion (lố lố)", "target": "continuous blessing (many children over time)"}
        ],
        "conceptualMetaphor": "FERTILITY IS UPWARD MOTION"
      },

      "usagePatterns": {
        "phrasePosition": "phrase_11_middle",
        "explanation": "Appears during fertility blessing section (after material blessings). Climactic moment in fertility sequence - stork in flight is blessing in action.",

        "syntacticRole": "manner_adverbial",
        "explanation": "Modifies 'khăng' (carrying). Describes how stork carries - 'lố lố' (flying high). Reduplication adds dramatic emphasis to manner.",

        "discourseFunction": "blessing_visualization",
        "explanation": "Creates vivid mental image of blessing arrival. Audience visualizes stork ascending, baby safe in its care. Makes abstract fertility blessing concrete and dramatic.",

        "participationPattern": "visualizing_together",
        "explanation": "Audience collectively imagines the scene. May look upward, gesture skyward. Shared visualization creates communal hope, binding participants in common aspiration.",

        "emotionalValence": "exuberant_hopeful",
        "explanation": "Peak emotional moment in fertility blessing. Exuberant upward energy, unrestrained hope. Delivered with maximum enthusiasm and dramatic flair."
      },

      "statistics": {
        "occurrences": 2,
        "phraseIds": [11, 12],
        "totalPhrases": 15,
        "coverage": "13.3%",
        "positionDistribution": {"beginning": 0, "middle": 2, "ending": 0}
      },

      "comparativeContext": {
        "uniquenessScore": 7,
        "explanation": "Fairly unique. While 'lố' (high flight) appears in folk songs, 'lố lố' reduplication specifically in stork-baby context is distinctive. Not universal across Vietnamese songs.",

        "similarExpressions": [
          {
            "expression": "bay lên cao (fly up high - standard phrase)",
            "similarity": "medium",
            "difference": "bay lên cao = descriptive prose, lố lố = evocative reduplication. Same motion, different registers. Lố lố more poetic/ritualistic."
          },
          {
            "expression": "vút cao (soar high)",
            "similarity": "medium",
            "difference": "vút = single sharp upward motion, lố lố = sustained/repeated upward motion. Lố lố suggests continuous blessing delivery."
          },
          {
            "expression": "lẻn lút (sneaking around - different 'l-' reduplication)",
            "similarity": "low",
            "difference": "Shows contrast: lẻn lút = low/hidden motion, lố lố = high/visible motion. Same reduplication pattern, opposite meanings based on base word."
          }
        ],
        "regionalDistribution": "Northern and central Vietnam folk traditions, some overlap in southern variants",
        "genreDistribution": "Fertility blessings, wedding songs, Tet songs, children's songs about storks",
        "historicalPersistence": "Ancient folklore motif, stable through all periods, currently adapting to modern reproductive understanding"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Deliver 'lố lố' with ascending pitch contour - voice follows bird upward",
          "Volume crescendo through the phrase - increasing as stork rises higher",
          "Articulate both syllables clearly but with flow - sustained motion, not two discrete jumps",
          "Optional: hand gesture rising during 'lố lố' to embody upward flight",
          "In phrase 12 variant 'lố lế', slight variation in vowel creates graceful variation - not mechanical repetition"
        ],

        "culturalSensitivity": [
          "Stork-brings-baby folklore is cross-cultural (European, Asian variants) - show connections and differences",
          "Modern audiences may view this as quaint/childish - frame as traditional poetic symbolism, not literal belief",
          "Fertility imagery can be sensitive for those with reproductive challenges - perform with compassion",
          "Some may critique as reinforcing pronatalist pressure - acknowledge critique while respecting traditional values",
          "For diaspora, stork imagery may evoke homeland nostalgia - honor emotional weight"
        ],

        "pedagogicalApproach": [
          "Step 1: Show images of Vietnamese white storks (cò trắng) in rice fields, wetlands - ground in natural observation",
          "Step 2: Explain stork-brings-baby folklore across cultures (European stork, Chinese crane, etc.) - universal pattern",
          "Step 3: Teach reduplication of motion words in Vietnamese: intensification + continuous aspect",
          "Step 4: Practice vocal gesture: 'lố' (mid-high pitch) → 'lố' (higher pitch) with crescendo",
          "Step 5: Discuss fertility blessing traditions cross-culturally (baby showers, wedding toasts, etc.) - contextualize"
        ],

        "commonMisinterpretations": [
          "'Lố lố' is NOT just 'flying' (that would be 'bay'). It specifically means 'flying high/upward with emphasis'.",
          "Stork is NOT delivering random baby. Context shows it's bringing baby TO THIS HOUSEHOLD - specific blessing.",
          "Upward motion is NOT escape/departure. It represents elevation, aspiration, divine connection - positive trajectory.",
          "'Lố lế' variation in phrase 12 is NOT error. It's intentional poetic variation (vowel shift for melodic beauty)."
        ]
      }
    }
  ],

  "aggregateStatistics": {
    "totalExpressions": 5,
    "uniqueExpressions": 5,
    "totalOccurrences": 8,
    "phrasesCovered": 9,
    "phraseCoverage": "60.0%",
    "averageCulturalWeight": 7.52,
    "averageComplexity": 5.9,
    "dominantMechanism": "reduplication_and_ritual_formulas",
    "culturalRichness": "very_high",

    "explanation": "Hát chúc tết demonstrates very high cultural richness with sophisticated use of ritual formulas, fertility symbolism, and agricultural imagery. The 7.52 average cultural weight reflects deep historical roots (ceremonial Tet traditions, ancient fertility folklore) and significant ritual importance. Reduplication patterns (3 of 5 expressions) show characteristic Vietnamese poetic technique. Moderate complexity (5.9 average) indicates expressions are culturally loaded but linguistically accessible - poetic but not opaque. Coverage of 60% means figurative language thoroughly saturates the song, creating dense symbolic texture throughout."
  },

  "collectionContext": {
    "genreClassification": "Tet blessing song / New Year visiting song (Hát phát lộc tradition)",

    "culturalSignificance": "This song preserves northern highland minority (Tày-Nùng) Tet visiting customs. The 'phát rác' dialectal pronunciation marks ethnic minority identity. Ritual greeting + prosperity enumeration + fertility blessing = classic tripartite Tet song structure. Represents endangered oral tradition as Vietnam urbanizes and young people shift to modern New Year celebrations. Important documentation of agricultural prosperity values (fields, orchards, fruit trees) and traditional family structures (emphasis on many children, ancestral continuity).",

    "linguisticProfile": "Northern Vietnamese dialect with highland minority phonological features. Notable: 'ôông' (elder sir) dialectal pronunciation, 'phát rác' instead of standard 'phát lộc', vocabulary items like 'khướng rướng' (northern agricultural terms). Heavy use of reduplication (17 instances in tier1 data) characteristic of Vietnamese folk poetry. Tonal patterns create musical scaffolding for melody.",

    "performanceContext": "Performed during Lunar New Year house visits. Singer arrives at threshold, delivers 'phát rác' greeting, waits for host invitation, then enters and performs full blessing song while household listens. Host traditionally offers food, drink, and lucky money (lì xì) in exchange for blessings. Call-response dynamic with household participation (affirmations, echoing key phrases). Ritual efficacy believed to bring prosperity for coming year. Modern contexts: cultural festivals, school performances, heritage preservation events.",

    "pedagogicalValue": "Excellent for teaching: 1) Vietnamese reduplication types (total, partial, rhyming), 2) Ritual speech vs. casual speech registers, 3) Agricultural vocabulary and traditional economy, 4) Fertility symbolism cross-culturally, 5) Tet customs and calendar, 6) Highland minority linguistic diversity, 7) Nature imagery systems (birds, trees, fruit as symbols), 8) Host-guest reciprocity in Vietnamese culture. Intermediate level - requires cultural background but linguistically accessible."
  }
}
