{
  "metadata": {
    "songTitle": "Cậu khóa ơi!",
    "totalSyllables": 27,
    "totalPhrases": 5,
    "enhancementVersion": "3.0",
    "enhancedBy": "Claude LLM",
    "enhancementDate": "2025-10-05",
    "sourceFile": "lyrics-enhanced-tier1/Cậu khóa ơi!.json"
  },

  "figurativeExpressions": [
    {
      "expression": "Cậu Khóa ơi",
      "literal": "You Khóa oh",
      "meaning": "Vocative formula calling to a person named Khóa with intimate address and emotional particle",
      "vietnameseCategory": "Công thức kêu gọi (Calling formula)",
      "semanticMechanism": "vocative_formula",
      "phraseIds": [1],

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Vocative calling formulas with 'ơi' particle documented in Vietnamese folk poetry for centuries, pre-colonial origins in ca dao (folk song) traditions. Common in 18th-19th century rural courtship and work songs.",

        "regionalSpecificity": 4,
        "explanation": "Found across all Vietnamese regions (North, Central, South) with slight variations in pronunciation and emotional intensity. Southern variants often elongate 'ơi' for musical effect. Not region-specific but regionally inflected.",

        "symbolicLoad": 6,
        "explanation": "The vocative 'ơi' symbolizes emotional distance being bridged through calling. Creates intimacy even in separation. Khóa (lock/key) as name may carry symbolic weight (unlocking hearts, being locked in affection), though primarily a personal name.",

        "ritualSignificance": 3,
        "explanation": "Not essential to specific rituals, but calling formulas like this are conventional in farewell ceremonies, especially at river crossings and boat departures. Mild ritual function in departure contexts.",

        "transmissionImportance": 7,
        "explanation": "Teaching vocative formulas is important for Vietnamese language learners to understand social deixis and emotional register. Essential for folk song performance. Helps preserve intimate, affective communication styles.",

        "emotionalResonance": 8,
        "explanation": "Highly emotionally resonant - 'ơi' particle conveys longing, yearning, calling across distance (physical or emotional). Evokes separation anxiety, intimate attachment. Audiences immediately recognize emotional urgency."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "1) Literal calling (address function), 2) Emotional expression (longing, urgency), 3) Relationship marking (intimacy, informal hierarchy). Not highly multi-layered but more than purely literal.",

        "crossDomainMapping": 5,
        "explanation": "SOUND (calling) → EMOTIONAL CONNECTION (bridging distance). VOCATIVE PARTICLE → AFFECTIVE STATE. Moderate metaphorical complexity - the act of calling stands for emotional bond and desire for presence.",

        "culturalPrerequisites": 6,
        "explanation": "Requires understanding of Vietnamese pronoun system (cậu = younger male, informal), vocative particles (ơi), and cultural norms around addressing others by name + title. Moderate cultural knowledge needed.",

        "idiomaticity": 7,
        "explanation": "Highly formulaic - the pattern '[pronoun] [name] ơi' is a fixed construction in Vietnamese folk songs. Cannot rearrange or substitute freely without sounding unnatural. Semi-frozen expression.",

        "contextDependence": 6,
        "explanation": "Meaning enriched by context (farewell scene, boat departure), but the calling formula itself is interpretable without full context. Knowing it's a departure intensifies emotional reading.",

        "pedagogicalChallenge": 7,
        "explanation": "Difficult for non-natives to grasp: 1) Pronoun choice (cậu vs. anh, em, etc.), 2) When to use 'ơi', 3) Emotional nuance encoded in particles, 4) Performance/vocalization (elongating 'ơi' for musical effect)."
      },

      "semanticNetwork": {
        "sourceDomain": "VOCAL_CALLING",
        "targetDomain": "EMOTIONAL_CONNECTION",
        "mappings": [
          {
            "source": "Audible calling across distance",
            "target": "Bridging emotional separation"
          },
          {
            "source": "Vocative particle 'ơi'",
            "target": "Longing and affective urgency"
          },
          {
            "source": "Informal address 'cậu'",
            "target": "Intimate, equal-status relationship"
          },
          {
            "source": "Personal name 'Khóa'",
            "target": "Unique individual bond (not generic)"
          }
        ],
        "conceptualMetaphor": "CALLING IS CONNECTING / VOICE IS EMOTIONAL BRIDGE"
      },

      "usagePatterns": {
        "phrasePosition": "beginning",
        "explanation": "Opens the song, establishing who is being addressed and the emotional register. Sets up subsequent request.",

        "syntacticRole": "vocative",
        "explanation": "Pure vocative function - not subject, object, or predicate. Stands outside main clause structure, framing the discourse.",

        "discourseFunction": "invitation_and_framing",
        "explanation": "Invites the addressee into the discourse space, establishes intimate frame for what follows (request, emotional expression).",

        "participationPattern": "solo_to_addressee",
        "explanation": "Typically sung solo by one voice calling to another. May have call-response variants in communal singing, but fundamentally a directed call.",

        "emotionalValence": "mixed_longing",
        "explanation": "Positive (affection, intimacy) mixed with negative (separation, yearning). The 'ơi' particle carries bittersweet longing."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [1],
        "totalPhrases": 5,
        "coverage": "20%",
        "positionDistribution": {
          "beginning": 1,
          "middle": 0,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 4,
        "explanation": "Calling formulas with 'ơi' are extremely common in Vietnamese folk songs. The specific name 'Khóa' is less common, but the structural pattern is widespread. Moderate uniqueness.",

        "similarExpressions": [
          {
            "expression": "Em ơi (Oh, younger beloved)",
            "similarity": "high",
            "difference": "Em ơi more romantic, cậu more informal/friendly. Both use 'ơi' particle in same structural position."
          },
          {
            "expression": "Anh ơi (Oh, older brother/beloved)",
            "similarity": "high",
            "difference": "Anh indicates higher status/age than cậu. Same vocative structure."
          },
          {
            "expression": "Ơi thơng ơi (calling with onomatopoeia)",
            "similarity": "medium",
            "difference": "Uses 'thơng' sound symbolism, more musical/abstract than naming specific person."
          }
        ],

        "regionalDistribution": "Nationwide with Southern musical features (melodic particle elongation)",
        "genreDistribution": "Love songs, farewell songs, work songs with interpersonal address",
        "historicalPersistence": "Ancient (ca dao traditions) to present, continuously documented across centuries"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Elongate the 'ơi' particle for 2-3 beats, with slight upward pitch inflection to convey yearning",
          "Pronounce 'Cậu' with falling tone (nặng) clearly - abrupt glottal stop at end",
          "Add slight breath pause after 'Khóa' before launching into 'ơi' to create anticipation",
          "Facial expression: eyes widened, looking into distance as if calling across space",
          "Hand gesture: slight reach forward or upward, as if beckoning"
        ],

        "culturalSensitivity": [
          "Respect pronoun hierarchy - 'cậu' implies informal address to someone younger or equal. Using wrong pronoun in performance = cultural error.",
          "The name 'Khóa' may reference real individual (boatman, ferryman). Treat with respect, not as abstract character.",
          "Avoid exoticizing the 'ơi' particle as 'cute' - it carries deep emotional weight for Vietnamese speakers.",
          "If performing for Vietnamese diaspora audience, this opening may trigger nostalgic memories of separation and migration."
        ],

        "pedagogicalApproach": [
          "Step 1: Teach the Vietnamese pronoun system (cậu, anh, em, etc.) and when to use each. Practice choosing appropriate pronoun for different social contexts.",
          "Step 2: Introduce 'ơi' particle - listen to 10+ examples from different folk songs. Identify emotional range (joy, sorrow, urgency, tenderness).",
          "Step 3: Practice vocalization - elongate 'ơi' while maintaining pitch, add breath control for sustained emotional effect.",
          "Step 4: Compare to other vocative formulas in Vietnamese poetry and song. Map the structural pattern: [pronoun] [name/noun] ơi.",
          "Step 5: Role-play calling scenarios - students practice calling to each other with appropriate pronouns and emotional tone."
        ],

        "commonMisinterpretations": [
          "❌ 'Ơi is just a filler word' → ✅ Ơi is emotionally loaded vocative particle conveying longing and urgency",
          "❌ 'Can use any pronoun interchangeably' → ✅ Pronoun choice (cậu) marks specific social relationship and hierarchy",
          "❌ 'Khóa means lock/key here (metaphor)' → ✅ Khóa is primarily a personal name (boatman), not symbolic",
          "❌ 'Should say this quickly, casually' → ✅ In sung context, elongate for musical and emotional effect"
        ]
      }
    },

    {
      "expression": "đến bến",
      "literal": "arrive dock",
      "meaning": "Rhyming reduplication for musical beauty, meaning 'to the dock'",
      "vietnameseCategory": "Láy ước thanh (Sound reduplication)",
      "semanticMechanism": "phonic_reduplication",
      "phraseIds": [2],

      "culturalWeights": {
        "historicalDepth": 7,
        "explanation": "Rhyming reduplication (láy) is ancient Vietnamese poetic device, documented in earliest folk poetry and ca dao. Pre-literary origins, oral tradition for 1000+ years. This specific pairing may be more recent.",

        "regionalSpecificity": 5,
        "explanation": "Rhyming patterns are nationwide Vietnamese phenomenon, but 'đến bến' common in Southern riverine folk songs due to river-based transportation culture. Moderate regional association.",

        "symbolicLoad": 4,
        "explanation": "Primarily phonetic beauty, not deep symbolism. The dock (bến) itself carries metaphorical weight (departure point, threshold), but the rhyming is for sound, not meaning.",

        "ritualSignificance": 2,
        "explanation": "No specific ritual function. Docks are sites of departure rituals (farewells), but the rhyming pattern itself has no ceremonial role.",

        "transmissionImportance": 8,
        "explanation": "Teaching rhyming reduplication is essential for Vietnamese language learners and folk song performers. Key feature of Vietnamese phonological aesthetics. Critical for understanding ca dao structure.",

        "emotionalResonance": 5,
        "explanation": "Moderate emotional resonance - the rhyming creates melodic beauty and rhythmic flow, enhancing the poignancy of the departure scene. Sound reinforces emotion."
      },

      "complexityMetrics": {
        "layersOfMeaning": 2,
        "explanation": "1) Literal meaning (to the dock), 2) Phonetic/aesthetic layer (rhyming beauty). Not highly complex - primarily functional with added sound aesthetics.",

        "crossDomainMapping": 2,
        "explanation": "Minimal metaphorical mapping. SOUND (rhyme) → BEAUTY/PLEASURE, but mostly literal directional phrase with phonic embellishment.",

        "culturalPrerequisites": 5,
        "explanation": "Requires understanding Vietnamese tonal system and how rhyming works (matching final consonants + tones). Knowledge of riverine transportation culture helpful but not essential.",

        "idiomaticity": 6,
        "explanation": "Semi-fixed - 'đến bến' is a natural collocation (common phrase), reinforced by rhyming. Could say 'đến bến tàu' without rhyme, but rhyming version preferred in songs.",

        "contextDependence": 3,
        "explanation": "Fairly context-independent - means 'to the dock' in any context. The farewell context adds emotional weight but doesn't change core meaning.",

        "pedagogicalChallenge": 6,
        "explanation": "Moderate difficulty: 1) Understanding Vietnamese rhyming principles (tone + final consonant), 2) Recognizing when rhyme is for beauty vs. semantic function, 3) Producing clear tones (đến = sắc, bến = sắc)."
      },

      "semanticNetwork": {
        "sourceDomain": "SOUND_PATTERN",
        "targetDomain": "AESTHETIC_PLEASURE",
        "mappings": [
          {
            "source": "Matching phonemes (đến/bến)",
            "target": "Auditory harmony and beauty"
          },
          {
            "source": "Rhythmic repetition",
            "target": "Musical flow and memorability"
          },
          {
            "source": "Tonal matching (sắc tone)",
            "target": "Sonic cohesion"
          }
        ],
        "conceptualMetaphor": "SOUND SYMMETRY IS BEAUTY / RHYME IS AESTHETIC PLEASURE"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears mid-phrase in phrase 2: 'Cậu đưa tôi i ra đến bến a tàu'. Embedded in directional/request sequence.",

        "syntacticRole": "directional_phrase",
        "explanation": "Functions as destination in motion verb construction ('đưa...ra đến bến' = 'take...out to the dock'). Adverbial phrase of direction.",

        "discourseFunction": "rhythmic_embellishment",
        "explanation": "Adds musicality and rhythmic flow to the request. Enhances memorability and singability of the line.",

        "participationPattern": "solo",
        "explanation": "Sung as part of solo line, not call-response. The rhyming aids in audience comprehension and engagement.",

        "emotionalValence": "neutral_with_aesthetic_pleasure",
        "explanation": "No inherent emotional charge (unlike 'ơi'), but the rhyming beauty creates pleasurable listening experience within sad context."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [2],
        "totalPhrases": 5,
        "coverage": "20%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 3,
        "explanation": "Rhyming reduplication extremely common in Vietnamese folk songs. This specific 'đến bến' pairing is common in riverine/departure songs. Low uniqueness - conventional pattern.",

        "similarExpressions": [
          {
            "expression": "trên bờ dưới bến (on shore, under dock)",
            "similarity": "high",
            "difference": "Uses 'bến' in parallel structure with 'bờ'. Both involve rhyming with dock-related vocabulary."
          },
          {
            "expression": "lên thuyền xuống bến (board boat, descend to dock)",
            "similarity": "high",
            "difference": "Different verbs but same riverine context and rhyming principle."
          },
          {
            "expression": "chiều chiều (evening by evening)",
            "similarity": "medium",
            "difference": "Total reduplication (same word repeated) vs. rhyming reduplication (different words, same sound)."
          }
        ],

        "regionalDistribution": "Nationwide, especially strong in Mekong Delta and riverine areas (Southern Vietnam)",
        "genreDistribution": "Departure songs, love songs, boating songs, work songs at docks/rivers",
        "historicalPersistence": "Ancient poetic device, continuously used from oral folk poetry to contemporary folk revival"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Emphasize the rhyme by slightly elongating the final 'n' consonant in both 'đến' and 'bến'",
          "Maintain rising tone (sắc) clearly on both syllables - start mid, rise sharply",
          "Add slight rhythmic bounce or lilt to highlight the phonetic pairing",
          "If using traditional instruments, have accompaniment echo the rhyme with percussive pattern"
        ],

        "culturalSensitivity": [
          "Rhyming reduplication is not 'primitive' or 'simple' - it's a sophisticated poetic device in Vietnamese aesthetics",
          "Recognize that Vietnamese is a tonal, monosyllabic language where rhyme works differently than in English",
          "The dock (bến) is historically significant site in Vietnamese culture - place of migration, separation, trade"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach Vietnamese rhyming principles - matching final consonants (n/n) and tones (sắc/sắc)",
          "Step 2: Listen to 5-10 examples of láy (reduplication) in folk songs. Categorize by type: total reduplication, rhyming reduplication, tonal reduplication",
          "Step 3: Practice identifying rhymes aurally - play recordings, students clap when they hear rhyming pairs",
          "Step 4: Create new rhyming phrases using Vietnamese dock/river vocabulary (sông, bờ, thuyền, etc.)",
          "Step 5: Discuss function of rhyme in oral tradition (memorability, aesthetic pleasure, rhythmic structure)"
        ],

        "commonMisinterpretations": [
          "❌ 'The rhyme has deep symbolic meaning' → ✅ Primarily phonetic beauty, not symbolic (though context may add meaning)",
          "❌ 'This is just repetition/redundancy' → ✅ Sophisticated poetic device for musical and mnemonic effect",
          "❌ 'Can rhyme any words in Vietnamese' → ✅ Must match tones AND final sounds - strict phonological rules",
          "❌ 'Rhyming is childish/simple in Vietnamese' → ✅ Ancient poetic technique, highly valued in folk and literary traditions"
        ]
      }
    },

    {
      "expression": "tay tôi",
      "literal": "hand I/my",
      "meaning": "Partial reduplication creating phonetic emphasis, meaning 'my hand'",
      "vietnameseCategory": "Láy bán phần (Partial reduplication)",
      "semanticMechanism": "phonic_reduplication",
      "phraseIds": [3, 4],

      "culturalWeights": {
        "historicalDepth": 7,
        "explanation": "Partial reduplication (láy bán phần) is ancient Vietnamese poetic device, used in ca dao and folk poetry for centuries. This specific 'tay/tôi' pattern common in emotional, introspective songs.",

        "regionalSpecificity": 4,
        "explanation": "Found across Vietnam, though more common in Central and Southern folk songs with high emotional content. Not strongly region-specific.",

        "symbolicLoad": 5,
        "explanation": "The hand (tay) symbolizes agency, action, self-control (or lack thereof). In context of wiping tears and hiding handkerchief, the repeated focus on hands shows internal conflict. Moderate symbolic weight.",

        "ritualSignificance": 1,
        "explanation": "No specific ritual function. Hands in gestures have ritual roles in some contexts, but this reduplication pattern itself is not ceremonial.",

        "transmissionImportance": 8,
        "explanation": "Teaching partial reduplication essential for Vietnamese folk song performance and language learning. Shows how Vietnamese creates emphasis through sound patterning rather than word order changes.",

        "emotionalResonance": 7,
        "explanation": "High emotional resonance - the phonetic repetition emphasizes the speaker's self-focus and internal state. Creates introspective, melancholic tone."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "1) Literal possessive (my hand), 2) Phonetic emphasis (reduplication highlights), 3) Psychological focus (repeated pattern shows preoccupation with own actions/state). Moderate layering.",

        "crossDomainMapping": 4,
        "explanation": "SOUND (repetition) → EMPHASIS/FOCUS. The reduplication maps phonetic similarity onto psychological/emotional intensity. Moderate metaphorical complexity.",

        "culturalPrerequisites": 6,
        "explanation": "Requires understanding: 1) Vietnamese reduplication types, 2) How sound patterns create emphasis without grammatical changes, 3) Cultural significance of hands in emotional expression (gestures, wiping tears).",

        "idiomaticity": 5,
        "explanation": "Semi-idiomatic - 'tay tôi' is natural phrase but not frozen. Could say 'bàn tay tôi' (my hand) without reduplication, but folk songs prefer phonetically pleasing patterns.",

        "contextDependence": 7,
        "explanation": "Heavily context-dependent - the repetition of 'tay tôi' across two consecutive phrases (3 & 4) creates structural parallelism that shows conflicting actions (wiping tears vs. hiding handkerchief). Meaning emerges from pattern.",

        "pedagogicalChallenge": 7,
        "explanation": "Difficult for non-natives: 1) Recognizing partial reduplication vs. grammatical structure, 2) Understanding emphasis through sound vs. word order, 3) Appreciating parallel structure across phrases, 4) Producing clear tones (tay=ngang, tôi=ngang)."
      },

      "semanticNetwork": {
        "sourceDomain": "SOUND_PATTERN",
        "targetDomain": "PSYCHOLOGICAL_EMPHASIS",
        "mappings": [
          {
            "source": "Phonetic similarity (tay/tôi)",
            "target": "Focus on self and agency"
          },
          {
            "source": "Repetition across phrases",
            "target": "Internal conflict and preoccupation"
          },
          {
            "source": "Parallel structure",
            "target": "Contradictory emotional impulses"
          }
        ],
        "conceptualMetaphor": "SOUND REPETITION IS PSYCHOLOGICAL FOCUS / PHONIC PARALLELISM IS EMOTIONAL CONFLICT"
      },

      "usagePatterns": {
        "phrasePosition": "beginning",
        "explanation": "Opens both phrases 3 and 4, creating strong structural parallelism. Anchors the two contrasting actions (wipe tears / hide handkerchief).",

        "syntacticRole": "possessive_phrase",
        "explanation": "Functions as possessive noun phrase (my hand), subject of the action verbs 'gạt' (wipe) and 'dữ' (hold).",

        "discourseFunction": "emphasis_and_parallelism",
        "explanation": "Creates structural parallelism between phrases 3 and 4, emphasizing the speaker's conflicted emotional state through repeated self-focus.",

        "participationPattern": "solo",
        "explanation": "Introspective lines sung solo, not call-response. The repetition aids memorability and emotional intensification.",

        "emotionalValence": "negative_introspective",
        "explanation": "Introspective, melancholic - the focus on one's own hands suggests helplessness, self-awareness of emotional state, inability to control tears."
      },

      "statistics": {
        "occurrences": 2,
        "phraseIds": [3, 4],
        "totalPhrases": 5,
        "coverage": "40%",
        "positionDistribution": {
          "beginning": 2,
          "middle": 0,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 5,
        "explanation": "Partial reduplication common in Vietnamese folk songs, but this specific 'tay tôi' repetition across consecutive phrases is less common. The parallel structure creates moderate uniqueness.",

        "similarExpressions": [
          {
            "expression": "tim tôi (my heart)",
            "similarity": "high",
            "difference": "Uses 'tim' (heart) instead of 'tay' (hand). Same possessive + reduplication pattern. Tim more internal/emotional, tay more action-oriented."
          },
          {
            "expression": "đời tôi (my life)",
            "similarity": "high",
            "difference": "Uses 'đời' (life). Same pattern but broader scope (whole life vs. body part)."
          },
          {
            "expression": "lòng tao (my heart/feelings - Northern dialect)",
            "similarity": "medium",
            "difference": "Northern dialect 'tao' vs. Southern/formal 'tôi'. Different register but similar structure."
          }
        ],

        "regionalDistribution": "Nationwide, with formal pronoun 'tôi' more common in Southern/Central folk songs",
        "genreDistribution": "Love songs, farewell songs, laments - genres with high emotional introspection",
        "historicalPersistence": "Ancient pattern, continuously used in folk poetry to present"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce 'tay' and 'tôi' with exactly matching level tone (ngang) - flat, mid-pitch, sustained",
          "Emphasize the phonetic similarity by maintaining same pitch and length on both syllables",
          "In consecutive phrases 3 and 4, start 'Tay tôi' at same pitch to create audible parallelism",
          "Add subtle hand gesture - raise hand to face for phrase 3 (wiping tears), bring hand to chest for phrase 4 (hiding handkerchief)",
          "Slight pause after 'tay tôi' in both phrases to highlight the repeated pattern"
        ],

        "culturalSensitivity": [
          "The focus on hands reflects Vietnamese cultural attention to bodily gestures as emotional expression",
          "Wiping tears (gạt nước mắt) is culturally significant action - managing public display of emotion",
          "Hiding the handkerchief (giấu khăn) suggests shame or social pressure to conceal grief - culturally specific emotional management",
          "Avoid interpreting as weakness - in Vietnamese context, showing tears has complex gendered and social meanings"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach partial reduplication (láy bán phần) - words that share some but not all phonemes. Give 10+ examples from folk songs.",
          "Step 2: Analyze parallel structure - show how 'Tay tôi...' in phrase 3 mirrors 'Tay tôi...' in phrase 4. Discuss function (emphasis, contrast, emotional conflict).",
          "Step 3: Practice producing level tone (ngang) consistently - use pitch meter or musical instrument to verify flat pitch.",
          "Step 4: Compare to English emphasis techniques (word order, stress, intonation) - Vietnamese uses sound repetition instead.",
          "Step 5: Role-play emotional scenario - students describe conflicting actions using parallel 'tay tôi' structures."
        ],

        "commonMisinterpretations": [
          "❌ 'Tay tôi is grammatically incorrect (should be bàn tay tôi)' → ✅ Poetic reduction - omitting 'bàn' for phonetic effect is standard in songs",
          "❌ 'The repetition is redundant/unnecessary' → ✅ Deliberate parallel structure showing emotional conflict and self-focus",
          "❌ 'Should vary the opening of phrases 3 and 4' → ✅ Repetition is intentional - creates structural symmetry and psychological emphasis",
          "❌ 'This is just possessive phrase, no special meaning' → ✅ The reduplication and parallelism add layers of emphasis and introspection"
        ]
      }
    },

    {
      "expression": "nước mắt",
      "literal": "water eye",
      "meaning": "Tears (metaphorical compound: eye water)",
      "vietnameseCategory": "Ẩn dụ cấu trúc (Structural metaphor)",
      "semanticMechanism": "metaphorical_compound",
      "phraseIds": [3],

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Ancient metaphorical compound, documented in earliest Vietnamese texts and folk poetry. The conceptualization TEARS ARE WATER is cross-linguistic but Vietnamese lexicalizes it as compound. Pre-colonial origins.",

        "regionalSpecificity": 1,
        "explanation": "Universal across all Vietnamese dialects and regions. Standard term for tears, no regional variants. Low regional specificity.",

        "symbolicLoad": 7,
        "explanation": "Tears symbolize grief, loss, emotional overflow. In farewell context, 'nước mắt' carries weight of separation and sorrow. Water metaphor suggests fluidity, uncontrollability, abundance of emotion.",

        "ritualSignificance": 5,
        "explanation": "Tears play role in farewell rituals, funeral laments, and ceremonial songs. Crying at departures is culturally expected emotional display. Moderate ritual significance.",

        "transmissionImportance": 6,
        "explanation": "Important to teach as example of Vietnamese metaphorical compounds (N1 + N2 = metaphorical meaning). Shows how Vietnamese creates abstract concepts through concrete imagery. Moderate transmission value.",

        "emotionalResonance": 9,
        "explanation": "Extremely high emotional resonance - 'nước mắt' immediately evokes sadness, grief, separation. In Vietnamese culture, tears are powerful emotional symbol, especially in farewell and loss contexts."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "1) Literal components (water + eye), 2) Metaphorical compound (tears), 3) Symbolic level (grief, separation, emotional overflow). Moderate layering.",

        "crossDomainMapping": 6,
        "explanation": "LIQUID (water) → EMOTION (tears). CONTAINER (eye) → SOURCE OF EMOTION. Moderate metaphorical complexity - uses concrete physical domain (water/eye) to represent abstract emotional state.",

        "culturalPrerequisites": 3,
        "explanation": "Low cultural prerequisites - 'nước mắt' is standard Vietnamese word for tears, taught early to language learners. Cultural context (farewell, public crying norms) adds depth but not essential for basic understanding.",

        "idiomaticity": 9,
        "explanation": "Completely frozen - 'nước mắt' is the only way to say 'tears' in Vietnamese. Cannot decompose or vary. Fully lexicalized metaphor.",

        "contextDependence": 4,
        "explanation": "Fairly context-independent - means 'tears' in any context. Farewell scene intensifies emotional reading but doesn't change core meaning.",

        "pedagogicalChallenge": 4,
        "explanation": "Moderate difficulty: 1) Understanding compound structure (nước + mắt), 2) Recognizing dead metaphor (not actively metaphorical for native speakers), 3) Pronouncing tones correctly (nước=sắc, mắt=sắc with glottal stop)."
      },

      "semanticNetwork": {
        "sourceDomain": "LIQUID/WATER",
        "targetDomain": "EMOTION",
        "mappings": [
          {
            "source": "Water (nước)",
            "target": "Tears as fluid emotional expression"
          },
          {
            "source": "Eye (mắt) as container/source",
            "target": "Eye as origin point of emotional overflow"
          },
          {
            "source": "Water flowing",
            "target": "Uncontrollable emotion, abundance of feeling"
          }
        ],
        "conceptualMetaphor": "TEARS ARE WATER / EYES ARE CONTAINERS OF EMOTION"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Ends phrase 3: 'Tay tôi gạt nước mắt'. Climactic position - reveals the emotional state being managed.",

        "syntacticRole": "direct_object",
        "explanation": "Object of verb 'gạt' (wipe away). Receives the action, grammatically and semantically central to the phrase.",

        "discourseFunction": "emotional_revelation",
        "explanation": "Reveals the speaker's emotional state (crying) for first time in song. Shifts from address/request to emotional disclosure.",

        "participationPattern": "solo",
        "explanation": "Personal, introspective line. Typically sung solo, not communal or call-response. Tears are individual emotional expression.",

        "emotionalValence": "negative_grief",
        "explanation": "Clearly negative - tears signal sadness, loss, separation anxiety. In farewell context, evokes pain of parting."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [3],
        "totalPhrases": 5,
        "coverage": "20%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 2,
        "explanation": "Extremely common in Vietnamese folk songs, especially farewell and love songs. Standard vocabulary for emotional expression. Very low uniqueness.",

        "similarExpressions": [
          {
            "expression": "nước mắt đầm đìa (tears flowing abundantly)",
            "similarity": "high",
            "difference": "Adds intensifier 'đầm đìa' (flooding, pooling). Same base metaphor, amplified quantity."
          },
          {
            "expression": "lệ châu (tear pearls - literary)",
            "similarity": "medium",
            "difference": "Literary/poetic register. TEARS ARE PEARLS metaphor (valuable, beautiful) vs. TEARS ARE WATER (abundant, uncontrolled)."
          },
          {
            "expression": "rơi lệ (drop tears)",
            "similarity": "high",
            "difference": "Uses verb 'rơi' (fall/drop) instead of 'gạt' (wipe). Same tear imagery, different action."
          }
        ],

        "regionalDistribution": "Universal - all Vietnamese dialects and regions",
        "genreDistribution": "Extremely common across all genres with emotional content - love songs, laments, farewells, funeral songs",
        "historicalPersistence": "Ancient to present - continuously documented in folk poetry, classical literature, modern songs"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce 'nước mắt' with clear rising tone (sắc) on both syllables - sharp upward pitch",
          "Add slight catch in voice or vibrato on 'mắt' to convey emotional trembling",
          "Facial expression: eyes downcast or closed, as if suppressing tears or recalling crying",
          "Hand gesture: wipe motion across face/eyes during 'gạt nước mắt'",
          "If performing with accompaniment, instruments should soften or pause slightly to highlight emotional weight"
        ],

        "culturalSensitivity": [
          "In Vietnamese culture, public crying (especially for men) has complex social meanings - can signal sincerity or loss of composure depending on context",
          "Farewell tears are expected and culturally appropriate at boat departures, train stations, airports - sites of migration and separation",
          "For Vietnamese diaspora, 'nước mắt' in farewell songs may evoke trauma of leaving homeland, war separation, refugee experiences",
          "Treat with emotional gravity - avoid trivializing tears as mere sentimentality"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach Vietnamese metaphorical compounds - show how N1 + N2 creates new meaning (nước + mắt = tears, not 'water' and 'eye' separately)",
          "Step 2: Analyze conceptual metaphor TEARS ARE WATER - compare to English 'eyes welling up', 'flood of tears'. Discuss universal vs. language-specific aspects.",
          "Step 3: Explore cultural contexts where tears appear in Vietnamese songs - farewells, funerals, love separations. Map emotional scenarios.",
          "Step 4: Practice pronunciation - sắc tone on both syllables, with glottal stop at end of 'mắt'",
          "Step 5: Compare to other emotion words in Vietnamese - identify which use metaphorical compounds (nước mắt, trái tim) vs. abstract terms"
        ],

        "commonMisinterpretations": [
          "❌ 'Nước mắt is two separate words (water and eye)' → ✅ Lexicalized compound - one concept, inseparable",
          "❌ 'Vietnamese speakers actively think of water metaphor' → ✅ Dead metaphor for native speakers - just means tears, not consciously metaphorical",
          "❌ 'Can say mắt nước (reverse order)' → ✅ Compound is fixed - cannot rearrange",
          "❌ 'Tears are weak/feminine in this cultural context' → ✅ Tears at farewells are culturally expected for all genders, sign of genuine affection"
        ]
      }
    },

    {
      "expression": "i và a (melodic particles)",
      "literal": "i and a (vocables)",
      "meaning": "Melodic particles extending syllables for singing, no semantic meaning",
      "vietnameseCategory": "Từ tượng thanh (Onomatopoeia/vocables)",
      "semanticMechanism": "phonic_extension",
      "phraseIds": [2],

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Melodic particles in Vietnamese folk songs documented for centuries. Ancient oral tradition uses vocables to extend melody, aid memorization, create rhythmic patterns. Pre-literary, oral-performance origins.",

        "regionalSpecificity": 8,
        "explanation": "Strongly associated with Southern Vietnamese folk music (Đờn ca tài tử, hò Nam Bộ). Northern songs use different particles (a, ơi, à). Regionally diagnostic feature.",

        "symbolicLoad": 2,
        "explanation": "No symbolic meaning - pure phonetic/musical function. However, presence of particles signals folk/traditional genre vs. modern composed songs.",

        "ritualSignificance": 1,
        "explanation": "No specific ritual function. Found in ceremonial songs but as musical feature, not ritual element.",

        "transmissionImportance": 9,
        "explanation": "Extremely important for folk song performance. Teaching when and how to insert melodic particles essential for authentic traditional singing. Critical for oral transmission of melodies.",

        "emotionalResonance": 4,
        "explanation": "Moderate emotional effect - particles extend phrases, creating lilting, melodic quality associated with nostalgic/traditional soundscapes. Indirectly emotional through musical atmosphere."
      },

      "complexityMetrics": {
        "layersOfMeaning": 1,
        "explanation": "Single function: melodic extension. No semantic, symbolic, or metaphorical layers. Pure phonetic/musical element.",

        "crossDomainMapping": 1,
        "explanation": "No metaphorical mapping. Direct function: extend syllable for musical purposes.",

        "culturalPrerequisites": 7,
        "explanation": "Requires understanding: 1) Vietnamese musical traditions (Đờn ca tài tử, folk genres), 2) Regional differences in particle usage, 3) When to insert particles (prosodic/musical rules), 4) Performance conventions.",

        "idiomaticity": 6,
        "explanation": "Semi-fixed - certain particles conventionally appear in certain musical contexts, but performers have some flexibility. Regional/genre patterns constrain usage.",

        "contextDependence": 5,
        "explanation": "Context-dependent - particles chosen based on melody, regional style, musical phrase structure. Southern folk songs strongly favor 'i' and 'a'.",

        "pedagogicalChallenge": 8,
        "explanation": "Very difficult for non-natives: 1) Knowing where to insert particles, 2) Regional conventions, 3) Melodic/prosodic rules governing placement, 4) Singing particles with correct pitch and length, 5) Distinguishing from meaningful words."
      },

      "semanticNetwork": {
        "sourceDomain": "VOCAL_SOUND",
        "targetDomain": "MUSICAL_STRUCTURE",
        "mappings": [
          {
            "source": "Vowel sounds (i, a)",
            "target": "Melodic extension and ornamentation"
          },
          {
            "source": "Phonetic insertion",
            "target": "Rhythmic/metric completion"
          },
          {
            "source": "Pitch-carrying vocables",
            "target": "Musical phrase shaping"
          }
        ],
        "conceptualMetaphor": "SOUND IS MUSIC / VOCABLES ARE MELODIC TOOLS"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears mid-phrase: 'Cậu đưa tôi [i] ra đến bến [a] tàu'. Inserted between meaningful words to extend melody.",

        "syntacticRole": "non-syntactic_vocable",
        "explanation": "No grammatical function. Exists outside syntax, purely prosodic/musical element.",

        "discourseFunction": "melodic_extension",
        "explanation": "Extends melody, creates rhythmic flow, aids in singing long melodic phrases without adding semantic content.",

        "participationPattern": "solo_or_communal",
        "explanation": "Can be sung solo or in group singing. Particles help synchronize communal performance, signal phrase boundaries.",

        "emotionalValence": "neutral_melodic",
        "explanation": "No inherent emotional content, but contributes to nostalgic, traditional atmosphere through association with folk music."
      },

      "statistics": {
        "occurrences": 2,
        "phraseIds": [2],
        "totalPhrases": 5,
        "coverage": "20%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 2,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 3,
        "explanation": "Melodic particles extremely common in Southern Vietnamese folk songs. 'I' and 'a' are standard choices. Low uniqueness - conventional feature.",

        "similarExpressions": [
          {
            "expression": "ơi, à, ừ (Northern melodic particles)",
            "similarity": "high",
            "difference": "Regional variants - Northern songs use 'ơi, à, ừ' instead of Southern 'i, a'. Same function, different phonemes."
          },
          {
            "expression": "lơ, la, li (vocables in work songs)",
            "similarity": "medium",
            "difference": "Work songs (hò, hát ru) use different vocables. Same melodic function but different genre associations."
          },
          {
            "expression": "tra la la (Western vocables)",
            "similarity": "medium",
            "difference": "Cross-cultural parallel - vocables for singing without words. Different phonetic choices and cultural traditions."
          }
        ],

        "regionalDistribution": "Predominantly Southern Vietnam (Mekong Delta, coastal areas). Northern songs use different particles.",
        "genreDistribution": "Folk songs (hò, lý), Đờn ca tài tử, traditional Southern vocal music. Rare in modern pop or Northern ca trù.",
        "historicalPersistence": "Ancient oral tradition to present. Continuously used in folk music, though less common in contemporary urban songs."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'i' with bright, forward placement - high tongue position, smile embouchure",
          "Sing 'a' with open, relaxed mouth - wide vowel, lower tongue position",
          "Extend particles for 1-2 beats or more depending on melody - use as pitch-carriers",
          "Match pitch and tone to surrounding melodic contour - particles follow musical line, not linguistic tones",
          "Add slight vibrato or vocal ornamentation on extended particles for traditional stylistic effect",
          "Listen to traditional Southern folk singers (cô đầu, nghệ sĩ Đờn ca tài tử) for authentic placement and vocalization"
        ],

        "culturalSensitivity": [
          "Melodic particles are NOT meaningless gibberish - they are sophisticated musical devices in Vietnamese oral tradition",
          "Regional particles are identity markers - using 'i/a' signals Southern musical heritage. Respect regional authenticity.",
          "In diaspora communities, traditional particles evoke homeland and cultural memory - treat with respect, not as quaint decoration",
          "Avoid dismissing vocables as 'primitive' - they serve complex prosodic, mnemonic, and musical functions"
        ],

        "pedagogicalApproach": [
          "Step 1: Listen to 10+ examples of Southern Vietnamese folk songs (hò, lý). Mark where melodic particles appear. Identify patterns (position, frequency, choice of particle).",
          "Step 2: Practice singing scales using 'i' and 'a' - develop muscle memory for vowel shapes and pitch-carrying ability.",
          "Step 3: Learn regional differences - Northern vs. Southern particle systems. Map genre associations (work songs, love songs, Đờn ca tài tử).",
          "Step 4: Analyze prosodic rules - where can particles be inserted? (Usually between words, not within syllables. Often before or after directional words, prepositions.)",
          "Step 5: Performance practice - take existing folk song, try inserting/removing particles, hear how it changes musical flow and phrase structure.",
          "Step 6: Cultural context - discuss oral transmission, memorization, and how particles aid singers in preserving melodies across generations."
        ],

        "commonMisinterpretations": [
          "❌ 'These are filler words with no purpose' → ✅ Sophisticated musical devices for melodic extension and phrase shaping",
          "❌ 'Can insert any vowel sound anywhere' → ✅ Regional/genre conventions govern which particles to use and where to place them",
          "❌ 'Melodic particles are unique to Vietnamese' → ✅ Found across many musical traditions (scat singing, vocables in Native American songs, etc.) but Vietnamese has specific regional patterns",
          "❌ 'Modern songs don't need particles' → ✅ Particles are defining feature of traditional folk music - omitting them changes genre identity",
          "❌ 'Particles should follow Vietnamese tones' → ✅ Particles follow musical melody, not linguistic tone rules"
        ]
      }
    },

    {
      "expression": "xơi",
      "literal": "eat/drink/share (informal)",
      "meaning": "Cultural idiom for sharing betel nut, rice wine, or food in social bonding ritual",
      "vietnameseCategory": "Thành ngữ văn hóa (Cultural idiom)",
      "semanticMechanism": "cultural_practice_reference",
      "phraseIds": [5],

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Ancient cultural practice - sharing betel nut (trầu cau) documented in Vietnamese legends (Trầu Cau origin myth), rituals, and folk customs for 1000+ years. 'Xơi' as verb for ritual sharing is centuries old.",

        "regionalSpecificity": 6,
        "explanation": "Found across Vietnam, but 'xơi' more colloquial in Southern/Central dialects. Northern may use 'ăn' (eat) or 'uống' (drink) more commonly. Moderate regional specificity.",

        "symbolicLoad": 8,
        "explanation": "Betel/wine sharing symbolizes: hospitality, social bonding, equality (sharing implies parity), farewells (ritual closing gesture), trust. High symbolic weight in Vietnamese social culture.",

        "ritualSignificance": 9,
        "explanation": "Central to Vietnamese rituals: wedding betel exchange (lễ trầu), funeral offerings, Tết celebrations, welcoming guests. Essential ritual component in many ceremonies.",

        "transmissionImportance": 8,
        "explanation": "Important to teach cultural significance of sharing betel/wine. Helps learners understand Vietnamese hospitality norms, social bonding practices, ritual gestures. Critical for cultural competence.",

        "emotionalResonance": 7,
        "explanation": "High emotional resonance - 'xơi' in farewell context is tender, bittersweet gesture. Offering to share one last moment before parting. Evokes warmth and impending loss simultaneously."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "1) Literal action (eat/drink/chew), 2) Cultural practice (betel/wine sharing), 3) Social function (bonding, hospitality), 4) Symbolic level (equality, farewell ritual). Multi-layered.",

        "crossDomainMapping": 7,
        "explanation": "PHYSICAL ACTION (eating/drinking) → SOCIAL RELATIONSHIP (bonding, intimacy). CONSUMPTION → COMMUNION. Moderate-high metaphorical complexity - concrete act represents abstract social tie.",

        "culturalPrerequisites": 9,
        "explanation": "Extensive cultural knowledge required: 1) Betel nut tradition (trầu cau), 2) Wedding/funeral betel rituals, 3) Hospitality norms, 4) When/how to offer betel/wine, 5) Social meanings of shared consumption. High prerequisites.",

        "idiomaticity": 7,
        "explanation": "Semi-fixed - 'xơi' often appears in invitations ('mời xơi'), farewells, hospitality contexts. Somewhat conventionalized, but not completely frozen.",

        "contextDependence": 8,
        "explanation": "Heavily context-dependent - full meaning emerges from farewell scene. Without context, 'xơi' just means 'eat/drink'. In phrase 5, it's invitation to share final moment before parting.",

        "pedagogicalChallenge": 9,
        "explanation": "Very difficult for non-natives: 1) Unfamiliar cultural practice (betel chewing), 2) Social protocols, 3) Ritual significance, 4) Regional variation in usage, 5) When/how to offer or accept. High challenge."
      },

      "semanticNetwork": {
        "sourceDomain": "CONSUMPTION",
        "targetDomain": "SOCIAL_BONDING",
        "mappings": [
          {
            "source": "Eating/drinking together",
            "target": "Creating social bond and intimacy"
          },
          {
            "source": "Offering betel/wine",
            "target": "Hospitality, welcoming, respect"
          },
          {
            "source": "Shared consumption",
            "target": "Equality and mutual trust"
          },
          {
            "source": "Final sharing before departure",
            "target": "Farewell ritual, closure, affectionate parting"
          }
        ],
        "conceptualMetaphor": "SHARING FOOD/DRINK IS CREATING SOCIAL BOND / CONSUMPTION IS COMMUNION"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Ends the song (phrase 5): 'Mời cậu mình a xơi'. Closing gesture - final invitation before parting. Provides emotional resolution.",

        "syntacticRole": "verb",
        "explanation": "Main verb in invitation construction ('mời...xơi' = 'invite...to share'). Semantically central to the invitation speech act.",

        "discourseFunction": "farewell_invitation",
        "explanation": "Functions as closing farewell gesture. Softens sadness of departure with gesture of shared intimacy and hospitality.",

        "participationPattern": "solo_or_call_response",
        "explanation": "Invitation can be solo (speaker to addressee) or call-response (community echoing invitation). Depends on performance context.",

        "emotionalValence": "bittersweet_warm",
        "explanation": "Bittersweet - warm hospitality and affection mixed with sadness of imminent parting. The invitation is tender but occurs in context of farewell."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [5],
        "totalPhrases": 5,
        "coverage": "20%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 6,
        "explanation": "Betel/wine sharing common in Vietnamese folk songs, but 'mời cậu mình a xơi' has specific intimacy (pronoun 'mình') and melodic particle 'a'. Moderately unique phrasing.",

        "similarExpressions": [
          {
            "expression": "mời trầu cau (offer betel)",
            "similarity": "high",
            "difference": "Explicitly names 'trầu cau' (betel). 'Xơi' more general (could be betel, wine, food), more informal."
          },
          {
            "expression": "ăn uống (eat and drink)",
            "similarity": "medium",
            "difference": "General eating/drinking, less culturally specific. 'Xơi' carries stronger Southern folk/ritual associations."
          },
          {
            "expression": "cùng nhau uống rượu (drink wine together)",
            "similarity": "high",
            "difference": "More formal phrasing. 'Xơi' more colloquial, folksy."
          }
        ],

        "regionalDistribution": "Strong Southern association (Mekong Delta, where 'xơi' common). Central Vietnam also uses. Northern less common.",
        "genreDistribution": "Folk songs (especially farewells, love songs), wedding songs, hospitality songs. Ritual and ceremonial contexts.",
        "historicalPersistence": "Ancient (betel culture 1000+ years) to present, though betel chewing declining in modern urban Vietnam. Still strong in rural and traditional contexts."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce 'xơi' with level tone (ngang) - flat, mid-pitch. Clear /s/ sound at start.",
          "Sing with warm, inviting tone - 'mời' (invite) should sound hospitable and genuine",
          "Slight hand gesture - extend hand palm-up as if offering something, or touch chest to indicate sincerity",
          "Facial expression: gentle smile, eye contact (as if addressing someone), conveying warmth despite sadness",
          "Slight ritardando (slowing) on final phrase - gives sense of closure and reluctance to part"
        ],

        "culturalSensitivity": [
          "Betel nut (trầu cau) is ancient cultural tradition with deep roots - not 'exotic habit' or health concern in folk song context",
          "Sharing betel/wine is ritual of respect and equality - refusing in traditional context could be offensive",
          "For Vietnamese diaspora, betel rituals may evoke nostalgia for homeland traditions fading in new countries",
          "Understand generational shift - younger urban Vietnamese may not practice betel traditions, but older generations hold deep attachment",
          "In performance, honor the cultural practice even if unfamiliar - research betel nut customs, wedding betel exchange, hospitality norms"
        ],

        "pedagogicalApproach": [
          "Step 1: Cultural immersion - show photos/videos of Vietnamese betel nut preparation, wedding betel exchange (lễ trầu), elders sharing betel. Discuss cultural significance.",
          "Step 2: Read Trầu Cau origin legend - how betel nut became symbol of loyalty and love in Vietnamese mythology.",
          "Step 3: Analyze semantic extension - 'xơi' literally = eat/chew, but culturally = social bonding ritual. Map metaphorical domains.",
          "Step 4: Compare to other cultures - tea ceremony (Japan), kava ritual (Pacific), yerba mate sharing (South America). Universal pattern: SHARED CONSUMPTION = SOCIAL BOND.",
          "Step 5: Performance practice - role-play farewell scene with 'mời xơi' invitation. Practice tone, gesture, facial expression.",
          "Step 6: Modern context - discuss how betel traditions changing in contemporary Vietnam. How do folk songs preserve fading practices?"
        ],

        "commonMisinterpretations": [
          "❌ 'Xơi just means eat/drink casually' → ✅ Culturally loaded term - implies ritual sharing, social bonding, hospitality gesture",
          "❌ 'Betel nut is unhealthy, why include in song?' → ✅ Folk songs preserve historical cultural practices - not promoting health behavior, documenting traditional rituals",
          "❌ 'Can substitute with coffee/tea in modern performance' → ✅ Betel/wine have specific ritual significance - substitution changes cultural meaning",
          "❌ 'The invitation is casual, offhand gesture' → ✅ In farewell context, final invitation is tender, significant ritual closure"
        ]
      }
    },

    {
      "expression": "mình",
      "literal": "body/self/we",
      "meaning": "Intimate pronoun indicating very close relationship (romantic or deep friendship), creates us-two bond",
      "vietnameseCategory": "Đại từ thân mật (Intimate pronoun)",
      "semanticMechanism": "social_deixis",
      "phraseIds": [5],

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Intimate pronoun system documented in Vietnamese poetry and folk songs for centuries. 'Mình' usage in romantic/intimate contexts found in classical poetry (thơ Nôm) and ca dao. Pre-colonial origins.",

        "regionalSpecificity": 7,
        "explanation": "Strongly Southern/Central Vietnamese. Northern dialects use 'mình' differently (sometimes plural 'we', less romantic). In Southern love songs, 'mình' is distinctively intimate, romantic pronoun.",

        "symbolicLoad": 7,
        "explanation": "Symbolizes intimacy, equality, mutual belonging. Literally means 'body/self', extending to 'us-two' - blurs boundary between self and beloved. High symbolic weight in romantic discourse.",

        "ritualSignificance": 2,
        "explanation": "Not essential to specific rituals, but appears in courtship songs and romantic exchanges which have ritual dimensions (courting customs, đối đáp call-response).",

        "transmissionImportance": 9,
        "explanation": "Teaching Vietnamese pronoun system (especially 'mình') is critical for social competence. 'Mình' misuse can create awkward intimacy or offense. Essential for understanding Vietnamese social deixis.",

        "emotionalResonance": 8,
        "explanation": "Very high emotional resonance - 'mình' creates immediate intimacy. Hearing 'mình' in song signals romantic bond, vulnerability, mutual affection. Powerful emotional marker."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "1) Literal meaning (body/self), 2) Pronoun function (I/you/we), 3) Social meaning (intimacy marker), 4) Emotional meaning (affection, belonging). Multi-layered complexity.",

        "crossDomainMapping": 7,
        "explanation": "PHYSICAL BODY → SELF → US-TWO. Complex metaphorical chain: physical domain (body) → identity (self) → social relationship (intimate pair). High metaphorical complexity.",

        "culturalPrerequisites": 9,
        "explanation": "Extensive cultural knowledge required: 1) Vietnamese pronoun system (hierarchical, relational), 2) Regional differences, 3) When 'mình' appropriate vs. inappropriate, 4) Romantic/intimate discourse norms. Very high prerequisites.",

        "idiomaticity": 8,
        "explanation": "Highly conventionalized in romantic/intimate contexts. 'Mời cậu mình a xơi' - using 'mình' alongside 'cậu' creates specific intimate register. Semi-frozen pattern.",

        "contextDependence": 9,
        "explanation": "Heavily context-dependent - 'mình' meaning shifts based on speaker-addressee relationship, region, genre. In this farewell song, signals intimate bond (romantic or very close friendship).",

        "pedagogicalChallenge": 10,
        "explanation": "Extremely difficult for non-natives: 1) Complex pronoun system, 2) Regional variation, 3) Knowing when 'mình' appropriate, 4) Social consequences of misuse, 5) Multiple meanings (body/self/I/you/we), 6) Emotional nuance."
      },

      "semanticNetwork": {
        "sourceDomain": "PHYSICAL_BODY",
        "targetDomain": "SOCIAL_INTIMACY",
        "mappings": [
          {
            "source": "Body (mình as physical self)",
            "target": "Personal identity and selfhood"
          },
          {
            "source": "Self (individual)",
            "target": "Intimate pair (us-two, you-and-me)"
          },
          {
            "source": "Shared body metaphor",
            "target": "Mutual belonging and romantic bond"
          },
          {
            "source": "Pronoun ambiguity (I? you? we?)",
            "target": "Blurred boundaries in intimate relationships"
          }
        ],
        "conceptualMetaphor": "INTIMATE RELATIONSHIP IS SHARED BODY / CLOSENESS IS BLURRED SELF-OTHER BOUNDARY"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears mid-phrase 5: 'Mời cậu mình a xơi'. Positioned between 'cậu' (you) and 'xơi' (share), creating intimate frame for the invitation.",

        "syntacticRole": "intimate_modifier",
        "explanation": "Modifies or co-occurs with 'cậu' (you), creating 'cậu mình' (you, dear one / us-two). Functions as intimacy marker rather than strict grammatical role.",

        "discourseFunction": "intimacy_marking",
        "explanation": "Marks the relationship as intimate, close, romantic. Shifts register from polite request to tender, affectionate invitation.",

        "participationPattern": "solo_intimate",
        "explanation": "Intimate address, typically solo performance. 'Mình' creates dyadic intimacy (speaker-addressee pair), not communal participation.",

        "emotionalValence": "positive_tender",
        "explanation": "Positive, warm, affectionate - 'mình' conveys tenderness and mutual belonging. In farewell context, bittersweet (affection mixed with impending separation)."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [5],
        "totalPhrases": 5,
        "coverage": "20%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 5,
        "explanation": "Intimate pronouns common in Vietnamese love/farewell songs, but 'cậu mình' combination moderately distinctive. 'Mình' widespread in Southern romance songs but still carries weight.",

        "similarExpressions": [
          {
            "expression": "em yêu (beloved younger one)",
            "similarity": "high",
            "difference": "Uses 'em' (younger) + endearment. More hierarchical than 'mình' (equal/mutual). Both intimate but different power dynamics."
          },
          {
            "expression": "anh mình (our older brother/beloved)",
            "similarity": "high",
            "difference": "Uses 'anh' (older male) + 'mình'. Speaker positions self as younger. 'Cậu mình' more equal."
          },
          {
            "expression": "chúng ta (we, inclusive)",
            "similarity": "medium",
            "difference": "Formal, inclusive plural. 'Mình' more intimate, exclusive (just us-two, not broader group)."
          }
        ],

        "regionalDistribution": "Strong Southern association (Mekong Delta, Southern Central). Northern usage different (less romantic).",
        "genreDistribution": "Love songs, farewell songs, intimate folk songs. Rare in formal, ceremonial, or Northern ca trù.",
        "historicalPersistence": "Centuries-old in Southern folk traditions, continuously used in romantic discourse to present."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce 'mình' with falling tone (huyền) - start mid-high, descend smoothly",
          "Soften voice on 'mình' - convey tenderness and intimacy through vocal quality",
          "Slight emphasis or lengthening of 'mình' to highlight emotional weight",
          "Facial expression: gentle, affectionate gaze, slight smile",
          "Body language: lean slightly forward, open posture, conveying emotional closeness"
        ],

        "culturalSensitivity": [
          "Using 'mình' inappropriately (with strangers, superiors) is serious social error - signals false intimacy or disrespect",
          "In Vietnamese culture, pronoun choice is critical social skill - 'mình' misuse can offend or embarrass",
          "For learners: when in doubt, use more formal pronouns (anh, chị, cô, etc.) - safer socially",
          "Regional variation matters - 'mình' in Northern context may not signal romance as strongly as in South",
          "In performance, honor the intimacy 'mình' creates - not casual, but deeply affectionate"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach Vietnamese pronoun system - hierarchical (age, status), relational (kinship terms). Map full pronoun paradigm (tôi, anh, em, cậu, mày, etc.).",
          "Step 2: Focus on 'mình' - multiple meanings (body, self, I, you, we). Show how context determines meaning.",
          "Step 3: Regional differences - listen to Northern vs. Southern songs using 'mình'. Identify usage patterns.",
          "Step 4: Pragmatic rules - when to use 'mình' (intimate contexts) vs. when to avoid (formal, distant relationships). Role-play scenarios.",
          "Step 5: Analyze 'cậu mình' construction - how 'cậu' (informal you) + 'mình' (intimate us) create layered social meaning.",
          "Step 6: Compare to other languages - intimate pronouns (French 'tu', Spanish 'tú', Japanese 'omae'). Discuss universality of intimacy marking."
        ],

        "commonMisinterpretations": [
          "❌ 'Mình just means we/us in all contexts' → ✅ Highly context-dependent - can mean I, you, we, or us-two depending on region, relationship, genre",
          "❌ 'Can use mình with anyone' → ✅ Restricted to intimate relationships - misuse creates social awkwardness or offense",
          "❌ 'Mình is Northern and Southern same meaning' → ✅ Strong regional variation - Southern 'mình' more romantic/intimate than Northern",
          "❌ 'Pronoun choice doesn't matter in Vietnamese' → ✅ Pronouns are critical social markers - wrong choice = social error",
          "❌ 'Cậu mình is redundant (both mean you)' → ✅ Layered intimacy - 'cậu' informal, 'mình' deepens to romantic/intimate. Not redundant, cumulative."
        ]
      }
    }
  ],

  "aggregateStatistics": {
    "totalExpressions": 7,
    "uniqueExpressions": 7,
    "totalOccurrences": 9,
    "phrasesCovered": 5,
    "phraseCoverage": "100%",

    "averageCulturalWeight": 6.43,
    "culturalWeightBreakdown": {
      "historicalDepth": 8.00,
      "regionalSpecificity": 4.71,
      "symbolicLoad": 5.57,
      "ritualSignificance": 3.29,
      "transmissionImportance": 7.71,
      "emotionalResonance": 7.14
    },

    "averageComplexity": 5.79,
    "complexityBreakdown": {
      "layersOfMeaning": 2.86,
      "crossDomainMapping": 4.57,
      "culturalPrerequisites": 6.43,
      "idiomaticity": 6.71,
      "contextDependence": 6.00,
      "pedagogicalChallenge": 7.00
    },

    "dominantMechanism": "phonic_reduplication",
    "mechanismDistribution": {
      "vocative_formula": 1,
      "phonic_reduplication": 2,
      "metaphorical_compound": 1,
      "phonic_extension": 1,
      "cultural_practice_reference": 1,
      "social_deixis": 1
    },

    "culturalRichness": "high",
    "richnessCriteria": {
      "expressionDensity": "High - 7 expressions in 27 syllables (25.9%)",
      "culturalDepth": "Ancient traditions - betel rituals, vocative formulas, pronoun system",
      "emotionalRange": "Bittersweet farewell - longing, affection, grief, hospitality",
      "linguisticSophistication": "Multiple reduplication types, intimate pronouns, melodic particles"
    }
  },

  "collectionContext": {
    "genreClassification": "Farewell song (ca khúc chia tay) / Boat departure song",

    "culturalSignificance": "Represents traditional Vietnamese riverine culture where boat docks were primary sites of separation (migration, travel, military departure). Documents emotional norms around public crying, hospitality rituals (betel/wine sharing), and intimate relationship marking (pronoun use). Preserves fading cultural practices (betel nut exchange, melodic particles in Southern singing style).",

    "linguisticProfile": "Southern Vietnamese folk register with distinctive features: 1) Intimate pronoun 'mình' (romantic), 2) Melodic particles 'i' and 'a' (Southern vocal style), 3) Informal verb 'xơi' (colloquial), 4) Multiple reduplication types (láy), 5) Vocative formula with 'ơi' particle. Highly characteristic of Mekong Delta folk music traditions.",

    "performanceContext": "Traditionally sung at boat docks/riverbanks during farewells. Solo performance or call-response in communal settings. Often accompanied by traditional Southern instruments (đàn tranh, đàn nguyệt, đàn bầu) in Đờn ca tài tử ensemble style. Performance should emphasize emotional restraint breaking down (tears) contrasted with social composure (hiding handkerchief) and final hospitable gesture (sharing invitation). Tempo typically slow to moderate with rubato for emotional expression.",

    "pedagogicalValue": "Excellent teaching tool for: 1) Vietnamese pronoun system (cậu, tôi, mình - hierarchy and intimacy), 2) Reduplication types (partial, rhyming), 3) Regional music features (Southern particles, betel culture), 4) Emotional expression norms (public crying, gender dynamics), 5) Cultural practices (betel/wine sharing, dock farewells). Short length (27 syllables, 5 phrases) makes it accessible for beginners while offering sophisticated linguistic and cultural content for advanced learners."
  }
}
