{
  "songTitle": "Cặp bù kè",
  "version": "V3.0-DEEP",
  "enhancementDate": "2025-10-05",
  "totalSyllables": 16,
  "totalPhrases": 3,
  "phrases": [
    {
      "id": 1,
      "text": "Cặp bù kè chấm muối mè",
      "syllableCount": 6,
      "type": "narrative",
      "linguisticType": "narrative",
      "english": "Shrimp paste dipped in sesame salt",
      "figurativeExpressions": []
    },
    {
      "id": 2,
      "text": "Ăn với xôi ăn bình vôi phỏng miệng",
      "syllableCount": 8,
      "type": "narrative",
      "linguisticType": "narrative",
      "english": "Eat with sticky rice, eat betel lime burns the mouth",
      "figurativeExpressions": [
        {
          "vietnamese": "phỏng miệng",
          "literal": "burn mouth",
          "meaning": "rhyming phrase for musicality and emphasis",
          "classification": {
            "vietnameseCategory": "từ_láy",
            "semanticMechanism": "metaphorical",
            "culturalScope": "vietnamese_specific",
            "fixedness": "semi_fixed",
            "meaningDepth": "single"
          },
          "culturalWeights": {
            "historicalDepth": 5,
            "historicalDepthExplanation": "Rhyming reduplication patterns (từ láy) have been used in Vietnamese folk songs for centuries, particularly in children's songs and work songs. This represents a moderate historical tradition.",
            "regionalSpecificity": 3,
            "regionalSpecificityExplanation": "This rhyming pattern is widespread across Vietnamese-speaking regions, not specific to one area. It's a general Vietnamese linguistic feature rather than regionally bounded.",
            "symbolicLoad": 2,
            "symbolicLoadExplanation": "Primarily serves an aesthetic/phonetic function rather than deep symbolic meaning. The 'burning mouth' is more literal warning about betel lime than metaphorical depth.",
            "ritualSignificance": 1,
            "ritualSignificanceExplanation": "No particular ritual or ceremonial role. Used in casual contexts, children's songs, and everyday folk music rather than ceremonial settings.",
            "transmissionImportance": 5,
            "transmissionImportanceExplanation": "Moderately important for teaching Vietnamese phonetic patterns and folk song aesthetics. Demonstrates the từ láy tradition which is pedagogically valuable.",
            "emotionalResonance": 3,
            "emotionalResonanceExplanation": "Creates a playful, light-hearted atmosphere through sound beauty. Not emotionally powerful, but adds charm and memorability to the song."
          },
          "complexityMetrics": {
            "layersOfMeaning": 2,
            "layersOfMeaningExplanation": "Two layers: (1) Literal warning about caustic betel lime, (2) Phonetic/aesthetic layer for musicality. Not deeply multi-layered.",
            "crossDomainMapping": 3,
            "crossDomainMappingExplanation": "Simple mapping from SOUND/RHYME to BEAUTY/EMPHASIS. The metaphorical complexity is low - mainly using phonetic similarity for aesthetic effect.",
            "culturalPrerequisites": 3,
            "culturalPrerequisitesExplanation": "Requires understanding of (1) Vietnamese betel nut chewing tradition, (2) từ láy reduplication patterns. Moderate cultural background needed.",
            "idiomaticity": 6,
            "idiomaticityExplanation": "Semi-fixed rhyming pattern. The structure 'phỏng miệng' is somewhat established in Vietnamese phonetic patterns, though not a frozen idiom.",
            "contextDependence": 4,
            "contextDependenceExplanation": "Somewhat dependent on the food/eating context of the song. Works best when understood alongside the betel lime reference.",
            "pedagogicalChallenge": 3,
            "pedagogicalChallengeExplanation": "Relatively easy to teach. Main challenge is explaining Vietnamese rhyming aesthetics and the cultural context of betel nut chewing to non-natives."
          },
          "semanticNetwork": {
            "sourceDomain": "PHONETICS/SOUND",
            "targetDomain": "AESTHETICS/MUSICALITY",
            "mappings": [
              {
                "source": "rhyming sounds (phỏng-miệng)",
                "target": "musical beauty and memorability"
              },
              {
                "source": "repetitive phonetic pattern",
                "target": "emphasis and attention-drawing"
              },
              {
                "source": "sound similarity",
                "target": "aesthetic pleasure in listening"
              }
            ],
            "conceptualMetaphor": "SOUND BEAUTY IS AESTHETIC VALUE"
          },
          "usagePatterns": {
            "phrasePosition": "ending",
            "phrasePositionExplanation": "Appears at the end of phrase 2, serving as a closing element with rhyming emphasis",
            "syntacticRole": "predicate",
            "syntacticRoleExplanation": "Functions as the predicate describing what happens when eating betel lime ('burns the mouth')",
            "discourseFunction": "emphasis",
            "discourseFunctionExplanation": "Emphasizes the warning about betel lime through sound beauty, making the message more memorable",
            "participationPattern": "listening",
            "participationPatternExplanation": "Primarily for listening and learning. May involve communal singing in children's contexts.",
            "emotionalValence": "neutral",
            "emotionalValenceExplanation": "Neither strongly positive nor negative. Playful and informative rather than emotionally charged."
          },
          "statistics": {
            "occurrences": 1,
            "phraseIds": [2],
            "totalPhrases": 3,
            "coverage": "33.3%",
            "positionDistribution": {
              "beginning": 0,
              "middle": 0,
              "ending": 1
            }
          },
          "comparativeContext": {
            "uniquenessScore": 3,
            "uniquenessScoreExplanation": "Not unique - rhyming reduplication is a common feature in Vietnamese folk songs and children's songs. This is a representative example rather than exceptional.",
            "similarExpressions": [
              {
                "expression": "muối mè (from phrase 1 of same song)",
                "similarity": "high",
                "difference": "Both use rhyming reduplication, but 'muối mè' is partial reduplication while 'phỏng miệng' is rhyming reduplication"
              },
              {
                "expression": "o o o (from other folk songs)",
                "similarity": "medium",
                "difference": "Total reduplication for rhythm rather than rhyming variation"
              },
              {
                "expression": "chiều chiều (from Lý Chiều Chiều)",
                "similarity": "medium",
                "difference": "Total reduplication for emphasis rather than rhyming pattern"
              }
            ],
            "regionalDistribution": "Widespread across all Vietnamese regions - Northern, Central, and Southern folk traditions use similar rhyming patterns",
            "genreDistribution": "Common in children's songs, work songs, and educational folk songs. Particularly prevalent in songs teaching about food, customs, or daily activities",
            "historicalPersistence": "Traditional pattern with centuries of use. Rhyming reduplication remains productive in modern Vietnamese and continues to be taught to children"
          },
          "interpretiveGuidance": {
            "performanceTips": [
              "Emphasize the rhyme between 'phỏng' and 'miệng' with clear articulation",
              "Use a light, playful tone appropriate for children's song context",
              "Maintain rhythmic flow - don't over-emphasize to the point of breaking musical line",
              "Consider slight crescendo on 'phỏng' and decrescendo on 'miệng' to highlight the rhyme",
              "If performing for children, may use exaggerated facial expression on 'phỏng miệng' to convey the 'burning' sensation playfully"
            ],
            "culturalSensitivity": [
              "Understand that betel nut chewing is a traditional Vietnamese practice, not exotic or strange - approach with cultural respect",
              "Recognize this as part of children's educational tradition - teaching about traditional customs through song",
              "Avoid exoticizing or mocking the betel chewing reference - it's a serious traditional practice being taught lightheartedly",
              "When teaching to non-Vietnamese, explain the cultural context of betel nut (trầu cau) as important traditional practice in Vietnamese ceremonies",
              "Be aware that betel chewing is declining among younger generations - this song helps preserve cultural knowledge"
            ],
            "pedagogicalApproach": [
              "Step 1: Teach the literal meaning first - explain what 'bình vôi' (lime paste container) is in betel nut preparation",
              "Step 2: Demonstrate the rhyming pattern - have students identify the rhyme between 'phỏng' (burn) and 'miệng' (mouth)",
              "Step 3: Compare to English nursery rhymes that use similar sound patterns for memorability (e.g., 'Hickory Dickory Dock')",
              "Step 4: Practice pronunciation with focus on Vietnamese tones - 'phỏng' (hỏi tone) vs 'miệng' (nặng tone)",
              "Step 5: Explain the broader context of từ láy (reduplication) in Vietnamese - a productive linguistic pattern",
              "Step 6: Have students identify other rhyming pairs in Vietnamese folk songs to recognize the pattern"
            ],
            "commonMisinterpretations": [
              "❌ WRONG: This is about accidental mouth burning → ✅ CORRECT: It's a playful warning about the caustic nature of betel lime, using rhyme for emphasis and memorability",
              "❌ WRONG: 'phỏng miệng' is a fixed idiom meaning something unrelated to burning → ✅ CORRECT: It's a semi-fixed rhyming phrase meaning exactly 'burn mouth', used for phonetic beauty",
              "❌ WRONG: This is a serious warning song about food safety → ✅ CORRECT: It's a lighthearted children's song teaching about traditional customs through memorable rhymes",
              "❌ WRONG: The rhyme is accidental or meaningless → ✅ CORRECT: The rhyme is deliberate, serving the aesthetic and mnemonic functions central to Vietnamese folk song tradition"
            ]
          }
        }
      ]
    },
    {
      "id": 3,
      "text": "Ngồi xuống",
      "syllableCount": 2,
      "type": "instruction",
      "linguisticType": "imperative",
      "english": "Sit down",
      "figurativeExpressions": []
    }
  ],
  "aggregateStatistics": {
    "totalExpressions": 1,
    "uniqueExpressions": 1,
    "totalOccurrences": 1,
    "phrasesCovered": 1,
    "phraseCoverage": "33.3%",
    "averageCulturalWeight": 3.17,
    "averageCulturalWeightCalculation": "(5+3+2+1+5+3)/6 = 19/6 = 3.17",
    "averageComplexity": 3.50,
    "averageComplexityCalculation": "(2+3+3+6+4+3)/6 = 21/6 = 3.50",
    "dominantMechanism": "metaphorical",
    "culturalRichness": "minimal",
    "culturalRichnessExplanation": "Only 1 figurative expression covering 33% of phrases, with low to moderate cultural weights. Simple, direct language appropriate for children's educational context."
  },
  "collectionContext": {
    "genreClassification": "Children's song / Educational folk song",
    "genreExplanation": "This is a children's song teaching about traditional Vietnamese food customs and betel nut preparation. The simple structure, rhyming patterns, and directive ending ('sit down') are characteristic of children's educational songs.",
    "culturalSignificance": "Pedagogical value as introduction to Vietnamese traditional customs (betel nut chewing, food pairings). Preserves cultural knowledge about traditional condiments and practices that are declining in modern urban Vietnam.",
    "linguisticProfile": "Standard Vietnamese with southern/central influences (betel nut chewing more prevalent in these regions). Uses simple vocabulary appropriate for children. Features từ láy (reduplication) which is characteristic Vietnamese linguistic pattern.",
    "performanceContext": "Traditionally sung in informal settings - family gatherings, children's play, educational contexts. May be used to teach children about traditional customs before family ceremonies where betel nut would be prepared. Not ceremonial itself but educates about ceremonial practices.",
    "pedagogicalValue": "Excellent for teaching: (1) Vietnamese rhyming patterns and từ láy, (2) Traditional food customs, (3) Simple Vietnamese sentence structures, (4) Cultural context of betel nut in Vietnamese tradition, (5) Phonetic patterns in Vietnamese folk song tradition."
  },
  "metadata": {
    "enhancementMethod": "Manual V3.0 DEEP Enhancement by Claude LLM",
    "sourceFile": "Cặp bù kè.json (Tier 1)",
    "analysisCompleteness": "100%",
    "validationChecklist": {
      "culturalWeightsComplete": true,
      "complexityMetricsComplete": true,
      "semanticNetworkComplete": true,
      "usagePatternsComplete": true,
      "statisticsComplete": true,
      "comparativeContextComplete": true,
      "interpretiveGuidanceComplete": true,
      "aggregateStatisticsComplete": true,
      "collectionContextComplete": true
    }
  }
}
