{
  "metadata": {
    "songTitle": "hát cuộc",
    "totalSyllables": 49,
    "segmentedBy": "Claude LLM (punctuation-aware)",
    "enhancedDate": "2025-10-06",
    "enhancementVersion": "3.0",
    "enhancementMethod": "V3.0 DEEP Enhancement - Complete 7-component analysis"
  },
  "figurativeExpressions": [
    {
      "expression": "Homophone riddle wordplay mechanism",
      "literal": "Questions about oil, corn, coal, and silver that nobody uses",
      "meaning": "Wordplay riddles where homophone answers reveal hidden meanings: dầu mưa (rain), bắp chân (calf), than phiền (complaint), tóc bạc (gray hair)",

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Riddle songs (hát cuộc) are ancient Vietnamese folk tradition, documented across centuries. Homophone wordplay reflects tonal nature of Vietnamese language evolution over 1000+ years.",
        "regionalSpecificity": 5,
        "explanation": "Riddle songs found across Vietnam, but southern style marked by 'nỏ' particle. This particular riddle set could work in multiple dialects with adaptations.",
        "symbolicLoad": 7,
        "explanation": "Each riddle answer carries symbolic weight: rain = life-giving but unpredictable, calf = youthful strength, complaint = social burden, gray hair = aging/wisdom. Together they map life's arc.",
        "ritualSignificance": 7,
        "explanation": "Riddle contests were essential part of courtship rituals, especially during festivals. Solving riddles demonstrated intelligence, wit, and cultural knowledge - prerequisites for marriage.",
        "transmissionImportance": 8,
        "explanation": "Riddle songs preserve linguistic playfulness, tonal awareness, and oral tradition pedagogy. Essential for teaching Vietnamese homophone system and cultural values around courtship.",
        "emotionalResonance": 6,
        "explanation": "Evokes playfulness, intellectual challenge, romantic tension. The final reward (marriage) stakes create emotional investment in the riddle-solving process."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "Layer 1: Literal paradoxes (oil nobody lights). Layer 2: Homophone answers (dầu → dầu mưa). Layer 3: Symbolic meanings (rain = uncontrollable life force). Layer 4: Courtship test function (wit = marriage worthiness).",
        "crossDomainMapping": 8,
        "explanation": "Complex mapping: LINGUISTIC PUZZLES → INTELLECTUAL PROWESS → MARRIAGE SUITABILITY. Physical objects (oil, corn) map to abstract concepts (rain, body parts) which map to human qualities (wit) which determine social outcomes (marriage).",
        "culturalPrerequisites": 7,
        "explanation": "Requires: 1) Vietnamese tonal system understanding, 2) Knowledge of homophone pairs, 3) Courtship tradition context, 4) Southern dialect markers, 5) Agricultural/domestic reference frame (oil lamps, roasted corn, fanned coal).",
        "idiomaticity": 6,
        "explanation": "Semi-fixed riddle structure. The specific riddle answers (dầu mưa, bắp chân) are traditional and expected by Vietnamese audiences, but the frame 'một trăm thứ X' can generate new riddles.",
        "contextDependence": 8,
        "explanation": "Meaningless without cultural context. Non-native or even northern Vietnamese speakers may miss southern particle 'nỏ' and specific homophone pairs. Full meaning requires courtship tradition knowledge.",
        "pedagogicalChallenge": 9,
        "explanation": "Extremely difficult for non-natives: requires 1) Vietnamese tones mastery, 2) Homophone recognition, 3) Cultural context, 4) Riddle genre conventions, 5) Courtship tradition background. Even Vietnamese learners struggle with homophone wordplay."
      },

      "semanticNetwork": {
        "sourceDomain": "PHYSICAL_OBJECTS_AND_ACTIONS",
        "targetDomain": "LIFE_EXPERIENCES_AND_HUMAN_QUALITIES",
        "mappings": [
          {
            "source": "oil nobody lights (dầu không ai thắp)",
            "target": "rain (dầu mưa) - uncontrollable natural force"
          },
          {
            "source": "corn nobody roasts (bắp không ai rang)",
            "target": "calf muscle (bắp chân) - human body, youthful strength"
          },
          {
            "source": "coal nobody fans (than không ai quạt)",
            "target": "complaint (than phiền) - emotional burden, social friction"
          },
          {
            "source": "silver nobody buys (bạc không ai mua)",
            "target": "gray hair (tóc bạc) - aging, mortality, wisdom"
          },
          {
            "source": "solving riddles (giải được)",
            "target": "intellectual capability worthy of marriage (xin theo)"
          }
        ],
        "conceptualMetaphor": "LANGUAGE IS PUZZLE; INTELLIGENCE IS MARRIAGE CURRENCY; LIFE IS OBJECT SEQUENCE (rain → youth → complaint → aging)"
      },

      "usagePatterns": {
        "phrasePosition": "middle_series",
        "explanation": "Riddles occupy phrases 2-9 (central bulk of song), framed by vocative opening (phrase 1) and reward conclusion (phrases 10-11)",
        "syntacticRole": "question-answer_pairs",
        "explanation": "Each riddle is a two-part structure: setup ('một trăm thứ X') + question ('X chi không/nỏ ai Y'). Creates call-response rhythm.",
        "discourseFunction": "intellectual_challenge_and_courtship_test",
        "explanation": "Primary function: test suitor's wit and cultural knowledge. Secondary: entertainment, display of singer's cleverness, community bonding through shared riddle-solving.",
        "participationPattern": "call-response_with_audience",
        "explanation": "Singer poses riddles, audience attempts to solve (either silently or aloud). Creates interactive performance dynamic. In courtship context, specific suitor must answer.",
        "emotionalValence": "playful_challenging_with_romantic_stakes",
        "explanation": "Playful tone (riddles are fun), but underlying seriousness (marriage depends on correct answers). Tension between lightheartedness and high stakes."
      },

      "statistics": {
        "occurrences": 8,
        "phraseIds": [2, 3, 4, 5, 6, 7, 8, 9],
        "totalPhrases": 11,
        "coverage": "72.7%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 8,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 6,
        "explanation": "Riddle songs are common genre across Vietnam. These specific homophone pairs (dầu mưa, bắp chân, than phiền, tóc bạc) are well-known traditional riddles, not unique to this song. However, the 4-riddle courtship sequence structure is moderately distinctive.",
        "similarExpressions": [
          {
            "expression": "Other Vietnamese riddle songs (đố vui, hát đố)",
            "similarity": "high",
            "difference": "This song specifically uses courtship frame with marriage reward. Other riddle songs may be pure entertainment without romantic stakes."
          },
          {
            "expression": "Homophone riddles in other songs (e.g., 'vàng' gold vs 'vàng' yellow)",
            "similarity": "high",
            "difference": "This song uses 4-riddle series with life-arc progression (rain → youth → complaint → aging). Other songs may use isolated riddles without thematic unity."
          }
        ],
        "regionalDistribution": "Nationwide riddle tradition, but southern 'nỏ' particle marks this version as southern Vietnam (Mekong Delta region)",
        "genreDistribution": "Riddle songs (hát cuộc), courtship songs (ca dao tình yêu), interactive folk games (trò chơi dân gian)",
        "historicalPersistence": "Ancient to present. Riddle songs documented in French colonial era (1800s-1900s), but tradition likely much older. Still performed at festivals and cultural events."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Deliver riddle setups ('một trăm thứ dầu') with steady, rhythmic clarity - emphasize the paradox",
          "Pose questions ('dầu chi không ai thắp') with rising inflection, inviting audience response",
          "Pause after each question to allow audience thinking time (2-3 seconds)",
          "If performing with suitor, make eye contact during question phrases - test their wit directly",
          "Smile playfully to keep lighthearted tone despite serious courtship stakes",
          "Final phrase 'gái bốn mùa xin theo' should have warmth and promise - this is the reward",
          "Southern performers: emphasize 'nỏ' particle with light, almost teasing tone"
        ],
        "culturalSensitivity": [
          "Riddle songs were serious courtship tests - respect the intellectual tradition, not just 'cute game'",
          "Homophone wordplay showcases Vietnamese tonal sophistication - not linguistic 'confusion'",
          "Marriage stakes reflect cultural values: intelligence and wit as mate selection criteria",
          "If performing outside Vietnamese community, explain riddle answers - don't leave audience confused",
          "Southern dialect markers ('nỏ') are valid linguistic features, not 'incorrect Vietnamese'",
          "Avoid exoticizing courtship traditions - many cultures have intellectual tests for partnership"
        ],
        "pedagogicalApproach": [
          "Step 1: Teach Vietnamese tonal system basics - essential for homophone recognition",
          "Step 2: Introduce riddle structure: 'một trăm thứ X' (a hundred types of X) = paradox setup",
          "Step 3: Explain each riddle answer with phonetic transcription (dầu /zəw²¹/ = dầu mưa /zəw²¹ mɨə²¹/)",
          "Step 4: Discuss cultural context - why riddle contests in courtship? (values intelligence, shared cultural knowledge)",
          "Step 5: Practice performing with call-response rhythm - let students attempt to answer",
          "Step 6: Connect to broader Southeast Asian riddling traditions (Thai, Lao also have courtship riddles)",
          "Step 7: Advanced: analyze symbolic progression (rain → calf → complaint → gray hair) as life stages"
        ],
        "commonMisinterpretations": [
          "Misinterpretation: 'Riddles are just nonsense wordplay' → Correction: Riddles demonstrate linguistic mastery and cultural knowledge essential for social status",
          "Misinterpretation: 'Any answer works if it sounds similar' → Correction: Traditional riddle answers are fixed and well-known to Vietnamese audiences",
          "Misinterpretation: 'This is children's game' → Correction: Riddle contests were adult courtship rituals with serious marriage implications",
          "Misinterpretation: 'Southern 'nỏ' is grammatical error' → Correction: Valid dialectal particle marking southern Vietnamese regional identity",
          "Misinterpretation: 'Can skip riddles to get to romantic conclusion' → Correction: Solving riddles IS the courtship - skipping them loses the entire point"
        ]
      }
    },

    {
      "expression": "trăm thứ",
      "literal": "hundred types / hundred varieties",
      "meaning": "Partial reduplication creating rhythmic emphasis and hyperbolic quantity marker in riddle framing",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Reduplication patterns in Vietnamese are ancient, but this specific 'trăm thứ' combination is moderately old folk song formula, not ancient proverb. Documented in folk song collections from 1900s.",
        "regionalSpecificity": 3,
        "explanation": "Used across Vietnam in riddle songs and folk lyrics. Not region-specific. Northern, Central, Southern dialects all use 'trăm thứ' pattern.",
        "symbolicLoad": 4,
        "explanation": "Primarily rhythmic/emphatic function rather than deep symbolic meaning. 'Trăm' (hundred) = hyperbole for 'many', but not heavily metaphorical.",
        "ritualSignificance": 5,
        "explanation": "Functions as riddle genre marker - signals to audience that a riddle sequence is beginning. Part of the ritual structure of courtship song performance.",
        "transmissionImportance": 6,
        "explanation": "Important for teaching Vietnamese reduplication patterns and rhythmic formulae in folk songs. Useful pedagogically for demonstrating partial reduplication (different tones, similar sounds).",
        "emotionalResonance": 4,
        "explanation": "Creates mild rhythmic pleasure through sound repetition. Not deeply emotional, more playful and emphatic."
      },

      "complexityMetrics": {
        "layersOfMeaning": 2,
        "explanation": "Layer 1: Literal 'hundred types' (hyperbolic quantity). Layer 2: Rhythmic marker signaling riddle genre. Not heavily multi-layered.",
        "crossDomainMapping": 3,
        "explanation": "Minimal metaphorical mapping. Primarily functions as quantity hyperbole: MANY → HUNDRED. Some abstract mapping: REPETITION → EMPHASIS.",
        "culturalPrerequisites": 4,
        "explanation": "Requires: 1) Vietnamese reduplication pattern knowledge, 2) Folk song riddle genre familiarity, 3) Hyperbole convention understanding. Moderate cultural context needed.",
        "idiomaticity": 5,
        "explanation": "Semi-fixed expression. 'Trăm thứ' commonly appears in folk songs, but can be varied (e.g., 'ngàn vạn thứ' = thousand myriad types). Moderately idiomatic.",
        "contextDependence": 4,
        "explanation": "Functions in riddle context specifically. Outside riddle songs, 'trăm thứ' can appear but loses genre-marking function. Moderately context-dependent.",
        "pedagogicalChallenge": 5,
        "explanation": "Moderate difficulty: requires understanding partial reduplication (trăm /ʈăm²¹/ → thứ /tʰɨ˦˥/) where tones differ but sounds echo. Easier than full homophone riddles, harder than simple repetition."
      },

      "semanticNetwork": {
        "sourceDomain": "QUANTITY_AND_SOUND",
        "targetDomain": "EMPHASIS_AND_GENRE_MARKING",
        "mappings": [
          {
            "source": "hundred (trăm)",
            "target": "hyperbolic many"
          },
          {
            "source": "types (thứ) - sounds similar to trăm",
            "target": "rhythmic echo creating emphasis"
          },
          {
            "source": "repetition of 'trăm thứ' 4 times",
            "target": "riddle series structure marker"
          }
        ],
        "conceptualMetaphor": "SOUND REPETITION IS EMPHASIS; FORMULAIC LANGUAGE IS GENRE SIGNAL"
      },

      "usagePatterns": {
        "phrasePosition": "phrase_beginning",
        "explanation": "Always appears at the start of riddle setup phrases (phrases 2, 4, 6, 8). Functions as opening frame for each new riddle.",
        "syntacticRole": "quantifier_phrase",
        "explanation": "Modifies the riddle object (dầu, bắp, than, bạc). Grammatically functions as quantity expression ('a hundred types of X').",
        "discourseFunction": "riddle_setup_marker",
        "explanation": "Signals to audience: 'a new riddle is starting'. Creates rhythmic consistency across riddle series. Also creates hyperbolic absurdity (hundred types of oil?) to emphasize the paradox.",
        "participationPattern": "solo_singer",
        "explanation": "Sung by the riddler (usually female in courtship context). Audience/suitor listens and prepares to answer after the question phrase.",
        "emotionalValence": "playful_rhythmic",
        "explanation": "Light, playful tone through repetition. Creates musical pattern that's easy to remember and enjoyable to sing/hear."
      },

      "statistics": {
        "occurrences": 4,
        "phraseIds": [2, 4, 6, 8],
        "totalPhrases": 11,
        "coverage": "36.4%",
        "positionDistribution": {
          "beginning": 4,
          "middle": 0,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 3,
        "explanation": "Very common reduplication pattern in Vietnamese folk songs. Appears in many riddle songs, lullabies, work songs. Not unique to this song at all.",
        "similarExpressions": [
          {
            "expression": "trăm thứ in other folk songs",
            "similarity": "very high",
            "difference": "Identical usage - this is a stock formula across Vietnamese folk song tradition"
          },
          {
            "expression": "ngàn vạn (thousand myriad) - similar hyperbolic pattern",
            "similarity": "high",
            "difference": "ngàn vạn is more extreme hyperbole, usually for grander topics (love, sorrow) not riddles"
          },
          {
            "expression": "bao nhiêu (how many) - question form",
            "similarity": "medium",
            "difference": "bao nhiêu is genuine question, trăm thứ is rhetorical hyperbole"
          }
        ],
        "regionalDistribution": "Nationwide - all Vietnamese dialects use this pattern",
        "genreDistribution": "Folk songs (ca dao), riddle songs (hát cuộc), children's songs (đồng dao), some poetic writing",
        "historicalPersistence": "Ancient to present. Reduplication is core feature of Vietnamese, this specific pattern documented in folk song collections from 1800s-1900s onwards."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Emphasize the 'tr' initial consonant in 'trăm' with slight tongue trill for rhythmic effect",
          "Keep 'thứ' lighter than 'trăm' - first word is the anchor, second is the echo",
          "Maintain consistent rhythm across all 4 occurrences - this creates musical pattern expectation",
          "Slight pause after 'trăm thứ' before stating the object (dầu, bắp, than, bạc) - builds suspense",
          "Use hand gesture (spreading fingers) on 'trăm' to visualize 'many' - engages audience visually"
        ],
        "culturalSensitivity": [
          "This is not grammatical error or 'broken Vietnamese' - it's intentional reduplication",
          "Reduplication is a sophisticated linguistic feature, not childish or simplistic",
          "Folk song formulae like 'trăm thứ' are cultural heritage, deserve respect as oral literature",
          "If teaching, explain Vietnamese allows sound-based word play that English does not",
          "Hyperbole in folk songs is rhetorical tradition, not literal exaggeration to be corrected"
        ],
        "pedagogicalApproach": [
          "Step 1: Explain Vietnamese reduplication types: full (đỏ đỏ), partial (trăm thứ), rhyming (lăng xăng)",
          "Step 2: Show 'trăm thứ' is partial reduplication - consonant echo (tr → th), vowel shift (ă → ɨ), tone change (21 → 45)",
          "Step 3: Contrast with English where reduplication is rare and informal ('teeny-tiny')",
          "Step 4: Practice pronunciation: trăm /ʈăm²¹/ → thứ /tʰɨ˦˥/ - focus on tone accuracy",
          "Step 5: Identify 'trăm thứ' pattern in other folk songs students may know",
          "Step 6: Have students create their own riddles using 'trăm thứ X' formula",
          "Step 7: Discuss hyperbole as rhetorical device cross-culturally (not just Vietnamese)"
        ],
        "commonMisinterpretations": [
          "Misinterpretation: 'Trăm thứ is grammatical mistake for just trăm' → Correction: Intentional reduplication for rhythmic and emphatic effect",
          "Misinterpretation: 'It means exactly 100 types' → Correction: Hyperbolic expression meaning 'many types', not literal count",
          "Misinterpretation: 'Can say thứ trăm instead' → Correction: Word order matters - trăm thứ is fixed, reversing it breaks the formula",
          "Misinterpretation: 'This is childish repetition' → Correction: Sophisticated folk poetic device, part of oral literature tradition"
        ]
      }
    },

    {
      "expression": "nam nhi",
      "literal": "southern male / southern man",
      "meaning": "Literary/poetic term for 'young man' or 'manly man', carries connotations of vigor, capability, masculinity",

      "culturalWeights": {
        "historicalDepth": 7,
        "explanation": "Classical Chinese-Vietnamese compound (Hán Việt) used in poetry and formal literature for centuries. Not ancient folk term, but elevated literary register from classical poetry tradition (1000-1900s).",
        "regionalSpecificity": 2,
        "explanation": "Used nationwide - Hán Việt terms are shared across all Vietnamese dialects. 'Nam nhi' understood from North to South despite different folk vocabulary in each region.",
        "symbolicLoad": 6,
        "explanation": "Carries symbolic weight beyond literal 'man': suggests heroism, capability, traditional masculine ideals (strength, intelligence, provider role). Contrasts with 'gái' (girl) in courtship dynamic.",
        "ritualSignificance": 6,
        "explanation": "In courtship song context, 'nam nhi' invokes traditional gender roles and marriage ritual framework. Using elevated literary term (not casual 'trai') adds ceremonial weight to the courtship test.",
        "transmissionImportance": 5,
        "explanation": "Important for teaching literary Vietnamese and classical compound usage in folk songs. Shows how folk tradition incorporates formal register for emphasis.",
        "emotionalResonance": 5,
        "explanation": "Evokes respect, aspiration, traditional values. Creates contrast between challenge difficulty and masculine capability - 'if you're truly a capable man, solve this'."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "Layer 1: Literal 'southern man' (nam = south, nhi = child/man). Layer 2: Literary register 'young man' (elevated vocabulary). Layer 3: Symbolic 'capable/worthy man' (masculine ideal).",
        "crossDomainMapping": 5,
        "explanation": "Moderate mapping: GEOGRAPHIC DIRECTION (south) + PERSON → MASCULINE IDEAL → MARRIAGE WORTHINESS. Also: CLASSICAL LANGUAGE → CEREMONIAL WEIGHT in folk context.",
        "culturalPrerequisites": 6,
        "explanation": "Requires: 1) Hán Việt compound knowledge, 2) Literary vs folk register distinction, 3) Traditional gender roles understanding, 4) Courtship song genre conventions, 5) Classical poetry influence on folk songs.",
        "idiomaticity": 7,
        "explanation": "Highly fixed compound - cannot say 'nhi nam' (reversed) or substitute 'đàn ông' (casual 'man'). Must use exact classical form to achieve literary effect.",
        "contextDependence": 6,
        "explanation": "Meaning shifts based on context: in courtship song = 'worthy suitor', in military context = 'valiant soldier', in poetry = 'heroic man'. Depends on genre context for full meaning.",
        "pedagogicalChallenge": 7,
        "explanation": "Difficult for non-natives: 1) Must recognize Hán Việt compounds, 2) Understand 'nam' = south but also 'male', 3) Know 'nhi' is classical 'man' not modern usage, 4) Grasp register shift (formal in folk context), 5) Appreciate gender symbolism."
      },

      "semanticNetwork": {
        "sourceDomain": "CLASSICAL_LITERARY_LANGUAGE",
        "targetDomain": "MASCULINE_WORTHINESS_AND_COURTSHIP_CHALLENGE",
        "mappings": [
          {
            "source": "nam (south, also male)",
            "target": "masculine principle (yang in yin-yang cosmology)"
          },
          {
            "source": "nhi (classical term for man/child)",
            "target": "literary elevation - not common speech"
          },
          {
            "source": "nam nhi compound",
            "target": "ideal capable man worthy of marriage"
          },
          {
            "source": "using literary term in folk song",
            "target": "ceremonial weight of courtship test"
          }
        ],
        "conceptualMetaphor": "FORMAL LANGUAGE IS CEREMONIAL WEIGHT; SOLVING RIDDLES IS MASCULINE CAPABILITY"
      },

      "usagePatterns": {
        "phrasePosition": "phrase_beginning",
        "explanation": "Appears at start of phrase 10 ('Trai nam nhi giải được'), marking the shift from riddle questions to reward conditions.",
        "syntacticRole": "subject_noun",
        "explanation": "Functions as the subject of conditional clause - 'if the young man can solve...'. Identifies who is being tested.",
        "discourseFunction": "challenge_addressee_and_register_elevation",
        "explanation": "Dual function: 1) Specifies the target (young male suitor), 2) Elevates register from folk riddles to ceremonial marriage proposal. Signals seriousness underlying playful riddles.",
        "participationPattern": "solo_singer_addressing_suitor",
        "explanation": "Sung by female riddler, directed at specific male suitor or generic male audience. Creates direct challenge - 'you, capable man, solve this'.",
        "emotionalValence": "respectful_challenging",
        "explanation": "Respectful tone (using literary term, not casual language) combined with challenge (prove your worth). Balance of traditional respect and competitive testing."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [10],
        "totalPhrases": 11,
        "coverage": "9.1%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 4,
        "explanation": "Moderately common in folk songs and poetry. Not unique to this song, but selective usage - folk songs often use casual 'trai' instead. Choosing 'nam nhi' adds literary flavor.",
        "similarExpressions": [
          {
            "expression": "trai (young man) - common folk term",
            "similarity": "high",
            "difference": "trai is casual/folk register, nam nhi is literary/classical. Trai appears in phrase 10 before nam nhi, showing register progression."
          },
          {
            "expression": "anh hùng (hero) - similar masculine ideal",
            "similarity": "medium",
            "difference": "anh hùng is martial/military heroism, nam nhi is broader capable man including intellectual ability"
          },
          {
            "expression": "nam tử (man/male) - similar Hán Việt compound",
            "similarity": "high",
            "difference": "nam tử more neutral/biological male, nam nhi more idealized/literary young man"
          }
        ],
        "regionalDistribution": "Nationwide - Hán Việt terms are standard across dialects",
        "genreDistribution": "Classical poetry, folk songs (selective), proverbs, historical narratives",
        "historicalPersistence": "Ancient (Chinese classical literature) to present, but declining in everyday speech. Still used in formal contexts, poetry, cultural performances."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Emphasize 'nam nhi' with clear articulation - this is elevated language, deserves respect",
          "Slight pause before 'nam nhi' to mark register shift from casual 'trai' earlier",
          "Deliver with direct gaze if performing to specific suitor - this is personal challenge",
          "Tone should be respectful but firm - 'you, capable man' not mocking or dismissive",
          "Southern performers: maintain 'nhi' pronunciation /ni²¹/ not drift to /ɲi²¹/ (too casual)"
        ],
        "culturalSensitivity": [
          "Nam nhi reflects traditional gender roles - approach with cultural relativism, not judgment",
          "Literary Vietnamese is not 'pretentious' - it's register shifting for ceremonial effect",
          "Hán Việt compounds are part of Vietnamese linguistic heritage, not 'foreign Chinese words'",
          "Courtship songs test both genders differently - respect the tradition even if not modern values",
          "Using 'capable man' ideal doesn't mean diminishing women - folk songs also praise 'gái đảm đang' (capable woman)"
        ],
        "pedagogicalApproach": [
          "Step 1: Explain Hán Việt layer in Vietnamese - Chinese-origin compounds used for centuries",
          "Step 2: Break down 'nam' (south, also male/masculine principle) + 'nhi' (child/man classical term)",
          "Step 3: Contrast registers: trai (folk/casual) vs nam nhi (literary/formal) - both mean young man",
          "Step 4: Discuss why folk song uses literary term here - ceremonial weight for marriage proposal",
          "Step 5: Compare to English register shifts (guy → gentleman, girl → lady) for similar effect",
          "Step 6: Practice identifying Hán Việt compounds in other folk songs (e.g., trai nam = southern boy)",
          "Step 7: Discuss traditional masculine ideals cross-culturally (Vietnamese nam nhi, Japanese bushido, etc.)"
        ],
        "commonMisinterpretations": [
          "Misinterpretation: 'Nam nhi means man from the south' → Correction: Literary term for capable/worthy young man, 'nam' here is masculine principle not geography",
          "Misinterpretation: 'Can use any word for man (đàn ông, trai, etc.)' → Correction: Nam nhi specifically chosen for literary register and ceremonial weight",
          "Misinterpretation: 'This is sexist language' → Correction: Reflects historical courtship traditions, cultural artifact to understand not to impose modern values on",
          "Misinterpretation: 'Nam nhi is Chinese, not Vietnamese' → Correction: Hán Việt compounds are Vietnamese vocabulary, used for centuries and integrated into language"
        ]
      }
    },

    {
      "expression": "gái bốn mùa",
      "literal": "girl of four seasons",
      "meaning": "Beautiful girl year-round, evergreen beauty that doesn't fade with seasons. Metaphor for consistent, enduring attractiveness and virtue.",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Seasonal metaphors for beauty are long-standing in Vietnamese poetry and folk songs (centuries old). Specific 'bốn mùa' phrasing documented in folk song collections from 1900s, likely older in oral tradition.",
        "regionalSpecificity": 4,
        "explanation": "Used across Vietnam, but tropical south has less seasonal variation making 'four seasons' more abstract. Northern Vietnam with distinct seasons may interpret this more literally (beauty in all weather).",
        "symbolicLoad": 7,
        "explanation": "Rich symbolism: Four seasons = completeness, year-round = constancy/reliability, beauty not fading = virtue + physical attractiveness. Implies woman's value is consistent, not fleeting youth.",
        "ritualSignificance": 7,
        "explanation": "In courtship context, this is the PRIZE - the woman offering herself in marriage. Using elevated metaphor ('gái bốn mùa' not just 'gái đẹp' = pretty girl) shows she values herself highly, matching the intellectual challenge.",
        "transmissionImportance": 6,
        "explanation": "Important for teaching Vietnamese metaphorical language and seasonal imagery in folk poetry. Shows how abstract concepts (constancy) expressed through natural cycles (seasons).",
        "emotionalResonance": 7,
        "explanation": "Strong emotional impact: romantic promise, self-worth declaration, reward for intellectual achievement. Evokes yearning, aspiration, romantic fulfillment."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "Layer 1: Literal 'girl of all seasons'. Layer 2: Metaphor for year-round beauty. Layer 3: Implies virtuous character (not just looks) that endures. Layer 4: Self-worth statement in courtship negotiation.",
        "crossDomainMapping": 7,
        "explanation": "Complex mapping: NATURAL CYCLES (four seasons) → TEMPORAL CONSTANCY (year-round) → HUMAN QUALITIES (enduring beauty + virtue) → MARRIAGE VALUE (worthy prize for intellectual prowess).",
        "culturalPrerequisites": 5,
        "explanation": "Requires: 1) Vietnamese seasonal metaphor tradition, 2) Folk song courtship conventions, 3) Beauty as seasonal concept (spring beauty fades, etc.), 4) Understanding value negotiation in marriage, 5) Metaphorical language in folk poetry.",
        "idiomaticity": 6,
        "explanation": "Semi-fixed expression. 'Bốn mùa' (four seasons) commonly modifies beauty/joy/etc. in folk songs. Somewhat flexible (can say 'đẹp bốn mùa' = beautiful four seasons) but 'gái bốn mùa' is established phrase.",
        "contextDependence": 6,
        "explanation": "Meaning enhanced by context: in courtship song, it's marriage prize. Outside courtship, could be simple beauty compliment. Riddle-solving prerequisite adds conditional aspect - 'this treasure is yours IF...'.",
        "pedagogicalChallenge": 6,
        "explanation": "Moderate-high difficulty: 1) Requires understanding seasonal metaphor system, 2) Knowing 'bốn mùa' is constancy not literal seasonality, 3) Grasping implied virtue not just beauty, 4) Understanding courtship value negotiation, 5) Vietnamese marriage traditions."
      },

      "semanticNetwork": {
        "sourceDomain": "NATURAL_SEASONAL_CYCLES",
        "targetDomain": "HUMAN_ENDURING_VALUE_IN_MARRIAGE",
        "mappings": [
          {
            "source": "four seasons (complete annual cycle)",
            "target": "completeness, wholeness of character"
          },
          {
            "source": "year-round (not just spring bloom)",
            "target": "enduring beauty and virtue, not fleeting youth"
          },
          {
            "source": "seasonal beauty (flowers bloom and fade)",
            "target": "woman's worth (some fade, this one constant)"
          },
          {
            "source": "weather variations (all seasons)",
            "target": "tested through adversity, reliable in all conditions"
          }
        ],
        "conceptualMetaphor": "HUMAN VALUE IS SEASONAL CYCLE; MARRIAGE IS SEASONAL CONTINUITY; BEAUTY IS YEAR-ROUND BLOOM"
      },

      "usagePatterns": {
        "phrasePosition": "phrase_ending",
        "explanation": "Appears in final phrase (11) as the climactic reward for solving riddles. Positioned after 'thì' (then) to emphasize conditional promise.",
        "syntacticRole": "subject_noun_phrase",
        "explanation": "Subject of final clause 'gái bốn mùa xin theo' (the year-round beautiful girl requests to follow). Identifies the prize being offered.",
        "discourseFunction": "reward_declaration_and_self-valuation",
        "explanation": "Dual function: 1) States the prize (marriage to worthy woman), 2) Woman declares her own high value using elevated metaphor - she's not desperate, she's selective.",
        "participationPattern": "solo_singer_as_female_voice",
        "explanation": "Sung by woman (riddler), referring to herself in third person with elevated language. Creates romantic conclusion where woman offers herself to deserving suitor.",
        "emotionalValence": "proud_promising_romantic",
        "explanation": "Pride in self-worth ('bốn mùa' is high self-valuation), promise of fulfillment, romantic warmth. Final emotional payoff after playful challenge."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [11],
        "totalPhrases": 11,
        "coverage": "9.1%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 5,
        "explanation": "Moderately common seasonal metaphor in Vietnamese folk songs and poetry. Many songs use 'bốn mùa' imagery (e.g., 'hoa bốn mùa' = year-round flowers). This specific usage in courtship reward context is somewhat distinctive.",
        "similarExpressions": [
          {
            "expression": "gái đảm đang (capable/virtuous girl)",
            "similarity": "medium",
            "difference": "gái đảm đang emphasizes competence/virtue, gái bốn mùa emphasizes enduring beauty. Both are high-value marriage descriptors."
          },
          {
            "expression": "hoa xuân (spring flower) - opposite metaphor",
            "similarity": "high contrast",
            "difference": "hoa xuân = fleeting seasonal beauty, gái bốn mùa = year-round constant beauty. Intentional contrast."
          },
          {
            "expression": "xinh đẹp quanh năm (beautiful all year)",
            "similarity": "very high",
            "difference": "More literal/prosaic phrasing, gái bốn mùa is more poetic/metaphorical. Same concept, different register."
          }
        ],
        "regionalDistribution": "Nationwide in folk songs and poetry. Seasonal metaphors universal across Vietnamese literature.",
        "genreDistribution": "Courtship folk songs (ca dao tình yêu), classical poetry, love songs (tình ca), wedding songs (hát cưới)",
        "historicalPersistence": "Long-standing (centuries) to present. Seasonal metaphors are classical poetry staple, adopted into folk songs. Still used in contemporary Vietnamese love songs."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Deliver 'gái bốn mùa' with pride and warmth - this is both self-valuation and gift",
          "Emphasize 'bốn mùa' slightly - the key metaphorical element distinguishing from casual 'gái xinh'",
          "Slight smile on 'xin theo' (request to follow) - shows willing romantic devotion, not coerced",
          "If performing as courtship song, make eye contact with suitor on this phrase - direct promise",
          "Tone should shift from playful challenge (riddles) to sincere romantic promise (conclusion)",
          "Hand gesture: open palm on heart for 'gái bốn mùa' showing sincerity and self-offering"
        ],
        "culturalSensitivity": [
          "This is woman's self-valuation, not male describing her - respect her agency in courtship",
          "Year-round beauty implies virtue and character, not just physical looks - holistic value",
          "Conditional marriage offer (must solve riddles first) shows women's selectivity, not passivity",
          "Traditional courtship shouldn't be dismissed as 'sexist' - women had power to set tests",
          "Seasonal metaphors are poetic tradition, not biological determinism - understand as literature",
          "Contemporary Vietnamese may find this old-fashioned, but it's cultural heritage deserving respect"
        ],
        "pedagogicalApproach": [
          "Step 1: Explain Vietnamese seasonal metaphor system - spring = youth, autumn = maturity, etc.",
          "Step 2: Discuss 'bốn mùa' as completeness/constancy vs single season as limitation/impermanence",
          "Step 3: Contrast 'gái bốn mùa' (enduring) with 'hoa xuân' (fleeting) - value systems for beauty",
          "Step 4: Analyze courtship power dynamics - woman sets challenge, offers self only if man succeeds",
          "Step 5: Compare to Western seasonal beauty metaphors ('eternal spring', 'perennial rose')",
          "Step 6: Practice using 'bốn mùa' in other contexts (hoa bốn mùa, vui bốn mùa, etc.)",
          "Step 7: Discuss how metaphor reflects cultural values (constancy, virtue, tested worthiness)"
        ],
        "commonMisinterpretations": [
          "Misinterpretation: 'Gái bốn mùa means girl who works all year' → Correction: Metaphor for enduring beauty and virtue, not agricultural labor",
          "Misinterpretation: 'This is male describing ideal woman' → Correction: Woman describing herself with high self-valuation in courtship negotiation",
          "Misinterpretation: 'Bốn mùa is only about looks' → Correction: Implies character/virtue that endures, not just physical beauty that fades",
          "Misinterpretation: 'Woman is desperate, offering herself' → Correction: Selective offering only to suitor who proves worthy by solving riddles",
          "Misinterpretation: 'Can say gái năm mùa (girl of five seasons)' → Correction: Bốn mùa is fixed expression (four seasons = complete cycle), cannot vary number"
        ]
      }
    },

    {
      "expression": "Người ơi",
      "literal": "Person, oh! / Hey, person!",
      "meaning": "Vocative calling formula to capture attention and establish intimate direct address. Common folk song opening.",

      "culturalWeights": {
        "historicalDepth": 7,
        "explanation": "Ancient vocative formula used in Vietnamese folk songs for centuries. 'Ơi' particle is fundamental Vietnamese attention-getting device, documented in earliest folk song collections.",
        "regionalSpecificity": 2,
        "explanation": "Universal across Vietnam - all dialects use 'ơi' particle for calling. 'Người ơi' appears in folk songs from North to South with minimal variation.",
        "symbolicLoad": 4,
        "explanation": "Moderate symbolic weight: establishes intimate connection between singer and addressee. 'Người' (person) creates universal address while 'ơi' adds emotional immediacy.",
        "ritualSignificance": 6,
        "explanation": "Functions as ritual opening for folk song performance - signals that performance is beginning. In courtship context, direct address creates intimate challenge space.",
        "transmissionImportance": 7,
        "explanation": "Critical for teaching Vietnamese vocative system and folk song opening conventions. One of first formulae learned in folk song pedagogy. Essential folk song marker.",
        "emotionalResonance": 5,
        "explanation": "Creates emotional connection through direct address. 'Ơi' particle carries urgency/yearning. Draws audience/suitor into intimate performance space."
      },

      "complexityMetrics": {
        "layersOfMeaning": 2,
        "explanation": "Layer 1: Literal attention-getting ('Hey, person!'). Layer 2: Folk song performance opener creating intimate addressee relationship. Not heavily multi-layered.",
        "crossDomainMapping": 3,
        "explanation": "Minimal metaphorical mapping: VOCATIVE PARTICLE → INTIMACY CREATION. Primarily pragmatic (getting attention) rather than symbolic.",
        "culturalPrerequisites": 3,
        "explanation": "Requires: 1) Vietnamese vocative particle system knowledge ('ơi', 'ôi', 'hỡi'), 2) Folk song opening conventions, 3) Direct address norms. Relatively accessible.",
        "idiomaticity": 8,
        "explanation": "Highly fixed expression. Must use exact form 'Người ơi' - cannot say 'ơi người' (reversed) or substitute other words easily while keeping folk song marker function.",
        "contextDependence": 5,
        "explanation": "Meaning shifts by context: in folk song = performance opener, in daily speech = attention-getter, in courtship = intimate challenge. Moderately context-dependent.",
        "pedagogicalChallenge": 4,
        "explanation": "Moderate difficulty for non-natives: 1) Must learn 'ơi' particle has no English equivalent, 2) Understand vocative function, 3) Recognize as folk song formula, 4) Grasp intimate vs formal address. Easier than riddle wordplay, harder than simple vocabulary."
      },

      "semanticNetwork": {
        "sourceDomain": "ATTENTION-GETTING_SPEECH_ACT",
        "targetDomain": "INTIMATE_PERFORMANCE_SPACE_CREATION",
        "mappings": [
          {
            "source": "người (person) - generic address",
            "target": "universal addressee, could be anyone listening"
          },
          {
            "source": "ơi (vocative particle)",
            "target": "emotional immediacy and urgency"
          },
          {
            "source": "folk song opening formula",
            "target": "signals performance is beginning, audience should attend"
          }
        ],
        "conceptualMetaphor": "SPEECH PARTICLE IS EMOTIONAL CONNECTION; CALLING IS PERFORMANCE INITIATION"
      },

      "usagePatterns": {
        "phrasePosition": "phrase_beginning_absolute",
        "explanation": "Always the opening phrase (phrase 1) in this song. Typical folk song position - opens performance before content begins.",
        "syntacticRole": "vocative_address",
        "explanation": "Functions as direct address, not part of sentence syntax. Stands alone as attention-getter before the riddles begin.",
        "discourseFunction": "performance_opening_and_attention_capture",
        "explanation": "Dual function: 1) Signals song is starting (meta-performance marker), 2) Captures audience/suitor attention for riddle challenge to follow.",
        "participationPattern": "solo_singer_to_audience",
        "explanation": "Sung by female riddler, directed at suitor or general audience. Creates call that expects listening response (not verbal response yet - that comes with riddles).",
        "emotionalValence": "intimate_inviting",
        "explanation": "Warm, inviting tone through 'ơi' particle. Creates emotional connection before the playful challenge. Not aggressive or demanding, gentle invitation."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [1],
        "totalPhrases": 11,
        "coverage": "9.1%",
        "positionDistribution": {
          "beginning": 1,
          "middle": 0,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 1,
        "explanation": "Extremely common formula across Vietnamese folk songs. Appears in countless ca dao (folk poems) and hát (songs). Not unique at all - this is stock opening across genres.",
        "similarExpressions": [
          {
            "expression": "Ai ơi (who, oh!)",
            "similarity": "very high",
            "difference": "Ai ơi is interrogative (who?), người ơi is declarative address (person). Both are folk song openers."
          },
          {
            "expression": "Anh ơi (older brother/male beloved, oh!)",
            "similarity": "very high",
            "difference": "Anh ơi specifies male addressee and romantic relationship, người ơi is generic person"
          },
          {
            "expression": "Em ơi (younger sibling/female beloved, oh!)",
            "similarity": "very high",
            "difference": "Em ơi specifies female addressee, người ơi is gender-neutral"
          }
        ],
        "regionalDistribution": "Nationwide - standard folk song opening across all dialects",
        "genreDistribution": "Folk songs (ca dao), courtship songs, work songs (hò), lullabies (ru), virtually all folk song genres",
        "historicalPersistence": "Ancient to present. Ơi particle is fundamental Vietnamese vocative, likely predates written literature. Still used in contemporary folk song performances."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Deliver 'Người' with clear, open tone - universal invitation to listen",
          "Emphasize 'ơi' with slight rise in pitch and elongation (ơ-i-i) - draws attention emotionally",
          "Make eye contact with audience/suitor on 'ơi' - creates direct connection",
          "Brief pause after 'Người ơi' before beginning riddles - lets opener settle, captures attention",
          "Tone should be warm and inviting, not commanding or aggressive - folk song is friendly",
          "Hand gesture: open palm toward audience on 'ơi' - physical invitation to listen"
        ],
        "culturalSensitivity": [
          "This is standard folk song convention, not informal or disrespectful language",
          "Ơi particle reflects Vietnamese tonal and emotional expressiveness, not grammatical 'extra word'",
          "Direct address ('người') creates intimacy valued in Vietnamese oral tradition",
          "Folk song formulae are cultural heritage, deserve respect as oral literature conventions",
          "Using 'người' (person) rather than name/pronoun allows universal participation - anyone can listen",
          "Contemporary Vietnamese still use 'ơi' in daily speech - this is living language, not archaic"
        ],
        "pedagogicalApproach": [
          "Step 1: Teach Vietnamese vocative particle system - ơi, ôi, hỡi, etc. (no English equivalent)",
          "Step 2: Explain 'người' = person, neutral/generic address vs specific kin terms (anh, em, etc.)",
          "Step 3: Practice pronunciation - 'Người' /ŋɨəj˨˩/ with falling tone, 'ơi' /əːj˧˧/ with rising inflection",
          "Step 4: Compare to English discourse markers ('hey', 'listen', 'oh') but note ơi is more emotional/intimate",
          "Step 5: Identify 'X ơi' pattern in other folk songs students may encounter",
          "Step 6: Have students practice opening folk song performances with 'Người ơi' - feel the attention-getting",
          "Step 7: Discuss cross-cultural vocative systems (Japanese 'yo', Korean 'a/ya') as comparative linguistics"
        ],
        "commonMisinterpretations": [
          "Misinterpretation: 'Ơi is grammatical mistake or extra word' → Correction: Functional vocative particle essential for Vietnamese direct address",
          "Misinterpretation: 'Can say just Người (person) without ơi' → Correction: Removing ơi loses emotional immediacy and folk song formula marker",
          "Misinterpretation: 'Người is rude because it's impersonal' → Correction: Generic address allows universal participation, not rudeness. Intimacy created through ơi particle.",
          "Misinterpretation: 'Can substitute any vocative (Anh ơi, Em ơi) with same effect' → Correction: Người ơi is specific folk song opener, changing to kinship term shifts genre/relationship dynamic"
        ]
      }
    },

    {
      "expression": "nỏ (dialectal particle)",
      "literal": "(no direct meaning - southern Vietnamese discourse particle)",
      "meaning": "Southern dialectal particle functioning as emphasis marker or question softener, characteristic of Mekong Delta speech",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Documented in southern Vietnamese dialects for centuries. Reflects linguistic divergence between northern standard and southern colloquial. Part of Mekong Delta cultural-linguistic identity.",
        "regionalSpecificity": 10,
        "explanation": "Exclusively southern Vietnamese (especially Mekong Delta). Not used in northern or central dialects. Highest regional specificity - immediate marker of southern origin.",
        "symbolicLoad": 3,
        "explanation": "Low symbolic weight - primarily functional particle. But DOES symbolize regional identity and resistance to northern standard language norms.",
        "ritualSignificance": 4,
        "explanation": "Not directly ritual, but using southern particle in folk song performance asserts regional cultural pride. Choice to keep 'nỏ' (not standardize to northern) has cultural-political significance.",
        "transmissionImportance": 8,
        "explanation": "Critical for preserving southern dialectal features in folk songs. Linguistic diversity documentation. Teaching southern Vietnamese varieties and regional identity through language.",
        "emotionalResonance": 5,
        "explanation": "For southern Vietnamese, evokes regional belonging and pride. For northerners, may sound unfamiliar or folksy. Emotional response depends on listener's dialect background."
      },

      "complexityMetrics": {
        "layersOfMeaning": 2,
        "explanation": "Layer 1: Functional discourse particle (emphasis/softening). Layer 2: Regional identity marker. Not heavily multi-layered, primarily pragmatic.",
        "crossDomainMapping": 2,
        "explanation": "Minimal metaphorical mapping. Primarily pragmatic function (discourse management) rather than conceptual metaphor. Some abstract mapping: PARTICLE → REGIONAL IDENTITY.",
        "culturalPrerequisites": 6,
        "explanation": "Requires: 1) Vietnamese dialectal variation knowledge, 2) Southern vs northern linguistic differences, 3) Particle system understanding, 4) Regional cultural identity context, 5) Mekong Delta folk song tradition.",
        "idiomaticity": 7,
        "explanation": "Highly fixed in southern dialect - cannot substitute other particles and maintain southern marker function. Must use exactly 'nỏ' to signal southern Vietnamese speech.",
        "contextDependence": 8,
        "explanation": "Meaning entirely context-dependent: 1) In southern speech = normal particle, 2) In northern speech = would be replaced with standard particles, 3) In folk song = regional identity assertion. High context dependence.",
        "pedagogicalChallenge": 8,
        "explanation": "Very difficult for non-natives AND for northern Vietnamese: 1) No standard Vietnamese equivalent, 2) Pragmatic function hard to teach, 3) Regional variation not covered in textbooks, 4) Subtle emphasis/softening difficult to grasp, 5) Knowing when to use vs omit."
      },

      "semanticNetwork": {
        "sourceDomain": "DISCOURSE_PRAGMATICS",
        "targetDomain": "REGIONAL_LINGUISTIC_IDENTITY",
        "mappings": [
          {
            "source": "discourse particle (emphasis/softening)",
            "target": "pragmatic function in question formation"
          },
          {
            "source": "southern-only usage",
            "target": "regional Mekong Delta identity marker"
          },
          {
            "source": "choice to preserve in folk song",
            "target": "cultural-linguistic pride and authenticity"
          }
        ],
        "conceptualMetaphor": "DIALECT IS IDENTITY; LANGUAGE VARIATION IS CULTURAL DIVERSITY"
      },

      "usagePatterns": {
        "phrasePosition": "phrase_middle",
        "explanation": "Appears in middle of question phrases (5 and 9): 'bắp chi nỏ ai rang', 'bạc chi bán nỏ ai'. Positioned between question word and verb.",
        "syntacticRole": "discourse_particle",
        "explanation": "Functions as pragmatic particle, not core grammatical element. Could be removed without changing propositional meaning, but would lose southern flavor and emphasis.",
        "discourseFunction": "emphasis_and_southern_marker",
        "explanation": "Dual function: 1) Adds emphasis or softens question (pragmatic), 2) Signals southern Vietnamese origin (sociolinguistic marker).",
        "participationPattern": "solo_singer_in_southern_dialect",
        "explanation": "Sung by southern Vietnamese performer, or northern performer adopting southern style. Audience recognizes southern origin through this marker.",
        "emotionalValence": "regional_pride_casual",
        "explanation": "Casual, colloquial tone (not formal). Evokes regional pride for southern speakers, sounds folksy/authentic to others."
      },

      "statistics": {
        "occurrences": 2,
        "phraseIds": [5, 9],
        "totalPhrases": 11,
        "coverage": "18.2%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 2,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 9,
        "explanation": "Very distinctive - immediate marker of southern Vietnamese folk songs. While southern folk songs commonly use 'nỏ', it's rare in standard Vietnamese literature or northern folk songs. High uniqueness as dialectal feature.",
        "similarExpressions": [
          {
            "expression": "vậy (standard particle for emphasis)",
            "similarity": "medium",
            "difference": "vậy is standard Vietnamese, nỏ is southern dialectal. Vậy more formal, nỏ more colloquial."
          },
          {
            "expression": "hả (northern question particle)",
            "similarity": "medium",
            "difference": "hả is northern/central dialectal question softener, nỏ is southern. Regional opposites."
          },
          {
            "expression": "Southern 'dô' particle (also Mekong)",
            "similarity": "high",
            "difference": "Both are southern particles, but different functions - dô is imperative softener, nỏ is emphasis/question marker"
          }
        ],
        "regionalDistribution": "Southern Vietnam only - Mekong Delta, Saigon area, southern provinces. Not northern or central.",
        "genreDistribution": "Southern folk songs (hò, ví, dặm), southern ca dao (folk poems), colloquial southern speech",
        "historicalPersistence": "Centuries-old in southern dialects, still actively used in contemporary southern Vietnamese speech. Not archaic, living linguistic feature."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce 'nỏ' with southern tone /nɔ̆˦˥/ - slightly different from northern tone system",
          "Keep 'nỏ' light and casual - it's colloquial particle, not heavy emphasis",
          "Southern performers: use naturally as part of dialect. Northern performers: practice southern pronunciation specifically for this particle.",
          "Don't over-emphasize 'nỏ' - it should blend into question flow, not stand out awkwardly",
          "If performing for northern audience, briefly note this is southern dialect marker (avoid confusion)",
          "Body language: relaxed, casual posture when using southern particles - reflects colloquial tone"
        ],
        "culturalSensitivity": [
          "Southern dialectal features are valid linguistic forms, not 'incorrect Vietnamese'",
          "Language variation is cultural richness, not error or inferiority",
          "Historical context: southern dialects developed separately, not 'corrupted' from northern standard",
          "Using 'nỏ' in folk song preserves authentic regional tradition - standardizing to northern would erase cultural identity",
          "Southern Vietnamese have pride in dialectal features - respect this as part of regional identity",
          "Avoid framing as 'non-standard' implying deficiency - better: 'regional variety' or 'southern feature'"
        ],
        "pedagogicalApproach": [
          "Step 1: Explain Vietnamese has major dialect groups - northern, central, southern with distinct features",
          "Step 2: Introduce 'nỏ' as southern-specific discourse particle with emphasis/softening function",
          "Step 3: Compare to northern/standard particles (vậy, hả) to show regional variation",
          "Step 4: Practice pronunciation - southern tone system slightly different from northern",
          "Step 5: Discuss sociolinguistics - why preserve dialect in folk songs? (authenticity, identity)",
          "Step 6: If possible, have southern Vietnamese speaker demonstrate natural 'nỏ' usage in speech",
          "Step 7: Analyze power dynamics - northern Vietnamese is 'standard', how does this affect southern speakers?",
          "Step 8: Compare to other languages' regional particles (English 'y'all', 'innit', etc.)"
        ],
        "commonMisinterpretations": [
          "Misinterpretation: 'Nỏ is grammatical error or slang' → Correction: Valid southern dialectal feature, part of systematic southern Vietnamese grammar",
          "Misinterpretation: 'Should be replaced with standard Vietnamese particle' → Correction: Preserving 'nỏ' maintains authentic southern folk song tradition and regional identity",
          "Misinterpretation: 'Nỏ has concrete meaning (like a noun/verb)' → Correction: Discourse particle with pragmatic function (emphasis/softening), no lexical meaning",
          "Misinterpretation: 'All Vietnamese dialects use nỏ' → Correction: Exclusively southern - northern/central Vietnamese would not use this particle",
          "Misinterpretation: 'Can omit nỏ without changing anything' → Correction: Removing it loses southern regional identity marker and changes pragmatic emphasis"
        ]
      }
    }
  ],

  "aggregateStatistics": {
    "totalExpressions": 6,
    "uniqueExpressions": 6,
    "totalOccurrences": 23,
    "phrasesCovered": 11,
    "phraseCoverage": "100%",
    "averageCulturalWeight": 6.08,
    "averageComplexity": 5.58,
    "dominantMechanism": "Homophone wordplay and riddle structure",
    "culturalRichness": "high",
    "richnesssExplanation": "Rich riddle song with linguistic wordplay (homophones), reduplication patterns (trăm thứ, nam nhi), metaphorical language (gái bốn mùa), classical literary elements (nam nhi), southern dialectal features (nỏ), and folk song conventions (người ơi). Represents multiple layers of Vietnamese linguistic tradition."
  },

  "collectionContext": {
    "genreClassification": "Riddle song (hát cuộc) / Courtship song (ca dao tình yêu)",
    "culturalSignificance": "Represents Vietnamese courtship tradition where intellectual wit (solving riddles) determines marriage worthiness. Showcases Vietnamese homophone-based wordplay relying on tonal system. Preserves southern dialectal features (nỏ particle). Documents traditional gender dynamics and marriage negotiation through riddle contests.",
    "linguisticProfile": "Southern Vietnamese dialect (Mekong Delta region) marked by 'nỏ' particle. Uses both folk vocabulary and classical Hán Việt compounds (nam nhi). Demonstrates Vietnamese reduplication patterns (trăm thứ, nam nhi). Heavy use of homophone riddles showing tonal sophistication.",
    "performanceContext": "Traditionally performed during festivals, courtship gatherings, or informal social events. Female singer poses riddles to male suitor(s). Audience may participate by attempting to answer riddles. Interactive call-and-response structure. Contemporary performances occur at cultural events, folk song competitions, and educational demonstrations.",
    "pedagogicalValue": "Excellent for teaching: 1) Vietnamese tonal system through homophone wordplay, 2) Reduplication patterns (partial reduplication), 3) Dialectal variation (southern vs northern), 4) Folk song genre conventions (vocative openers, riddle structures), 5) Classical vs colloquial register (nam nhi vs trai), 6) Metaphorical language (seasonal metaphors), 7) Traditional cultural values (intelligence as marriage criterion), 8) Interactive performance pedagogy (call-response)."
  }
}
