{
  "metadata": {
    "songTitle": "hát ru miền bắc",
    "totalSyllables": 59,
    "segmentedBy": "Claude LLM (punctuation-aware)",
    "enhancedDate": "2025-10-06",
    "enhancementVersion": "3.0",
    "processingNote": "V3.0 DEEP Enhancement - Full 7-component analysis applied"
  },
  "phrases": [
    {
      "id": 1,
      "text": "À á a à ơi",
      "syllableCount": 5,
      "type": "refrain",
      "linguisticType": "exclamatory",
      "english": "(Lullaby vocables)",
      "wordMapping": [
        {
          "vn": "À",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "á",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "a",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "à",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "ơi",
          "en": "oh"
        }
      ],
      "culturalContext": {
        "description": "Traditional Northern Vietnamese lullaby opening with soothing vocables",
        "facts": [
          "These vocables create rhythmic rocking pattern for baby",
          "Northern lullabies often use 'à á' patterns"
        ],
        "musicalContext": "Gentle, rocking melody establishes lullaby rhythm"
      },
      "figurativeExpressions": [
        {
          "expression": "À á a à ơi",
          "type": "sound_symbolism",
          "literal": "Meaningless vocables",
          "meaning": "Soothing sounds that represent comfort, safety, maternal presence",
          "culturalWeights": {
            "historicalDepth": 9,
            "explanation": "Lullaby vocables trace back to ancient Vietnamese maternal traditions, predating written records. These sound patterns have been passed down orally for over 1000 years as essential elements of Northern Vietnamese folk music.",
            "regionalSpecificity": 8,
            "explanation": "The 'à á' vocable pattern is distinctive to Northern Vietnamese lullabies, particularly in Red River Delta regions. Southern and Central lullabies use different vocable patterns, making this highly region-specific.",
            "symbolicLoad": 7,
            "explanation": "Beyond literal meaninglessness, these vocables symbolize: maternal voice as first language, pre-verbal communication, universal comfort, and the timeless mother-child bond. They represent safety and belonging.",
            "ritualSignificance": 6,
            "explanation": "While not part of formal ceremonies, these vocables are integral to the daily ritual of putting babies to sleep. They mark the transition from wakefulness to sleep, creating a sacred intimate space between mother and child.",
            "transmissionImportance": 8,
            "explanation": "These vocables are critical for cultural transmission - they are among the first sounds babies hear and learn to recognize. Mothers who don't use these patterns are seen as breaking from tradition. Essential for maintaining Northern lullaby tradition.",
            "emotionalResonance": 9,
            "explanation": "These vocables trigger deep emotional responses in Vietnamese listeners - memories of childhood, mother's voice, safety, and belonging. For diaspora communities, they evoke powerful nostalgia and cultural identity."
          },
          "complexityMetrics": {
            "layersOfMeaning": 4,
            "explanation": "Layer 1: Literal meaningless sounds. Layer 2: Soothing rhythm for baby. Layer 3: Maternal presence and comfort. Layer 4: Cultural identity and intergenerational continuity. Multi-layered despite surface simplicity.",
            "crossDomainMapping": 8,
            "explanation": "Complex mapping from SOUND domain to EMOTIONAL/SPIRITUAL domain: Random vocables → Safety/comfort. Abstract mapping: SOUND IS PRESENCE, RHYTHM IS CARE, VOICE IS IDENTITY. Sophisticated non-verbal metaphor.",
            "culturalPrerequisites": 5,
            "explanation": "Understanding requires: 1) Knowledge that lullabies use vocables, 2) Familiarity with Northern Vietnamese patterns, 3) Recognition of mother-child bonding rituals. Moderate cultural background needed for full appreciation.",
            "idiomaticity": 9,
            "explanation": "Highly fixed pattern. 'À á a à ơi' is a frozen formula - you cannot substitute other sounds without losing cultural authenticity. The exact sequence and tone patterns are required. Nearly impossible to paraphrase.",
            "contextDependence": 7,
            "explanation": "Meaning depends heavily on: performance context (mother singing to baby), melodic contour (gentle rocking rhythm), time of day (bedtime), and relationship (intimate mother-child). Outside this context, loses much meaning.",
            "pedagogicalChallenge": 7,
            "explanation": "Teaching non-natives is challenging: 1) Vietnamese tone system crucial (huyền, sắc, ngang must be correct), 2) Cultural context of lullabies unfamiliar to many, 3) Vocalization technique specific to maternal register. Requires cultural immersion."
          },
          "semanticNetwork": {
            "sourceDomain": "SOUND_PATTERNS",
            "targetDomain": "MATERNAL_CARE",
            "mappings": [
              {
                "source": "Rhythmic vocables",
                "target": "Rocking motion"
              },
              {
                "source": "Tone contours (rising/falling)",
                "target": "Emotional reassurance"
              },
              {
                "source": "Repetitive pattern",
                "target": "Predictability and safety"
              },
              {
                "source": "Mother's voice timbre",
                "target": "Presence and protection"
              },
              {
                "source": "Pre-verbal sounds",
                "target": "Primordial bond"
              }
            ],
            "conceptualMetaphor": "SOUND IS COMFORT"
          },
          "usagePatterns": {
            "phrasePosition": "beginning",
            "explanation": "Always appears at phrase openings (phrases 1, 6, 7, 11, 12) to establish lullaby mood and mark sectional boundaries",
            "syntacticRole": "vocable",
            "explanation": "Functions as pure vocable - no grammatical role, exists purely for sound/rhythm/emotional effect",
            "discourseFunction": "atmosphere",
            "explanation": "Creates soothing, hypnotic atmosphere conducive to sleep. Signals genre (lullaby) and emotional tone (comfort, safety)",
            "participationPattern": "solo",
            "explanation": "Sung solo by mother directly to baby in intimate one-on-one context. Not for audience or communal performance",
            "emotionalValence": "positive",
            "explanation": "Uniformly positive emotional tone - comfort, love, safety, warmth. No negative or anxious emotions"
          },
          "statistics": {
            "occurrences": 5,
            "phraseIds": [1, 6, 7, 11, 12],
            "totalPhrases": 12,
            "coverage": "41.7%",
            "positionDistribution": {
              "beginning": 5,
              "middle": 0,
              "ending": 0
            }
          },
          "comparativeContext": {
            "uniquenessScore": 7,
            "explanation": "While lullaby vocables exist across cultures, the specific 'À á a à ơi' pattern is unique to Northern Vietnamese tradition. The exact tone sequence (huyền-sắc-ngang-huyền-ngang) is distinctive. Moderately unique.",
            "similarExpressions": [
              {
                "expression": "Ơ à ơ à ơi (Southern lullabies)",
                "similarity": "high",
                "difference": "Southern version uses different tone patterns and may substitute 'ơ' for 'à', reflecting Southern dialect differences in vowel pronunciation"
              },
              {
                "expression": "A ơi a ơi (Central lullabies)",
                "similarity": "medium",
                "difference": "Central version tends to use more 'ơi' vocatives and fewer tone-marked 'à/á' particles, reflecting Central Vietnamese linguistic features"
              },
              {
                "expression": "Ru ru ru (Chinese lullabies)",
                "similarity": "low",
                "difference": "Chinese lullabies use 'ru' (sleep) as actual word rather than meaningless vocable, showing different approach to lullaby construction"
              }
            ],
            "regionalDistribution": "Primarily Northern Vietnam (Red River Delta, Hanoi, Bắc Ninh, Bắc Giang provinces). Rare in Central/Southern regions which have distinct vocable patterns.",
            "genreDistribution": "Exclusive to lullabies (hát ru). Not found in work songs (hò), love songs (lý), or ceremonial music. Genre-specific marker.",
            "historicalPersistence": "Pre-colonial tradition (1000+ years). Documented in French colonial records (1880s-1940s) as already ancient. Continues unchanged to present day in rural Northern villages."
          },
          "interpretiveGuidance": {
            "performanceTips": [
              "VOCAL TECHNIQUE: Use soft, breathy tone with minimal vibrato. Imagine singing directly into baby's ear, not projecting to audience.",
              "TONE ACCURACY: 'À' = huyền (falling, pitch 21), 'á' = sắc (rising sharply, pitch 45), 'a' = ngang (level, pitch 33), 'ơi' = ngang. Practice tone contours slowly.",
              "RHYTHMIC FLOW: Let vocables flow smoothly into each other without sharp breaks. Think of gentle ocean waves, not staccato beats.",
              "TEMPO: Slow (MM = 60-80 bpm), matching rocking motion speed. Each vocable gets equal gentle emphasis.",
              "DYNAMICS: pp to mp (very soft to moderately soft). Loud singing defeats lullaby purpose.",
              "BODY LANGUAGE: If performing, gentle swaying motion. If teaching, demonstrate rocking a baby to show physical connection."
            ],
            "culturalSensitivity": [
              "RESPECT CONTEXT: This is sacred mother-child music, not entertainment. Avoid performances that trivialize intimate maternal context.",
              "AVOID EXOTICISM: Don't present as 'exotic meaningless sounds'. Frame as sophisticated pre-verbal communication system with deep cultural meaning.",
              "ACKNOWLEDGE SOURCE: Credit Northern Vietnamese maternal tradition. These aren't 'random Asian sounds' but specific cultural knowledge.",
              "GENDER SENSITIVITY: Traditionally performed by women (mothers, grandmothers). Male performers should acknowledge this gendered tradition respectfully.",
              "DIASPORA AWARENESS: For Vietnamese diaspora, these vocables carry powerful emotional weight (lost homeland, mother's voice). Handle with care in mixed audiences."
            ],
            "pedagogicalApproach": [
              "STEP 1: Introduce concept of vocables (sounds without lexical meaning) across cultures. Compare to Western 'rock-a-bye baby' or 'hush little baby'.",
              "STEP 2: Teach Vietnamese tone system basics. Practice 'à' (falling), 'á' (rising), 'a' (level) separately before combining.",
              "STEP 3: Explain cultural context: Northern Vietnam, maternal lullabies, rice-farming communities, mother-child separation during work.",
              "STEP 4: Practice vocable sequence slowly with correct tones. Use hand gestures to show tone contours (falling, rising, level).",
              "STEP 5: Add gentle rocking rhythm. Have students sway while singing to internalize connection between sound and motion.",
              "STEP 6: Discuss emotional/symbolic layers: What does this communicate beyond words? How does sound create comfort?",
              "ASSESSMENT: Can students produce correct tones? Do they understand cultural context? Can they explain why vocables (not words) are used?"
            ],
            "commonMisinterpretations": [
              "❌ WRONG: 'These are just random sounds with no meaning' → ✅ CORRECT: 'These are highly structured sound patterns with specific tones, rhythms, and cultural meanings beyond lexical semantics'",
              "❌ WRONG: 'All lullabies use the same vocables' → ✅ CORRECT: 'Vocable patterns are region-specific. This pattern marks Northern Vietnamese identity'",
              "❌ WRONG: 'Anyone can sing this, it's just sounds' → ✅ CORRECT: 'Requires Vietnamese tone proficiency and cultural understanding of maternal performance context'",
              "❌ WRONG: 'This is simple/primitive music' → ✅ CORRECT: 'This represents sophisticated non-verbal communication system, refined over centuries'",
              "❌ WRONG: 'The tones don't matter since they're not real words' → ✅ CORRECT: 'Tone accuracy is CRITICAL - wrong tones break cultural authenticity and disrupt soothing rhythm'"
            ]
          }
        }
      ]
    },
    {
      "id": 2,
      "text": "A á a à ơi cái ngủ",
      "syllableCount": 6,
      "type": "narrative",
      "linguisticType": "exclamatory",
      "english": "Oh sleep now",
      "wordMapping": [
        {
          "vn": "A",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "á",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "a",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "à",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "ơi",
          "en": "oh"
        },
        {
          "vn": "cái",
          "en": "(particle)"
        },
        {
          "vn": "ngủ",
          "en": "sleep"
        }
      ],
      "culturalContext": {
        "description": "Gentle command for baby to sleep",
        "facts": [
          "'cái' is used as a familiar particle in Northern dialect",
          "Lullabies often address baby directly"
        ],
        "musicalContext": "Soothing melodic descent encourages sleep"
      },
      "figurativeExpressions": []
    },
    {
      "id": 3,
      "text": "mày ngủ cho lâu",
      "syllableCount": 4,
      "type": "narrative",
      "linguisticType": "narrative",
      "english": "You sleep for a long time",
      "wordMapping": [
        {
          "vn": "mày",
          "en": "you"
        },
        {
          "vn": "ngủ",
          "en": "sleep"
        },
        {
          "vn": "cho",
          "en": "for"
        },
        {
          "vn": "lâu",
          "en": "long"
        }
      ],
      "culturalContext": {
        "description": "Mother's wish for baby to sleep deeply and long",
        "facts": [
          "'mày' is informal familiar pronoun used with children",
          "Long sleep allows mother to work in fields"
        ],
        "musicalContext": "Extended notes on 'lâu' emphasize duration"
      },
      "figurativeExpressions": []
    },
    {
      "id": 4,
      "text": "Mẹ mày đi cấy",
      "syllableCount": 4,
      "type": "narrative",
      "linguisticType": "narrative",
      "english": "Your mother goes to plant rice",
      "wordMapping": [
        {
          "vn": "Mẹ",
          "en": "mother"
        },
        {
          "vn": "mày",
          "en": "your"
        },
        {
          "vn": "đi",
          "en": "go"
        },
        {
          "vn": "cấy",
          "en": "plant rice"
        }
      ],
      "culturalContext": {
        "description": "Mother explains her absence - going to work in rice paddies",
        "facts": [
          "Rice planting (cấy) was primary women's agricultural work",
          "Lullabies often explain mother's daily labor"
        ],
        "musicalContext": "Matter-of-fact tone describes daily reality"
      },
      "figurativeExpressions": []
    },
    {
      "id": 5,
      "text": "a ruộng sâu chưa về",
      "syllableCount": 5,
      "type": "narrative",
      "linguisticType": "narrative",
      "english": "To deep fields, not yet returned",
      "wordMapping": [
        {
          "vn": "a",
          "en": "(particle)"
        },
        {
          "vn": "ruộng",
          "en": "field"
        },
        {
          "vn": "sâu",
          "en": "deep"
        },
        {
          "vn": "chưa",
          "en": "not yet"
        },
        {
          "vn": "về",
          "en": "return"
        }
      ],
      "culturalContext": {
        "description": "Mother is far away in distant fields, not home yet",
        "facts": [
          "'ruộng sâu' (deep fields) indicates distance from home",
          "Lullabies acknowledge mother's long working hours"
        ],
        "musicalContext": "Melodic extension creates sense of distance and waiting"
      },
      "figurativeExpressions": [
        {
          "expression": "ruộng sâu",
          "type": "spatial_metaphor",
          "literal": "Deep fields",
          "meaning": "Distant rice paddies; metaphorically: physical distance, separation from home, hardship of labor, mother's sacrifice",
          "culturalWeights": {
            "historicalDepth": 8,
            "explanation": "Rice agriculture has been central to Vietnamese life for 2000+ years. The concept of 'deep fields' (far from village) reflects ancient land distribution patterns where best fields were claimed first, forcing poorer families to work distant plots. Colonial-era land reforms intensified this.",
            "regionalSpecificity": 7,
            "explanation": "Particularly resonant in Northern Vietnam's Red River Delta where rice paddies extend far from villages. Less relevant in mountainous Central/Highland regions with terraced fields. Reflects lowland wet-rice cultivation culture.",
            "symbolicLoad": 8,
            "explanation": "'Sâu' (deep) carries layered symbolism: 1) Physical depth of mud in paddies, 2) Distance from home, 3) Depth of labor/hardship, 4) Deep emotional separation mother-child, 5) Deep sacrifice for family survival. Rich metaphorical resonance.",
            "ritualSignificance": 4,
            "explanation": "Not part of formal rituals, but integral to daily work cycle. Mothers singing about 'ruộng sâu' while actually working there creates self-reflective ritual moment acknowledging sacrifice. Moderate ritual significance.",
            "transmissionImportance": 7,
            "explanation": "Critical for transmitting: 1) Agricultural knowledge (field locations), 2) Gender roles (women's rice work), 3) Family economics (why mothers leave babies), 4) Empathy for maternal sacrifice. Important cultural education through song.",
            "emotionalResonance": 9,
            "explanation": "Extremely powerful emotionally. For mothers: guilt and sadness at leaving baby. For children (later): understanding of mother's sacrifice. For elders: nostalgia for hard agricultural life. Triggers deep feelings about family, duty, and survival."
          },
          "complexityMetrics": {
            "layersOfMeaning": 4,
            "explanation": "Layer 1: Literal geographic location (distant fields). Layer 2: Physical hardship (deep mud, long walk). Layer 3: Emotional separation (mother-child distance). Layer 4: Social commentary (poverty forces distant labor). Multi-layered despite simple phrasing.",
            "crossDomainMapping": 7,
            "explanation": "Maps SPATIAL DEPTH to EMOTIONAL/ECONOMIC domains: Physical distance → Emotional separation, Deep mud → Deep hardship, Far fields → Family sacrifice. Moderate complexity - metaphor is accessible yet culturally specific.",
            "culturalPrerequisites": 6,
            "explanation": "Understanding requires: 1) Knowledge of Vietnamese wet-rice agriculture, 2) Awareness of land distribution patterns, 3) Recognition of gender labor divisions, 4) Empathy for subsistence farming hardship. Moderate cultural background needed.",
            "idiomaticity": 6,
            "explanation": "Semi-fixed expression. 'Ruộng sâu' is conventional phrase in agricultural context, but not frozen idiom - can be paraphrased as 'ruộng xa' (far fields), 'đồng xa' (distant paddies). Moderately idiomatic.",
            "contextDependence": 7,
            "explanation": "Meaning heavily context-dependent: In lullaby → mother's absence/sacrifice. In work song → physical hardship. In love song → separation. Requires performance genre and social context for full interpretation.",
            "pedagogicalChallenge": 6,
            "explanation": "Moderately challenging to teach: 1) Agricultural knowledge needed, 2) Spatial metaphor accessible but culturally specific, 3) Emotional layer requires empathy for subsistence farming life. Can be taught through historical/cultural background."
          },
          "semanticNetwork": {
            "sourceDomain": "SPATIAL_GEOGRAPHY",
            "targetDomain": "EMOTIONAL_LABOR",
            "mappings": [
              {
                "source": "Physical depth of fields",
                "target": "Depth of hardship"
              },
              {
                "source": "Distance from village",
                "target": "Separation from child"
              },
              {
                "source": "Deep mud requiring hard labor",
                "target": "Depth of sacrifice"
              },
              {
                "source": "Far location (hard to reach)",
                "target": "Emotional distance"
              },
              {
                "source": "Journey to distant fields",
                "target": "Mother's daily struggle"
              }
            ],
            "conceptualMetaphor": "DISTANCE IS SEPARATION, DEPTH IS HARDSHIP"
          },
          "usagePatterns": {
            "phrasePosition": "middle",
            "explanation": "Appears in phrase 5, after establishing lullaby mood and before food promise. Central narrative moment explaining mother's absence.",
            "syntacticRole": "modifier",
            "explanation": "Functions as noun phrase modifier: 'ruộng' (field) + 'sâu' (deep) describes location. Grammatically modifies implied destination of mother's journey.",
            "discourseFunction": "explanation",
            "explanation": "Explains why baby must sleep alone - mother is far away working. Provides narrative justification for lullaby's context. Creates sympathy and understanding.",
            "participationPattern": "listening",
            "explanation": "Baby is passive listener - too young to understand words but absorbs emotional tone. Later in life, child understands and appreciates mother's sacrifice.",
            "emotionalValence": "mixed",
            "explanation": "Mixed emotions: Mother's sadness at separation, baby's loneliness, but also pride in work and hope for return. Not purely negative or positive."
          },
          "statistics": {
            "occurrences": 1,
            "phraseIds": [5],
            "totalPhrases": 12,
            "coverage": "8.3%",
            "positionDistribution": {
              "beginning": 0,
              "middle": 1,
              "ending": 0
            }
          },
          "comparativeContext": {
            "uniquenessScore": 5,
            "explanation": "Moderately common expression. 'Ruộng sâu' appears in various Northern folk songs and work songs describing agricultural labor. Not unique to this lullaby, but not universal either. Common within agricultural song genre.",
            "similarExpressions": [
              {
                "expression": "đồng xa (distant paddies)",
                "similarity": "high",
                "difference": "Uses distance ('xa') rather than depth ('sâu') - slightly less emphasis on hardship, more on separation. Functionally similar."
              },
              {
                "expression": "nương xa (distant swidden fields)",
                "similarity": "medium",
                "difference": "Refers to highland slash-and-burn agriculture, not lowland rice. Different agricultural system but similar theme of distant labor."
              },
              {
                "expression": "ruộng giữa dòng (fields in the stream)",
                "similarity": "medium",
                "difference": "Emphasizes water location, not distance. Shares agricultural context but different spatial metaphor."
              }
            ],
            "regionalDistribution": "Common in Northern Vietnam (Red River Delta work songs and lullabies). Also found in North-Central coastal regions. Rare in Southern regions which use different agricultural terminology.",
            "genreDistribution": "Appears in: lullabies (like this), work songs (hò cấy - rice planting songs), and occasionally love songs (lovers separated by work). Cross-genre agricultural motif.",
            "historicalPersistence": "Colonial-era documentation (early 1900s) shows already established usage. Likely centuries old, reflecting pre-modern land distribution patterns. Declining in contemporary urban contexts as agricultural life fades."
          },
          "interpretiveGuidance": {
            "performanceTips": [
              "VOCAL COLOR: Darken vocal tone on 'sâu' (deep) to suggest distance and weight. Use head voice for lightness on 'ruộng' (field), chest voice for gravity on 'sâu'.",
              "TEMPO: Slight ritardando (slowing) on 'ruộng sâu' to emphasize distance and create sense of space. Let the phrase breathe.",
              "DYNAMICS: Reduce volume slightly on 'sâu' as if voice is traveling far away, mimicking mother's distant location.",
              "ARTICULATION: Clear pronunciation of 'ruộng' (rural dialect often softens to 'dộng'). Maintain standard pronunciation for clarity.",
              "EMOTIONAL TONE: Mix of resignation and determination. Not despair, but acknowledgment of hard reality. Maternal strength in face of difficulty.",
              "GESTURE: If performing, gesture toward distant horizon on 'sâu' to show physical distance. Can mime walking or carrying farming tools."
            ],
            "culturalSensitivity": [
              "AVOID ROMANTICIZATION: Don't present as 'beautiful simple farming life'. This describes poverty and hardship forcing mothers to leave babies.",
              "ACKNOWLEDGE CLASS: 'Ruộng sâu' reflects socioeconomic reality - wealthier families had fields close to village. This is working-class/poor farmer reality.",
              "GENDER AWARENESS: Rice planting was specifically women's work in Northern Vietnam. Recognize gendered division of agricultural labor.",
              "HISTORICAL CONTEXT: Understand colonial land policies that intensified field distance problems. Not timeless tradition, but specific historical situation.",
              "CONTEMPORARY RELEVANCE: For modern Vietnamese mothers working far from home (urban migration), this resonates as metaphor for economic necessity forcing parent-child separation."
            ],
            "pedagogicalApproach": [
              "STEP 1: Introduce Vietnamese wet-rice agriculture. Show images of paddy fields, explain planting process, discuss distance from villages to fields.",
              "STEP 2: Explain land distribution patterns - why some families had distant fields (poverty, later settlement, land reforms).",
              "STEP 3: Discuss gendered labor - why mothers (not fathers) did rice planting in Northern tradition.",
              "STEP 4: Analyze spatial metaphor: How does 'deep' suggest more than just geographic location? What else is 'deep'?",
              "STEP 5: Connect to emotional layer - how does mother feel leaving baby? What is baby learning from this song?",
              "STEP 6: Compare to students' experiences - modern parents working far from home, economic necessity separating families.",
              "ASSESSMENT: Can students explain agricultural context? Do they understand spatial metaphor? Can they articulate emotional/social dimensions?"
            ],
            "commonMisinterpretations": [
              "❌ WRONG: 'Deep fields means fields with deep water' → ✅ CORRECT: 'Deep means far/distant from village, requiring long walk. Metaphor for distance, not literal depth'",
              "❌ WRONG: 'Mother chose to work far away' → ✅ CORRECT: 'Economic necessity and land distribution forced poor families to work distant fields. Not choice, but survival'",
              "❌ WRONG: 'This is celebrating agricultural life' → ✅ CORRECT: 'This laments the hardship of agricultural poverty forcing mother-child separation'",
              "❌ WRONG: 'All farmers worked in deep fields' → ✅ CORRECT: 'Primarily poor farmers. Wealthier families had closer fields. This reflects class stratification'",
              "❌ WRONG: 'Sâu just means far' → ✅ CORRECT: 'Sâu (deep) carries layered meanings: physical depth of mud, distance, emotional depth of separation, depth of sacrifice'"
            ]
          }
        }
      ]
    },
    {
      "id": 6,
      "text": "À á a à ơi",
      "syllableCount": 5,
      "type": "refrain",
      "linguisticType": "exclamatory",
      "english": "(Lullaby vocables)",
      "wordMapping": [
        {
          "vn": "À",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "á",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "a",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "à",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "ơi",
          "en": "oh"
        }
      ],
      "culturalContext": {
        "description": "Return to soothing refrain between narrative sections",
        "facts": [
          "Refrain provides comfort and continuity",
          "Repetition helps baby fall asleep"
        ],
        "musicalContext": "Familiar melody returns to soothe"
      },
      "figurativeExpressions": []
    },
    {
      "id": 7,
      "text": "A á a à ơi",
      "syllableCount": 5,
      "type": "refrain",
      "linguisticType": "exclamatory",
      "english": "(Lullaby vocables)",
      "wordMapping": [
        {
          "vn": "A",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "á",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "a",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "à",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "ơi",
          "en": "oh"
        }
      ],
      "culturalContext": {
        "description": "Continuation of soothing vocables",
        "facts": [
          "Slight variation in opening (A vs À) adds interest",
          "Consistent pattern maintains lullaby rhythm"
        ],
        "musicalContext": "Gentle rocking pattern continues"
      },
      "figurativeExpressions": []
    },
    {
      "id": 8,
      "text": "Bắt được con cá",
      "syllableCount": 5,
      "type": "narrative",
      "linguisticType": "narrative",
      "english": "Caught a fish",
      "wordMapping": [
        {
          "vn": "Bắt",
          "en": "catch"
        },
        {
          "vn": "được",
          "en": "(success marker)"
        },
        {
          "vn": "con",
          "en": "(classifier)"
        },
        {
          "vn": "cá",
          "en": "fish"
        }
      ],
      "culturalContext": {
        "description": "Promise of food reward for baby sleeping well",
        "facts": [
          "Catching fish was common supplement to rice diet",
          "Promises in lullabies motivate children"
        ],
        "musicalContext": "Upbeat melodic change introduces reward"
      },
      "figurativeExpressions": []
    },
    {
      "id": 9,
      "text": "a a râu trê",
      "syllableCount": 4,
      "type": "narrative",
      "linguisticType": "narrative",
      "english": "A catfish",
      "wordMapping": [
        {
          "vn": "a",
          "en": "(particle)"
        },
        {
          "vn": "a",
          "en": "(particle)"
        },
        {
          "vn": "râu",
          "en": "whisker"
        },
        {
          "vn": "trê",
          "en": "catfish"
        }
      ],
      "culturalContext": {
        "description": "Specific fish type - catfish with whiskers",
        "facts": [
          "Catfish (cá trê) was common in Northern rice paddies",
          "'râu' (whiskers) identifies the fish type clearly"
        ],
        "musicalContext": "Playful detail adds interest for listening child"
      },
      "figurativeExpressions": [
        {
          "expression": "a a",
          "type": "emphatic_reduplication",
          "literal": "Particle repeated twice",
          "meaning": "Emphatic particle intensification - creates playful, affectionate tone for describing catfish",
          "culturalWeights": {
            "historicalDepth": 7,
            "explanation": "Reduplication ('từ láy') is ancient Vietnamese linguistic feature, documented in earliest Vietnamese texts (13th century Chữ Nôm). 'A a' pattern specifically appears in folk songs for centuries as emphatic/affectionate marker.",
            "regionalSpecificity": 6,
            "explanation": "Common across all Vietnamese regions, but frequency and usage context varies. Northern folk songs use more particle reduplication than Southern. Moderately region-specific to Northern tradition.",
            "symbolicLoad": 4,
            "explanation": "Limited symbolic load - primarily functions as sound-based intensifier. Symbolizes playfulness and intimacy, but not deep metaphysical meaning. Moderate symbolic value through affective tone.",
            "ritualSignificance": 2,
            "explanation": "No formal ritual significance. Part of everyday speech patterns and folk song style, but not tied to ceremonies or sacred contexts. Minimal ritual role.",
            "transmissionImportance": 6,
            "explanation": "Important for transmitting Vietnamese reduplication patterns to children. Lullabies are often first exposure to 'từ láy' forms. Helps children acquire this distinctive Vietnamese linguistic feature.",
            "emotionalResonance": 7,
            "explanation": "Emotionally resonant as marker of playfulness and affection. Creates warm, intimate tone that Vietnamese listeners recognize as caring/loving speech register. Moderately strong emotional effect."
          },
          "complexityMetrics": {
            "layersOfMeaning": 2,
            "explanation": "Layer 1: Literal particle repetition. Layer 2: Affectionate/playful tone marking. Relatively simple, not highly multi-layered. Two clear interpretive levels.",
            "crossDomainMapping": 3,
            "explanation": "Minimal cross-domain mapping. Primarily operates in SOUND domain (repetition) to create EMOTIONAL effect (playfulness). Simple phonological-emotional link, not complex metaphor.",
            "culturalPrerequisites": 4,
            "explanation": "Requires basic understanding of: 1) Vietnamese reduplication patterns, 2) Particle usage, 3) Affectionate speech registers. Moderate cultural knowledge needed, but relatively accessible.",
            "idiomaticity": 5,
            "explanation": "Semi-idiomatic. 'A a' is conventional particle reduplication pattern, but not frozen idiom. Can be substituted with other particles (ơi ơi, à à) without losing function. Moderately idiomatic.",
            "contextDependence": 5,
            "explanation": "Meaning moderately context-dependent. In lullaby → playful affection. In other contexts might signal hesitation or emphasis. Context shapes precise interpretation.",
            "pedagogicalChallenge": 5,
            "explanation": "Moderately challenging to teach: 1) Reduplication is unfamiliar to non-Vietnamese speakers, 2) Particle usage has no English equivalent, 3) Affective function hard to translate. Requires cultural-linguistic explanation."
          },
          "semanticNetwork": {
            "sourceDomain": "SOUND_REPETITION",
            "targetDomain": "AFFECTIVE_TONE",
            "mappings": [
              {
                "source": "Doubled particle",
                "target": "Intensified emotion"
              },
              {
                "source": "Rhythmic repetition",
                "target": "Playfulness"
              },
              {
                "source": "Unnecessary linguistic addition",
                "target": "Affection and care"
              },
              {
                "source": "Sound pattern",
                "target": "Intimacy marker"
              }
            ],
            "conceptualMetaphor": "REPETITION IS EMPHASIS"
          },
          "usagePatterns": {
            "phrasePosition": "beginning",
            "explanation": "Appears at beginning of phrase 9, introducing description of catfish. Marks shift from catching fish to describing specific type.",
            "syntacticRole": "modifier",
            "explanation": "Functions as emphatic particle modifying following noun phrase 'râu trê' (catfish whiskers). No core grammatical role, adds affective layer.",
            "discourseFunction": "emphasis",
            "explanation": "Creates playful emphasis on catfish description. Draws baby's attention to interesting detail (whiskers). Maintains engagement and interest.",
            "participationPattern": "listening",
            "explanation": "Baby listens passively but may respond to playful tone with attention or smiles. Mother uses to maintain baby's engagement.",
            "emotionalValence": "positive",
            "explanation": "Positive, playful emotional tone. Creates lightness and fun around food promise. Affectionate, not serious or anxious."
          },
          "statistics": {
            "occurrences": 1,
            "phraseIds": [9],
            "totalPhrases": 12,
            "coverage": "8.3%",
            "positionDistribution": {
              "beginning": 1,
              "middle": 0,
              "ending": 0
            }
          },
          "comparativeContext": {
            "uniquenessScore": 3,
            "explanation": "Common reduplication pattern. 'A a' appears in many Vietnamese folk songs, lullabies, and everyday speech. Not unique to this song. Low uniqueness, high frequency across corpus.",
            "similarExpressions": [
              {
                "expression": "ơi ơi (vocative reduplication)",
                "similarity": "high",
                "difference": "Uses vocative particle 'ơi' instead of 'a', often more emphatic calling function, but similar playful/affective tone"
              },
              {
                "expression": "à à (hesitation reduplication)",
                "similarity": "high",
                "difference": "Can signal hesitation or thoughtful pause, not always playful. Context-dependent, but same structural pattern"
              },
              {
                "expression": "ừ ừ (agreement reduplication)",
                "similarity": "medium",
                "difference": "Signals agreement/acknowledgment, different semantic function but same phonological strategy of particle doubling"
              }
            ],
            "regionalDistribution": "Pan-Vietnamese pattern. Found in Northern, Central, and Southern folk songs. Universal across regions with minor tonal variations.",
            "genreDistribution": "Cross-genre feature: lullabies, work songs, love songs, children's songs. One of most common reduplication patterns in Vietnamese folk music.",
            "historicalPersistence": "Ancient pattern documented in earliest Vietnamese literature. Continues robustly in contemporary speech and song. Highly persistent across time."
          },
          "interpretiveGuidance": {
            "performanceTips": [
              "ARTICULATION: Separate 'a a' clearly into two distinct syllables. Don't blur into single 'aa' sound. Crisp repetition creates playful rhythm.",
              "TONE: Both 'a' particles use ngang (level) tone. Keep pitch consistent on both iterations for authentic reduplication pattern.",
              "RHYTHM: Quick, light delivery of 'a a' - not labored or heavy. Think of bouncing sound, like gentle laughter.",
              "VOCAL COLOR: Brighten tone on 'a a' to create playful mood shift. Contrast with more serious 'ruộng sâu' earlier.",
              "DYNAMICS: Slightly louder on 'a a' to draw attention and create interest. Wake baby up slightly from drowsiness before final refrain.",
              "GESTURE: If performing, can add playful hand motion (mimicking fish swimming or whiskers) to enhance visual interest."
            ],
            "culturalSensitivity": [
              "AVOID MOCKERY: Don't perform 'a a' in mocking or exaggerated way. This is authentic Vietnamese linguistic feature, not 'cute broken speech'.",
              "RESPECT REDUPLICATION: Acknowledge 'từ láy' as sophisticated linguistic system, not simplification. Vietnamese reduplication is complex grammatical feature.",
              "PRONUNCIATION: Maintain Vietnamese tone accuracy. Sloppy pronunciation can come across as disrespectful to language.",
              "CULTURAL FRAME: Present as example of Vietnamese phonological creativity and affective marking, not as exotic oddity."
            ],
            "pedagogicalApproach": [
              "STEP 1: Introduce concept of reduplication across languages. Compare to English baby talk ('night-night', 'bye-bye') but note Vietnamese uses reduplication in sophisticated adult speech.",
              "STEP 2: Explain Vietnamese particle system - 'a' as versatile particle with various functions (vocative, emphatic, affective).",
              "STEP 3: Practice 'a a' with correct tone (level/ngang). Use visual aids (flat hand gesture) to show level pitch.",
              "STEP 4: Discuss affective function - how does repetition create playfulness? Why use this for baby?",
              "STEP 5: Compare different particle reduplications (ơi ơi, à à, ừ ừ) to show pattern productivity.",
              "STEP 6: Have students identify other reduplications in song (none others in this particular song, but common in Vietnamese).",
              "ASSESSMENT: Can students produce correct tone? Understand reduplication concept? Explain affective function?"
            ],
            "commonMisinterpretations": [
              "❌ WRONG: 'A a is baby talk or simplified speech' → ✅ CORRECT: 'A a is sophisticated linguistic feature (reduplication) common in adult Vietnamese folk songs'",
              "❌ WRONG: 'The repetition is meaningless filler' → ✅ CORRECT: 'Reduplication creates specific affective tone (playfulness, affection) with grammatical function'",
              "❌ WRONG: 'You can combine the two a sounds into one' → ✅ CORRECT: 'Must maintain two distinct syllables - that's what makes it reduplication, not elongation'",
              "❌ WRONG: 'Tone doesn't matter for particles' → ✅ CORRECT: 'Tone accuracy critical even for particles - wrong tone breaks reduplication pattern and sounds non-native'",
              "❌ WRONG: 'This is unique to lullabies' → ✅ CORRECT: 'Particle reduplication appears across all Vietnamese folk song genres and everyday speech'"
            ]
          }
        }
      ]
    },
    {
      "id": 10,
      "text": "nắm cổ về cho cái ăn",
      "syllableCount": 6,
      "type": "narrative",
      "linguisticType": "narrative",
      "english": "Grab by the neck and bring home for you to eat",
      "wordMapping": [
        {
          "vn": "nắm",
          "en": "grab"
        },
        {
          "vn": "cổ",
          "en": "neck"
        },
        {
          "vn": "về",
          "en": "return"
        },
        {
          "vn": "cho",
          "en": "for"
        },
        {
          "vn": "cái",
          "en": "(particle)"
        },
        {
          "vn": "ăn",
          "en": "eat"
        }
      ],
      "culturalContext": {
        "description": "Vivid description of bringing fish home for baby to eat",
        "facts": [
          "'nắm cổ' (grab by neck) is how catfish are caught",
          "Detailed promises make the reward feel real and imminent"
        ],
        "musicalContext": "Active melodic rhythm describes mother's actions"
      },
      "figurativeExpressions": [
        {
          "expression": "nắm cổ",
          "type": "vivid_imagery",
          "literal": "Grab the neck",
          "meaning": "Specific technique for catching catfish; creates vivid sensory image of mother's capable hands providing food",
          "culturalWeights": {
            "historicalDepth": 7,
            "explanation": "Fish-catching techniques documented in Vietnamese agricultural texts for centuries. 'Nắm cổ' (neck-grabbing) is traditional method for handling catfish (which have sharp spines), passed down through generations. Pre-colonial practice.",
            "regionalSpecificity": 8,
            "explanation": "Highly specific to Northern Vietnam's rice-paddy catfish culture. Southern regions use different fishing methods (nets, traps). Reflects Northern wet-rice ecosystem where catfish live in paddies and canals.",
            "symbolicLoad": 6,
            "explanation": "Symbolically represents: 1) Mother's competence and strength, 2) Direct hands-on provision for family, 3) Intimacy with food sources (not bought, but caught), 4) Connection to land and water. Moderate-strong symbolic resonance.",
            "ritualSignificance": 3,
            "explanation": "Not formally ritualized, but fishing in rice paddies is integral to agricultural cycle rituals. Catching supplemental protein during planting season has cultural rhythm. Moderate ritual context.",
            "transmissionImportance": 6,
            "explanation": "Important for transmitting: 1) Traditional fishing techniques, 2) Knowledge of catfish behavior, 3) Gender roles (women often caught paddy fish), 4) Food procurement skills. Moderate pedagogical value.",
            "emotionalResonance": 7,
            "explanation": "Emotionally powerful image for Vietnamese listeners familiar with subsistence fishing. Evokes mother's capable hands, childhood memories of fresh-caught fish, and intimate connection to food sources. Strong emotional effect."
          },
          "complexityMetrics": {
            "layersOfMeaning": 3,
            "explanation": "Layer 1: Literal fishing technique. Layer 2: Mother's competence and provision. Layer 3: Intimate connection to land/water/food. Three interpretive levels, moderately layered.",
            "crossDomainMapping": 5,
            "explanation": "Maps PHYSICAL ACTION domain to CARE/PROVISION domain: Grabbing fish neck → Providing for child, Physical competence → Maternal capability. Moderate cross-domain mapping, accessible metaphor.",
            "culturalPrerequisites": 7,
            "explanation": "Understanding requires: 1) Knowledge of catfish anatomy (why neck?), 2) Familiarity with paddy fishing, 3) Recognition of women's fishing practices, 4) Context of subsistence food procurement. Significant cultural background needed.",
            "idiomaticity": 4,
            "explanation": "Somewhat fixed expression in fishing context. Can be paraphrased ('bắt cá', 'túm cá') but 'nắm cổ' is conventional phrase for catfish-catching. Moderately idiomatic.",
            "contextDependence": 6,
            "explanation": "Meaning depends on: 1) Agricultural/fishing context, 2) Knowledge of catfish, 3) Understanding of lullaby promises, 4) Recognition of maternal provision theme. Moderately context-dependent.",
            "pedagogicalChallenge": 7,
            "explanation": "Challenging to teach: 1) Catfish fishing unfamiliar to most non-Vietnamese, 2) Specific technique requires visual demonstration, 3) Cultural context of paddy fishing needs explanation, 4) Vivid physicality can be misinterpreted. Moderately difficult."
          },
          "semanticNetwork": {
            "sourceDomain": "FISHING_TECHNIQUE",
            "targetDomain": "MATERNAL_PROVISION",
            "mappings": [
              {
                "source": "Firm grip on fish neck",
                "target": "Mother's capability and strength"
              },
              {
                "source": "Skilled catching technique",
                "target": "Knowledge and competence"
              },
              {
                "source": "Physical contact with food source",
                "target": "Intimate provision (not distant market)"
              },
              {
                "source": "Bringing fish home",
                "target": "Mother's return and reunion"
              },
              {
                "source": "Fresh-caught fish",
                "target": "Love and care (best quality food)"
              }
            ],
            "conceptualMetaphor": "PROVIDING IS CATCHING"
          },
          "usagePatterns": {
            "phrasePosition": "middle",
            "explanation": "Appears in phrase 10, describing how mother will catch and bring fish. Central to food-promise narrative sequence (catch → identify type → bring home).",
            "syntacticRole": "predicate",
            "explanation": "Functions as verb phrase describing action. Core grammatical role - main predicate of implied sentence 'Mẹ nắm cổ (cá)'.",
            "discourseFunction": "promise",
            "explanation": "Functions as promise to baby - if you sleep well, mother will catch fish and bring it home. Creates motivation and hope. Reassures baby of mother's return.",
            "participationPattern": "listening",
            "explanation": "Baby listens to promise. Later in childhood, may participate in fishing or remember these promises. Passive reception becomes active memory.",
            "emotionalValence": "positive",
            "explanation": "Positive tone - promise of good food, mother's competence, successful provision. Reassuring and hopeful, not negative or anxious."
          },
          "statistics": {
            "occurrences": 1,
            "phraseIds": [10],
            "totalPhrases": 12,
            "coverage": "8.3%",
            "positionDistribution": {
              "beginning": 0,
              "middle": 1,
              "ending": 0
            }
          },
          "comparativeContext": {
            "uniquenessScore": 6,
            "explanation": "Moderately unique expression. 'Nắm cổ' in fishing context appears in some Northern work songs and lullabies, but not extremely common. More specific than general 'bắt cá' (catch fish). Moderately distinctive.",
            "similarExpressions": [
              {
                "expression": "túm đuôi (grab the tail)",
                "similarity": "high",
                "difference": "Alternative fishing technique for other fish types. Same body-part grabbing strategy but different fish anatomy. Functionally similar."
              },
              {
                "expression": "bắt bằng tay trần (catch barehanded)",
                "similarity": "medium",
                "difference": "Emphasizes no tools, but less specific about technique. General phrase vs. specific 'nắm cổ' technique."
              },
              {
                "expression": "vớt cá (scoop fish)",
                "similarity": "low",
                "difference": "Different technique using net or scoop, not hands. Less intimate, less skillful. Different fishing method entirely."
              }
            ],
            "regionalDistribution": "Primarily Northern Vietnam (Red River Delta paddy fishing culture). Some North-Central usage. Rare in Southern regions which use different fishing vocabulary and methods.",
            "genreDistribution": "Appears in: lullabies (food promises), work songs (fishing songs), children's songs (teaching fishing). Cross-genre but concentrated in domestic/work contexts.",
            "historicalPersistence": "Traditional phrase documented in colonial-era ethnographies (early 1900s). Declining in contemporary usage as subsistence fishing decreases. Still understood by older generations and in rural areas."
          },
          "interpretiveGuidance": {
            "performanceTips": [
              "ARTICULATION: Crisp consonants on 'nắm' (grab) - sharp 'n' and 'm' sounds suggest decisive action. Don't slur.",
              "DYNAMICS: Crescendo on 'nắm cổ' to create sense of active energy and mother's capability. Louder than preceding lullaby vocables.",
              "RHYTHM: Quicken tempo slightly on this phrase to match active nature of catching fish. Contrast with slower lullaby refrains.",
              "TONE ACCURACY: 'Nắm' = sắc (rising sharply), 'cổ' = hỏi (broken/dipping). Practice tone contour to suggest grasping motion.",
              "GESTURE: If performing, mime grabbing motion with firm hand grip to demonstrate fishing technique. Visual aid helps non-Vietnamese understand.",
              "EMOTIONAL TONE: Confident and capable, not desperate or struggling. Mother knows how to catch fish - this is reassuring promise, not anxiety."
            ],
            "culturalSensitivity": [
              "AVOID PRIMITIVISM: Don't present hand-fishing as 'primitive' practice. This is skilled technique requiring knowledge of fish behavior and handling.",
              "RESPECT SUBSISTENCE SKILLS: Recognize this as valuable traditional knowledge, not poverty to be pitied. Capable mothers providing for families.",
              "GENDER AWARENESS: Acknowledge this as women's fishing practice in Northern agricultural cycle. Not male sport fishing.",
              "ECOLOGICAL CONTEXT: This describes paddy ecosystem - catfish living in rice fields. Understand integrated rice-fish agriculture system.",
              "FOOD SOVEREIGNTY: This represents direct relationship with food sources, not market dependency. Has value in contemporary food system discussions."
            ],
            "pedagogicalApproach": [
              "STEP 1: Show images/video of Northern Vietnamese rice paddies and catfish. Explain integrated rice-fish system.",
              "STEP 2: Demonstrate (with model or video) how to grab catfish by neck - why this part? (Avoid spine injuries.) Teach practical technique.",
              "STEP 3: Discuss women's role in paddy fishing during planting season. Connect to 'Mẹ mày đi cấy' earlier in song.",
              "STEP 4: Analyze vivid imagery - what does 'nắm cổ' make you see/feel? How does it create sensory experience?",
              "STEP 5: Connect to lullaby promise - why does mother promise fish? What does this tell baby about mother's return?",
              "STEP 6: Compare to students' food sources - how far removed are they from catching/growing their own food? What's lost/gained?",
              "ASSESSMENT: Can students explain fishing technique? Understand cultural context? Appreciate vivid imagery and promise function?"
            ],
            "commonMisinterpretations": [
              "❌ WRONG: 'Nắm cổ is violent or aggressive' → ✅ CORRECT: 'Nắm cổ is skilled fishing technique for handling catfish safely. Professional, not violent'",
              "❌ WRONG: 'This is about hunting/killing' → ✅ CORRECT: 'This is about provision and care - catching food to bring home to baby. Nurturing, not violence'",
              "❌ WRONG: 'Any fish can be caught this way' → ✅ CORRECT: 'Specific to catfish (cá trê) in paddy fields. Different fish require different techniques'",
              "❌ WRONG: 'Men did the fishing' → ✅ CORRECT: 'Women caught supplemental fish during rice planting. Gendered division of agricultural labor'",
              "❌ WRONG: 'This is metaphorical fish' → ✅ CORRECT: 'This is literal promise of actual fish. Concrete, not abstract. Mother will really bring fish home'"
            ]
          }
        }
      ]
    },
    {
      "id": 11,
      "text": "À á a à ơi",
      "syllableCount": 5,
      "type": "refrain",
      "linguisticType": "exclamatory",
      "english": "(Lullaby vocables)",
      "wordMapping": [
        {
          "vn": "À",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "á",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "a",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "à",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "ơi",
          "en": "oh"
        }
      ],
      "culturalContext": {
        "description": "Return to refrain after promise of food",
        "facts": [
          "Refrain ends each section providing closure",
          "Soothing sounds help baby drift to sleep"
        ],
        "musicalContext": "Return to gentle rocking melody"
      },
      "figurativeExpressions": []
    },
    {
      "id": 12,
      "text": "A á a à ơi",
      "syllableCount": 5,
      "type": "refrain",
      "linguisticType": "exclamatory",
      "english": "(Lullaby vocables)",
      "wordMapping": [
        {
          "vn": "A",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "á",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "a",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "à",
          "en": "(lullaby vocable)"
        },
        {
          "vn": "ơi",
          "en": "oh"
        }
      ],
      "culturalContext": {
        "description": "Final soothing refrain to end lullaby",
        "facts": [
          "Multiple repetitions ensure baby is fully soothed",
          "Ending on familiar refrain provides comfort"
        ],
        "musicalContext": "Final gentle descent completes lullaby cycle"
      },
      "figurativeExpressions": []
    }
  ],
  "figurativeAnalysis": {
    "patterns": {
      "totalExpressions": 4,
      "uniqueExpressions": 4,
      "expressionCounts": {
        "À á a à ơi": 1,
        "ruộng sâu": 1,
        "a a": 1,
        "nắm cổ": 1
      },
      "byType": {
        "sound_symbolism": 1,
        "spatial_metaphor": 1,
        "emphatic_reduplication": 1,
        "vivid_imagery": 1
      },
      "mostCommon": [
        {
          "expression": "À á a à ơi",
          "count": 1,
          "type": "sound_symbolism"
        },
        {
          "expression": "ruộng sâu",
          "count": 1,
          "type": "spatial_metaphor"
        },
        {
          "expression": "a a",
          "count": 1,
          "type": "emphatic_reduplication"
        },
        {
          "expression": "nắm cổ",
          "count": 1,
          "type": "vivid_imagery"
        }
      ]
    },
    "richness": {
      "culturalRichness": "moderate",
      "dominantType": "sound_symbolism",
      "expressionDensity": 4,
      "description": "Moderate figurative language richness. Simple lullaby with literal narrative enhanced by sound symbolism, spatial metaphor, and vivid imagery. Poetic elements serve functional purpose (soothing, explaining, promising) rather than elaborate ornamentation."
    },
    "culturalWeights": {
      "individualWeights": [
        {
          "expression": "À á a à ơi",
          "averageWeight": 7.83,
          "dimensions": {
            "historicalDepth": 9,
            "regionalSpecificity": 8,
            "symbolicLoad": 7,
            "ritualSignificance": 6,
            "transmissionImportance": 8,
            "emotionalResonance": 9
          }
        },
        {
          "expression": "ruộng sâu",
          "averageWeight": 7.17,
          "dimensions": {
            "historicalDepth": 8,
            "regionalSpecificity": 7,
            "symbolicLoad": 8,
            "ritualSignificance": 4,
            "transmissionImportance": 7,
            "emotionalResonance": 9
          }
        },
        {
          "expression": "a a",
          "averageWeight": 5.0,
          "dimensions": {
            "historicalDepth": 7,
            "regionalSpecificity": 6,
            "symbolicLoad": 4,
            "ritualSignificance": 2,
            "transmissionImportance": 6,
            "emotionalResonance": 7
          }
        },
        {
          "expression": "nắm cổ",
          "averageWeight": 6.17,
          "dimensions": {
            "historicalDepth": 7,
            "regionalSpecificity": 8,
            "symbolicLoad": 6,
            "ritualSignificance": 3,
            "transmissionImportance": 6,
            "emotionalResonance": 7
          }
        }
      ],
      "averageWeight": 6.54,
      "totalWeight": 26.17,
      "weightedExpressionCount": 4
    },
    "complexityScore": 5.71
  },
  "aggregateStatistics": {
    "totalExpressions": 4,
    "uniqueExpressions": 4,
    "totalOccurrences": 4,
    "phrasesCovered": 4,
    "phraseCoverage": "33.3%",
    "averageCulturalWeight": 6.54,
    "averageComplexity": 5.71,
    "dominantMechanism": "sound_symbolism",
    "culturalRichness": "moderate"
  },
  "collectionContext": {
    "genreClassification": "Lullaby (Hát Ru) - Northern Vietnamese tradition",
    "culturalSignificance": "Represents Northern Vietnamese lullaby tradition with distinctive vocable patterns. Reflects rice-farming culture where mothers leave babies to work in fields. Documents women's agricultural labor and maternal strategies for soothing children while explaining harsh economic realities.",
    "linguisticProfile": "Northern Vietnamese dialect features: particle 'cái', pronoun 'mày', reduplication patterns 'a a'. Uses vocables with specific Northern tone sequences (huyền-sắc-ngang-huyền-ngang). Agricultural and fishing vocabulary specific to Red River Delta ecosystem.",
    "performanceContext": "Performed solo by mother to baby at bedtime, particularly during planting season when mother works long hours in distant fields. Intimate one-on-one context, not for public performance. Part of daily ritual of putting baby to sleep while explaining mother's absence and promising return with food.",
    "pedagogicalValue": "Excellent teaching material for: 1) Vietnamese tone system (vocables demonstrate all major tones), 2) Sound symbolism and pre-verbal communication, 3) Agricultural cultural context, 4) Gender roles in traditional society, 5) Spatial metaphor and vivid imagery, 6) Mother-child bonding through music. Accessible difficulty level (simple lyrics) with rich cultural layers for discussion."
  },
  "statistics": {
    "overview": {
      "totalPhrases": 12,
      "totalSyllables": 59,
      "averagePhraseLength": "4.92"
    },
    "figurativeLanguage": {
      "totalExpressions": 4,
      "uniqueExpressions": 4,
      "expressionDensity": "6.78",
      "expressionCoverage": "33.3%"
    },
    "culturalWeights": {
      "averageWeight": "6.540",
      "totalWeight": "26.170",
      "weightedExpressionCount": 4,
      "topWeightedExpressions": [
        {
          "expression": "À á a à ơi",
          "weight": 7.83
        },
        {
          "expression": "ruộng sâu",
          "weight": 7.17
        },
        {
          "expression": "nắm cổ",
          "weight": 6.17
        },
        {
          "expression": "a a",
          "weight": 5.0
        }
      ]
    },
    "complexityMetrics": {
      "overallComplexityScore": 5.71,
      "complexityLevel": "Moderate",
      "dimensionalDiversity": "High (4 different types)",
      "semanticRichness": "Moderate (balanced literal and figurative)"
    }
  }
}
