{
  "songTitle": "Bát bồng, nhất trò, xuân nữ",
  "version": "3.0",
  "enhancementDate": "2025-10-05",
  "enhancedBy": "Claude LLM (V3.0 DEEP Enhancement)",
  "sourceFile": "lyrics-enhanced-tier1/Bát bồng, nhất trò, xuân nữ.json",

  "expressions": [
    {
      "expression": "trăng non",
      "literal": "young moon / new moon",
      "meaning": "new beginning, fresh start, budding romance - symbolic of youth and new cycles",

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Lunar imagery in Vietnamese poetry dates back 1000+ years to Chinese Tang dynasty influence and indigenous animist moon worship. Trăng non appears in classical poetry (thơ Nôm) and folk songs across centuries.",

        "regionalSpecificity": 3,
        "explanation": "Pan-Vietnamese and broader East Asian cultural reference. Found across Northern, Central, Southern regions with similar meanings. Also present in Chinese, Japanese, Korean lunar poetry traditions.",

        "symbolicLoad": 9,
        "explanation": "Multi-layered symbolism: (1) Literal astronomical event marking lunar month start, (2) Metaphor for new beginnings and cycles of life, (3) Romantic symbol of budding love (young moon = young love), (4) Temporal marker in agricultural calendar, (5) Feminine beauty archetype.",

        "ritualSignificance": 7,
        "explanation": "Vietnamese lunar calendar governs festivals (Tết, Trung Thu), ancestor worship dates, and auspicious wedding timing. New moon marks ritual cycle beginnings, though not essential to specific ceremonies.",

        "transmissionImportance": 8,
        "explanation": "Critical for maintaining lunar calendar cultural knowledge and poetic tradition. Essential metaphor in Vietnamese folk song corpus - losing this reference diminishes understanding of 1000s of songs.",

        "emotionalResonance": 8,
        "explanation": "Evokes nostalgia for traditional timekeeping, romantic longing, and cyclical hope of renewal. Particularly powerful for Vietnamese diaspora connecting to ancestral culture through lunar imagery."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "(1) Literal astronomical phase, (2) Temporal marker (beginning of month), (3) Romantic metaphor (young love), (4) Life cycle symbolism (renewal, rebirth). Each layer accessible at different levels of cultural knowledge.",

        "crossDomainMapping": 8,
        "explanation": "Complex abstract mapping: CELESTIAL OBJECT → HUMAN LIFE STAGE. Source domain (lunar phases) maps to target domain (romance, life cycles). Requires understanding astronomical cycles, cultural calendars, and Vietnamese poetic conventions.",

        "culturalPrerequisites": 6,
        "explanation": "Moderate prerequisites: (1) Knowledge of lunar calendar system, (2) Understanding of moon symbolism in Vietnamese poetry, (3) Awareness of romantic conventions in ca dao. Accessible to Vietnamese speakers but requires cultural immersion for full appreciation.",

        "idiomaticity": 6,
        "explanation": "Semi-fixed expression. 'Trăng non' is conventional phrase but compositional (trăng = moon, non = young/new). Can substitute related terms (trăng mới, trăng khuyết) but 'trăng non' is most poetic and traditional.",

        "contextDependence": 5,
        "explanation": "Moderately context-dependent. Core meaning (new moon) stable, but romantic vs. temporal emphasis varies by context. In this song, romantic connotation dominates given subsequent love imagery.",

        "pedagogicalChallenge": 6,
        "explanation": "Challenging for non-Vietnamese learners: Requires teaching lunar calendar system, cultural symbolism, and poetic conventions. Visual aids (moon phase diagrams) and comparative examples (other moon poems) helpful for instruction."
      },

      "semanticNetwork": {
        "sourceDomain": "CELESTIAL_ASTRONOMY",
        "targetDomain": "ROMANCE_AND_LIFE_CYCLES",
        "mappings": [
          {
            "source": "new moon (first crescent)",
            "target": "new romantic relationship (budding love)"
          },
          {
            "source": "moon's cyclical phases (waxing)",
            "target": "life's cyclical renewal (youth, rebirth)"
          },
          {
            "source": "moon's visibility (emerging from darkness)",
            "target": "hope emerging from loneliness"
          },
          {
            "source": "lunar month beginning",
            "target": "relationship/life chapter beginning"
          }
        ],
        "conceptualMetaphor": "LIFE_CYCLES_ARE_LUNAR_PHASES"
      },

      "usagePatterns": {
        "phrasePosition": "beginning",
        "explanation": "Appears in first phrase (id:1) at word positions 4-5. Opens song by establishing temporal and romantic frame - classic ca dao opening strategy.",

        "syntacticRole": "object",
        "explanation": "Direct object of verb 'có' (have/there is): 'Chầu rày đã có trăng non' (Now there is a new moon). Functions as noun phrase within existential construction.",

        "discourseFunction": "scene_setting",
        "explanation": "Establishes song's temporal setting (new moon = new month) and romantic atmosphere. Prepares audience for love narrative by invoking traditional poetic imagery.",

        "participationPattern": "contemplative_listening",
        "explanation": "Evocative imagery invites internalization rather than call-response. Audience contemplates moon symbolism privately while listening to opening narrative.",

        "emotionalValence": "hopeful_romantic",
        "explanation": "Positive valence: new moon symbolizes fresh starts, budding romance, and cyclical hope. Sets optimistic tone before song's questioning and ironic turns."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [1],
        "totalPhrases": 8,
        "coverage": "12.5%",
        "positionDistribution": {
          "beginning": 1,
          "middle": 0,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 2,
        "explanation": "Common expression across Vietnamese folk song corpus. Appears in dozens of ca dao with similar romantic/temporal meanings. Not unique to this song.",

        "similarExpressions": [
          {
            "expression": "trăng tròn (full moon)",
            "similarity": "high",
            "difference": "Trăng tròn symbolizes fulfillment/completion vs. trăng non's beginning/potential. Both use lunar imagery for life metaphors."
          },
          {
            "expression": "trăng khuyết (waning moon)",
            "similarity": "high",
            "difference": "Trăng khuyết symbolizes loss/separation vs. trăng non's hope/beginning. Oppositional symbolism within lunar system."
          },
          {
            "expression": "trăng rằm (15th moon/full moon)",
            "similarity": "medium",
            "difference": "Trăng rằm tied to specific festival date (Mid-Autumn) vs. trăng non's general new beginning symbolism."
          }
        ],

        "regionalDistribution": "Nationwide - Northern, Central, Southern regions all use trăng non in folk songs",
        "genreDistribution": "Love songs (lý, hò), lullabies (hát ru), ceremonial songs - any genre using romantic or temporal imagery",
        "historicalPersistence": "Ancient to present - documented in 18th-century ca dao collections, still used in contemporary folk music and popular songs"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'trăng non' with gentle, ascending melodic contour mimicking crescent moon's upward curve",
          "Use softer dynamic (mezzo-piano) to evoke moonlight's subtle glow vs. harsh daylight",
          "Slight tempo rubato on 'non' - linger to let moon imagery register before continuing",
          "Facial expression: gaze upward slightly as if looking at night sky, with soft smile suggesting romantic hope",
          "Hand gesture: arc hand gently upward tracing crescent shape (optional, for theatrical performance)"
        ],

        "culturalSensitivity": [
          "Lunar calendar remains living tradition for Vietnamese communities worldwide - not historical artifact",
          "Avoid trivializing as 'exotic Oriental moon imagery' - this is functional cultural timekeeping with deep meaning",
          "Acknowledge both Chinese literary influence AND indigenous Vietnamese animist moon traditions",
          "Recognize political dimension: lunar calendar persistence despite French colonial/modern Gregorian calendar imposition",
          "For diaspora audiences, trăng non may evoke powerful nostalgia - perform with respect for emotional weight"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach literal lunar calendar basics - show moon phase chart, explain Vietnamese lunar month structure",
          "Step 2: Introduce 2-3 other Vietnamese songs using trăng imagery (trăng tròn, trăng rằm) to establish pattern",
          "Step 3: Discuss symbolic mappings - why new moon = new romance? (analogy: both emerging, growing, cyclical)",
          "Step 4: Compare to similar imagery in learner's culture (e.g., 'honeymoon,' 'blue moon,' 'moonstruck')",
          "Step 5: Practice singing phrase with appropriate vocal quality and gesture to embody moon symbolism",
          "Step 6: Analyze how this opening prepares audience for subsequent romantic narrative"
        ],

        "commonMisinterpretations": [
          "❌ 'Just a pretty nature image with no meaning' → ✅ Multi-layered cultural symbol with temporal, romantic, and cyclical significance",
          "❌ 'Chinese borrowed concept foreign to Vietnam' → ✅ Synthesis of Chinese literary tradition with indigenous Vietnamese moon worship and agrarian calendar",
          "❌ 'Archaic imagery irrelevant to modern Vietnamese' → ✅ Living tradition still used in contemporary folk songs and Tết celebrations",
          "❌ 'Trăng non means literally 'young moon' in sense of immature' → ✅ 'Non' here means 'new' (beginning of cycle) not 'immature/unripe' - connotation is fresh potential, not lack of development"
        ]
      }
    },

    {
      "expression": "Chầu rày",
      "literal": "period this / time now",
      "meaning": "at this time, nowadays - poetic temporal marker with elevated register",

      "culturalWeights": {
        "historicalDepth": 7,
        "explanation": "Pre-modern temporal expression appearing in classical Nôm literature and folk songs from 18th-19th centuries. Archaic flavor signals traditional ca dao register vs. modern 'bây giờ.'",

        "regionalSpecificity": 8,
        "explanation": "Primarily Northern Vietnamese folk song formula. Less common in Central/Southern ca dao which use different temporal markers ('hồi nào,' 'khi nào'). Signals Northern geographical origin.",

        "symbolicLoad": 3,
        "explanation": "Low symbolism - primarily functional temporal marker. However, choosing archaic 'chầu rày' vs. modern 'bây giờ' symbolizes connection to traditional poetic register and respect for ca dao heritage.",

        "ritualSignificance": 2,
        "explanation": "Not tied to specific rituals. Functions as narrative formula to open folk songs, signaling shift from everyday speech to formal performance mode.",

        "transmissionImportance": 7,
        "explanation": "Important for preserving Northern ca dao linguistic register. Teaching 'chầu rày' vs. 'bây giờ' helps learners distinguish folk song formulas from everyday speech. Loss would flatten linguistic richness of tradition.",

        "emotionalResonance": 6,
        "explanation": "Evokes nostalgia for traditional storytelling and respect for poetic heritage. Listeners recognize archaic marker as signal of 'authentic' folk song vs. modern composition."
      },

      "complexityMetrics": {
        "layersOfMeaning": 2,
        "explanation": "(1) Literal temporal meaning (at this time), (2) Register marker (signals elevated folk song language vs. everyday speech). Relatively transparent once archaic vocabulary learned.",

        "crossDomainMapping": 2,
        "explanation": "Minimal metaphorical mapping. Literal temporal function with register connotations. Not abstract conceptual metaphor.",

        "culturalPrerequisites": 5,
        "explanation": "Requires knowledge of: (1) Archaic Vietnamese vocabulary, (2) Folk song register conventions, (3) Northern dialectal patterns. Moderate difficulty - learnable through exposure to multiple ca dao examples.",

        "idiomaticity": 9,
        "explanation": "Highly frozen expression. 'Chầu' + 'rày' fixed collocation in folk songs. Cannot substitute modern equivalents without disrupting traditional register. Learners must memorize as chunk.",

        "contextDependence": 3,
        "explanation": "Relatively context-independent. Consistently functions as temporal marker across different folk songs. Meaning stable, though connotations (archaic register) require folk song context to appreciate.",

        "pedagogicalChallenge": 6,
        "explanation": "Moderate challenge: (1) Archaic vocabulary not in modern dictionaries, (2) Distinguishing register levels requires exposure to both folk and modern Vietnamese, (3) Northern dialectal features unfamiliar to Central/Southern learners."
      },

      "semanticNetwork": {
        "sourceDomain": "TIME_REFERENCE",
        "targetDomain": "NARRATIVE_FRAMING",
        "mappings": [
          {
            "source": "temporal deixis (now)",
            "target": "narrative present tense (this is when story begins)"
          },
          {
            "source": "archaic word choice",
            "target": "elevated poetic register (this is formal folk song, not casual speech)"
          },
          {
            "source": "Northern dialectal marker",
            "target": "regional identity (this is Northern ca dao tradition)"
          }
        ],
        "conceptualMetaphor": "TIME_MARKERS_ARE_REGISTER_SIGNALS"
      },

      "usagePatterns": {
        "phrasePosition": "beginning",
        "explanation": "Opens first phrase (id:1) at word positions 0-1. Classic ca dao opening formula positioning - immediately signals folk song mode to audience.",

        "syntacticRole": "temporal_adverbial",
        "explanation": "Adverbial phrase modifying entire clause: 'Chầu rày [đã có trăng non]' (At this time [there is a new moon]). Sets temporal frame for subsequent narrative.",

        "discourseFunction": "narrative_opening_formula",
        "explanation": "Formal opening marker signaling transition from everyday speech to folk song performance. Alerts audience that poetic narrative is beginning - functional equivalent of 'Once upon a time' in English fairy tales.",

        "participationPattern": "attentive_listening",
        "explanation": "Opening formula cues audience to shift into listening mode. Not call-response - requires respectful attention as performer establishes narrative frame.",

        "emotionalValence": "neutral_formal",
        "explanation": "Emotionally neutral marker. Formal register creates respectful, elevated tone appropriate for traditional song performance."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [1],
        "totalPhrases": 8,
        "coverage": "12.5%",
        "positionDistribution": {
          "beginning": 1,
          "middle": 0,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 3,
        "explanation": "Common Northern folk song opening formula. Appears in dozens of ca dao from Bắc Bộ region with identical function. Not unique but regionally distinctive.",

        "similarExpressions": [
          {
            "expression": "Bây giờ (modern 'now')",
            "similarity": "medium",
            "difference": "Bây giờ is everyday speech; chầu rày is archaic folk song register. Same temporal function, different social register."
          },
          {
            "expression": "Ngày xưa (in the old days)",
            "similarity": "medium",
            "difference": "Ngày xưa refers to past time; chầu rày to present/recent time. Both archaic markers but different temporal reference."
          },
          {
            "expression": "Hồi nào (Central Vietnamese temporal marker)",
            "similarity": "high",
            "difference": "Hồi nào serves similar opening function in Central ca dao; chầu rày is Northern equivalent. Regional dialectal variants."
          }
        ],

        "regionalDistribution": "Primarily Northern Vietnam (Bắc Bộ) - rare in Central/Southern folk songs",
        "genreDistribution": "Lý, quan họ, hò, and other Northern folk song genres - signals traditional Northern ca dao style",
        "historicalPersistence": "Pre-modern (18th-19th century) to mid-20th century folk song collections. Declining in contemporary compositions which use modern 'bây giờ.'"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Articulate 'chầu rày' with clear, deliberate diction - archaic words deserve careful pronunciation",
          "Slight pause after 'chầu rày' before continuing - let temporal marker register as narrative frame",
          "Use slightly slower tempo for opening formula vs. subsequent phrases - signals formality",
          "Facial expression: serious, respectful demeanor appropriate for elevated folk song register",
          "Vocal quality: slightly more resonant, 'projected' tone vs. intimate conversational quality"
        ],

        "culturalSensitivity": [
          "Archaic language is NOT 'primitive' or 'backward' - it's elevated poetic register showing sophistication",
          "Respect Northern regional identity encoded in this phrase - not 'standard Vietnamese' but valid dialectal tradition",
          "Recognize language preservation challenges: younger Vietnamese may not know 'chầu rày' due to modern language shift",
          "Avoid condescending tone when teaching archaic terms - frame as cultural treasure, not linguistic curiosity",
          "For non-Northern Vietnamese performers: use 'chầu rày' authentically vs. substituting regional equivalents - respect Northern origin while cross-regional learning appropriate"
        ],

        "pedagogicalApproach": [
          "Step 1: Contrast with modern equivalent: 'Chầu rày đã có trăng non' vs. 'Bây giờ đã có trăng non' - hear register difference",
          "Step 2: Show 5+ other Northern folk songs using 'chầu rày' to establish pattern as formulaic opening",
          "Step 3: Explain archaic vocabulary: 'chầu' (period) + 'rày' (this) = 'this period/time now'",
          "Step 4: Discuss register levels in Vietnamese: folk song vs. formal writing vs. everyday speech",
          "Step 5: Compare to English: 'chầu rày' ≈ 'in this present time' (formal) vs. 'now' (casual)",
          "Step 6: Practice singing with appropriate formal delivery - hear how archaic marker affects performance style"
        ],

        "commonMisinterpretations": [
          "❌ 'Old-fashioned word we should modernize' → ✅ Elevated poetic register essential to folk song tradition - modernizing would destroy cultural heritage",
          "❌ 'Weird Northern dialect mistake' → ✅ Authentic Northern folk song formula with centuries of documented use",
          "❌ 'Means exactly same as bây giờ' → ✅ Similar temporal meaning but critically different social register - chầu rày signals formal traditional performance",
          "❌ 'Random filler words for meter' → ✅ Functional narrative opening formula with clear discourse purpose - signals transition to folk song mode"
        ]
      }
    },

    {
      "expression": "lên xuống",
      "literal": "go up go down",
      "meaning": "traveling back and forth, visiting repeatedly, journey metaphor for courtship",

      "culturalWeights": {
        "historicalDepth": 7,
        "explanation": "Long-standing Vietnamese romantic convention in ca dao. Documents historical courtship practice where young men traveled repeatedly between villages to visit beloved - journey metaphor reflects feudal social geography.",

        "regionalSpecificity": 4,
        "explanation": "Pan-Vietnamese expression but with cultural specificity. 'Lên xuống' reflects Vietnamese geographical orientation (lên Bắc/up North, xuống Nam/down South) rather than universal up/down. Courtship visiting pattern common across regions.",

        "symbolicLoad": 7,
        "explanation": "Multi-layered symbolism: (1) Literal repeated journeys (physical travel), (2) Courtship ritual (persistent effort to win love), (3) Life's ups and downs (emotional/social fluctuations), (4) Dedication and sacrifice (effort to traverse distance).",

        "ritualSignificance": 5,
        "explanation": "Reflects traditional courtship ritual practice where suitor makes repeated formal visits to beloved's family home. Not sacred ritual but important social custom encoding proper courtship behavior.",

        "transmissionImportance": 7,
        "explanation": "Important for understanding traditional Vietnamese courtship culture and social geography. Modern audiences may miss connection to actual historical practice of repeated village-to-village journeys - teaching preserves social history.",

        "emotionalResonance": 7,
        "explanation": "Evokes romantic persistence, dedication despite obstacles, and sacrifice for love. Particularly resonant for rural Vietnamese who remember difficulty of inter-village travel. Journey metaphor universal but culturally grounded."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "(1) Literal physical movement (going up and down geographically), (2) Repeated journeys (courtship visiting), (3) Metaphorical life fluctuations (ups and downs experienced together). Compositional but with conventionalized romantic interpretation.",

        "crossDomainMapping": 6,
        "explanation": "Moderate metaphorical mapping: PHYSICAL_JOURNEY → COURTSHIP_EFFORT. Source domain (repeated travel) maps to target domain (persistent romantic pursuit). Also maps to EMOTIONAL_LIFE (ups and downs of experience).",

        "culturalPrerequisites": 5,
        "explanation": "Requires understanding: (1) Traditional Vietnamese courtship customs, (2) Rural social geography (villages separated by distance), (3) Historical transportation limitations. Accessible with basic cultural context.",

        "idiomaticity": 5,
        "explanation": "Semi-fixed expression. 'Lên xuống' partially compositional (lên = up, xuống = down) but conventionalized in romantic contexts to mean repeated visiting. Some substitutability (đi lại, qua lại) but 'lên xuống' most poetic.",

        "contextDependence": 6,
        "explanation": "Moderately context-dependent. In romantic songs, 'lên xuống' implies courtship visiting; in travel songs, literal journeying; in life philosophy, metaphorical ups/downs. This song's romantic frame determines courtship interpretation.",

        "pedagogicalChallenge": 5,
        "explanation": "Moderate challenge: (1) Explaining Vietnamese geographical orientation (lên/up vs. xuống/down not based on elevation but North/South direction), (2) Teaching historical courtship customs unfamiliar to modern learners, (3) Distinguishing literal vs. metaphorical uses."
      },

      "semanticNetwork": {
        "sourceDomain": "PHYSICAL_JOURNEY",
        "targetDomain": "ROMANTIC_COURTSHIP",
        "mappings": [
          {
            "source": "repeated travel (going back and forth)",
            "target": "persistent courtship effort (repeated visits to beloved)"
          },
          {
            "source": "physical distance traversed",
            "target": "obstacles overcome for love"
          },
          {
            "source": "upward and downward movement",
            "target": "emotional/social fluctuations in relationship"
          },
          {
            "source": "cyclical journey pattern",
            "target": "ongoing commitment (not one-time event)"
          }
        ],
        "conceptualMetaphor": "COURTSHIP_IS_A_JOURNEY"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears in phrase 2 (id:2) at word positions 2-3, middle of sentence. Embedded within dependent clause explaining purpose of having beloved.",

        "syntacticRole": "verb_phrase",
        "explanation": "Verbal phrase modifying subject 'anh' (I): 'Để anh lên xuống' (So that I [can] go up and down). Functions as action predicate.",

        "discourseFunction": "action_description",
        "explanation": "Describes suitor's intended action (repeated journeying) to justify need for beloved's companionship. Establishes romantic pursuit as central narrative action.",

        "participationPattern": "empathetic_listening",
        "explanation": "Journey imagery invites audience to empathize with suitor's effort and dedication. Listeners imagine repeated difficult travels undertaken for love.",

        "emotionalValence": "devoted_hopeful",
        "explanation": "Positive valence with undertone of effort/sacrifice. 'Lên xuống' implies dedication and persistent hope despite obstacles - romantic but realistic about challenges."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [2],
        "totalPhrases": 8,
        "coverage": "12.5%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 3,
        "explanation": "Common Vietnamese romantic metaphor. Appears in many ca dao and contemporary love songs with similar courtship meaning. Not unique but conventional poetic expression.",

        "similarExpressions": [
          {
            "expression": "đi lại (come and go)",
            "similarity": "high",
            "difference": "Đi lại more neutral movement; lên xuống specifically emphasizes vertical/geographic dimension and implies more arduous travel."
          },
          {
            "expression": "qua lại (back and forth)",
            "similarity": "high",
            "difference": "Qua lại also means reciprocal visiting but lacks geographic orientation of lên xuống (up/down vs. across/over)."
          },
          {
            "expression": "xa gần (far and near)",
            "similarity": "medium",
            "difference": "Xa gần describes distance rather than movement. Related concept (overcoming distance for love) but static vs. dynamic."
          }
        ],

        "regionalDistribution": "Nationwide - appears in Northern, Central, Southern folk songs with consistent romantic meaning",
        "genreDistribution": "Love songs (lý, hò), courtship dialogues, and some lullabies (mother imagining daughter's future suitor)",
        "historicalPersistence": "Pre-modern to present - documented in 18th-19th century ca dao, still used in contemporary folk-inspired popular music"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'lên xuống' with ascending-descending melodic contour matching the up/down semantic content",
          "Slight dynamic swell on 'lên' (going up, louder) and diminuendo on 'xuống' (going down, softer) to embody movement",
          "Vocal quality: slightly breathier tone suggesting exertion of travel - this is effortful journey, not easy stroll",
          "Hand gesture: arc hand upward on 'lên,' downward on 'xuống' to trace journey path (optional for theatrical performance)",
          "Facial expression: determined but hopeful - convey dedication required for repeated journeys"
        ],

        "culturalSensitivity": [
          "Lên xuống encodes real historical practice of difficult inter-village courtship travel - not just romantic metaphor",
          "Respect social class dimension: poorer suitors traveled on foot; wealthier rode horses/boats - journey difficulty varied by class",
          "Acknowledge gender dynamics: traditionally male suitors traveled to female beloved (patrilocal marriage pattern) - heteronormative framing",
          "Recognize modern change: urbanization and transportation advances make repeated journeys easier - historical practice fading",
          "For diaspora audiences: lên xuống may evoke memories of separated families traveling between Vietnam and host countries - respectful of emotional weight"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach literal meaning - lên = up, xuống = down, explain Vietnamese geographical orientation (lên Bắc = up North, xuống Nam = down South)",
          "Step 2: Explain traditional courtship practice - show map of typical village distances, discuss transportation methods (walking, boat, buffalo cart)",
          "Step 3: Introduce conceptual metaphor: COURTSHIP IS A JOURNEY - explain how physical travel represents romantic dedication",
          "Step 4: Show 3-5 other Vietnamese songs using travel/journey metaphors for love (đường xa, núi cao, sông sâu)",
          "Step 5: Compare to English: 'going the distance,' 'long road together,' 'journey of love' - similar metaphorical mappings",
          "Step 6: Practice singing with appropriate vocal quality and gesture to embody journey effort and romantic dedication"
        ],

        "commonMisinterpretations": [
          "❌ 'Literal up/down elevator movement' → ✅ Metaphorical repeated journeys with geographic orientation (North/South travel)",
          "❌ 'Random meaningless phrase for rhyme' → ✅ Conventionalized courtship metaphor encoding historical social practice",
          "❌ 'Modern casual dating visits' → ✅ Traditional formal courtship requiring significant travel effort and family permission",
          "❌ 'Emotional ups and downs only' → ✅ Primary meaning is physical courtship journeys; emotional fluctuation is secondary metaphorical extension"
        ]
      }
    },

    {
      "expression": "con em bồng",
      "literal": "classifier-you carry-in-arms",
      "meaning": "you whom I carry tenderly - endearing romantic imagery with animacy classifier",

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Northern Vietnamese ca dao formula documented in folk song collections from 18th-19th centuries. 'Bồng' (carry in arms) imagery dates to agrarian culture where carrying precious things (children, harvests) signaled value and protection.",

        "regionalSpecificity": 9,
        "explanation": "Highly specific to Northern Vietnamese folk song tradition (Bắc Bộ). Rare in Central/Southern ca dao which use different tender imagery. 'Con em' classifier pattern distinctly Northern grammatical feature.",

        "symbolicLoad": 8,
        "explanation": "Rich symbolism: (1) Beloved elevated to precious child-like status (protected, cherished), (2) Reversal of social hierarchy (adult romantic partner treated as child), (3) Tender protective love combining romantic and parental affect, (4) Vulnerability and trust (being carried requires surrender).",

        "ritualSignificance": 3,
        "explanation": "Not tied to specific rituals. However, 'bồng' (carrying in arms) does appear in wedding customs (groom carrying bride over threshold in some regions) and parent-child bonding practices.",

        "transmissionImportance": 8,
        "explanation": "Critical for preserving Northern ca dao's distinctive linguistic features (animacy classifiers, kinship-romantic term fusion). Loss would erase regional poetic identity. Important for teaching how Vietnamese uses classifiers for emotional nuance.",

        "emotionalResonance": 9,
        "explanation": "Extremely powerful emotional imagery. Combines romantic love with protective parental tenderness - evokes both passion and nurturing care. Particularly resonant for Vietnamese culture valuing both romantic and familial bonds."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "(1) Literal image (physically carrying beloved in arms), (2) Social role blending (romantic partner + child metaphor), (3) Emotional stance (protective tender love), (4) Vulnerability dynamic (beloved trusts/surrenders to being carried). Multiple interpretive dimensions.",

        "crossDomainMapping": 8,
        "explanation": "Complex metaphorical mapping: PARENT-CHILD_CARE → ROMANTIC_LOVE. Source domain (carrying precious child tenderly) maps to target domain (treating beloved with protective devotion). Requires understanding Vietnamese cultural fusion of familial and romantic affect.",

        "culturalPrerequisites": 8,
        "explanation": "Substantial prerequisites: (1) Vietnamese classifier system (con for small living things), (2) Kinship pronoun system (em as romantic term), (3) Cultural acceptance of child-like imagery in romance, (4) Northern folk song conventions. Challenging for non-Vietnamese learners.",

        "idiomaticity": 8,
        "explanation": "Highly idiomatic Northern folk formula. Cannot translate compositionally - 'con em bồng' is frozen expression with conventional romantic meaning. Learners must memorize as chunk with cultural context.",

        "contextDependence": 4,
        "explanation": "Relatively context-independent within folk song genre. Consistently signals tender protective romantic love in Northern ca dao. However, outside folk song context, 'con em' could mean literal child.",

        "pedagogicalChallenge": 9,
        "explanation": "Very challenging: (1) Complex classifier system unfamiliar to non-tonal language speakers, (2) Kinship-romantic term fusion culturally specific, (3) Child-metaphor in romance may seem infantilizing to Western learners without cultural framing, (4) Northern regional specificity requires comparative examples from other regions."
      },

      "semanticNetwork": {
        "sourceDomain": "PARENTAL_CARE",
        "targetDomain": "ROMANTIC_DEVOTION",
        "mappings": [
          {
            "source": "carrying child in arms (physical nurturing)",
            "target": "cherishing beloved tenderly (emotional nurturing)"
          },
          {
            "source": "child's preciousness and fragility",
            "target": "beloved's value and deserving of protection"
          },
          {
            "source": "parent's protective strength",
            "target": "lover's devotion and commitment"
          },
          {
            "source": "animacy classifier 'con' (small living thing)",
            "target": "endearment and intimacy (beloved as precious being)"
          }
        ],
        "conceptualMetaphor": "ROMANTIC_LOVE_IS_PARENTAL_CARE"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Appears at end of phrase 2 (id:2) at word positions 6-8. Culminating image that completes romantic declaration - strong ending position.",

        "syntacticRole": "object_noun_phrase",
        "explanation": "Direct object of verb 'có' (have): 'mà có con em bồng' (so that [I] have you-whom-I-carry-tenderly). Complex noun phrase with embedded action (bồng/carrying).",

        "discourseFunction": "romantic_culmination",
        "explanation": "Provides emotional peak of opening romantic statement. Shifts from abstract purpose (lên xuống) to concrete tender image (con em bồng) - makes romantic devotion viscerally tangible.",

        "participationPattern": "empathetic_absorption",
        "explanation": "Tender imagery invites audience to internalize protective romantic feeling. Listeners may sigh or smile recognizing conventional romantic formula - emotionally affecting moment.",

        "emotionalValence": "tender_devoted",
        "explanation": "Intensely positive valence. Combines warmth, protectiveness, devotion, and intimacy. Peak emotional moment in opening romantic section before song's shift to questioning tone."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [2],
        "totalPhrases": 8,
        "coverage": "12.5%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 7,
        "explanation": "Relatively unique Northern folk formula. While 'bồng' imagery appears in other songs, full 'con em bồng' construction less common. Regionally distinctive and poetically sophisticated.",

        "similarExpressions": [
          {
            "expression": "em yêu (beloved you)",
            "similarity": "medium",
            "difference": "Em yêu is modern direct romantic term; con em bồng is poetic folk formula with protective parental metaphor. Similar target (beloved) but different register and emotional framing."
          },
          {
            "expression": "con cưng (darling child)",
            "similarity": "high",
            "difference": "Con cưng used for actual children; con em bồng applies child-imagery to romantic partner. Similar animacy classifier but different relationship context."
          },
          {
            "expression": "em nhỏ (little you)",
            "similarity": "medium",
            "difference": "Em nhỏ can be diminutive romantic term but lacks 'bồng' (carrying) action imagery. Similar endearment strategy but less visceral."
          }
        ],

        "regionalDistribution": "Primarily Northern Vietnam (quan họ, lý, hò genres) - rare in Central/Southern folk songs",
        "genreDistribution": "Love songs and courtship dialogues in Northern folk traditions - signals Northern romantic poetic style",
        "historicalPersistence": "18th-19th century folk collections to mid-20th century traditional performances - declining in contemporary compositions which use modern romantic vocabulary"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'con em bồng' with extremely soft, warm vocal quality - think lullaby tenderness vs. passionate intensity",
          "Slight ritardando (slowing) on this phrase - let tender image linger and resonate",
          "Vocal: use head voice or mixed register for lightness, suggesting precious delicate beloved",
          "Dynamic: piano to pianissimo - whispering quality conveys intimacy and protective care",
          "Optional gesture: cradle arms as if holding baby, gaze down tenderly - embody parental care metaphor",
          "Facial expression: soft smile with eyes slightly closed, conveying protective loving devotion"
        ],

        "culturalSensitivity": [
          "Child-metaphor in Vietnamese romance is culturally appropriate tender imagery - NOT infantilizing or demeaning",
          "Understand Vietnamese cultural value: best romantic love combines passion AND familial nurturing care",
          "Recognize gender dynamics: traditionally male speaker uses 'con em bồng' for female beloved - heteronormative frame but language adapts to LGBTQ+ contexts",
          "Avoid Western projection: this is not 'daddy/baby' dynamic with power imbalance - it's mutual tenderness and protection ideal",
          "For cross-cultural performance: frame as culturally-grounded protective love imagery, not universal metaphor",
          "Respect Northern regional identity: this is Northern poetic heritage, not pan-Vietnamese - acknowledge geographic specificity"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach classifier system - 'con' for small living things (con chim=bird, con mèo=cat, con người=person-child). Explain intimate/diminutive function.",
          "Step 2: Explain kinship pronoun 'em' (younger sibling) used as romantic term - cultural fusion of familial and romantic language",
          "Step 3: Teach verb 'bồng' (carry in arms) - demonstrate gesture of cradling baby/child tenderly",
          "Step 4: Explain cultural concept: Vietnamese romantic ideal combines passionate love AND parental protective care (not separate)",
          "Step 5: Compare to English: 'sweetheart,' 'baby' use child-imagery but less explicitly protective. 'Con em bồng' more visceral with action (carrying).",
          "Step 6: Show 3-5 other Northern folk songs using protective/parental imagery in romance to establish cultural pattern",
          "Step 7: Practice singing with appropriate tender vocal quality and optional gesture to embody protective love"
        ],

        "commonMisinterpretations": [
          "❌ 'Infantilizing or condescending to beloved' → ✅ Culturally-valued tender protective love combining romance and parental devotion - Vietnamese ideal",
          "❌ 'Weird/creepy to mix child and romantic imagery' → ✅ Vietnamese cultural norm fusing familial and romantic affect - not taboo but sophisticated emotional integration",
          "❌ 'Con em means just a small young person' → ✅ Con (animacy classifier) + em (romantic pronoun) + bồng (tender action) = fixed folk formula with conventional romantic meaning",
          "❌ 'Modern Vietnamese equivalent' → ✅ Archaic Northern folk formula - no direct modern equivalent. Contemporary songs use 'em yêu' (beloved you) instead.",
          "❌ 'Unequal power dynamic' → ✅ Mutual tenderness ideal - singer wants to protect beloved, who in turn offers trust and affection. Asymmetric in role but balanced in devotion."
        ]
      }
    },

    {
      "expression": "mang sách",
      "literal": "carry books",
      "meaning": "pursuing education, aspiring to scholarly status and social advancement",

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Metonymically represents Vietnamese Confucian examination system (thi Hương, thi Hội, thi Đình) dating back to 11th century Lý dynasty, reaching peak during Lê dynasty (15th-18th centuries). Books symbolized path to mandarin class and escape from peasant life.",

        "regionalSpecificity": 3,
        "explanation": "Pan-Vietnamese and East Asian cultural reference. Examination culture shared across Vietnam, China, Korea. 'Carrying books' imagery universal across regions, though exam success rates varied geographically (Northern elites dominated).",

        "symbolicLoad": 9,
        "explanation": "Extremely rich symbolism: (1) Books metonymically represent entire scholarly pursuit, (2) Physical carrying signifies burden and dedication, (3) Social mobility hope (peasant → mandarin), (4) Confucian value system (learning = virtue), (5) Family honor (one scholar elevates entire clan).",

        "ritualSignificance": 7,
        "explanation": "Tied to examination rituals: pre-exam temple worship, post-success celebration parades (rước cử nhân), and ancestral offerings. Book-carrying scholars received special respect in villages - quasi-ritual social status.",

        "transmissionImportance": 9,
        "explanation": "Critical for understanding Vietnamese historical social structure and cultural values. Examination system shaped Vietnamese literature, philosophy, and social hierarchy for 900 years. Losing this reference erases understanding of traditional aspiration and class mobility.",

        "emotionalResonance": 8,
        "explanation": "Evokes complex emotions: ambition, parental hope, sacrifice for education, anxiety about exams, and ironic recognition of frequent failure. Particularly resonant for Vietnamese diaspora valuing education as path to success."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "(1) Literal physical action (carrying books), (2) Metonymic representation (books stand for entire education pursuit), (3) Social aspiration (class mobility through examination), (4) Cultural value system (Confucian learning ideal). Multiple interpretive dimensions.",

        "crossDomainMapping": 7,
        "explanation": "Metonymic mapping: PHYSICAL_OBJECT → ABSTRACT_PURSUIT. Books (concrete) represent education, social advancement, and cultural values (abstract). Requires understanding Vietnamese examination culture and social hierarchy.",

        "culturalPrerequisites": 8,
        "explanation": "Substantial prerequisites: (1) Knowledge of Confucian examination system, (2) Understanding of feudal Vietnamese social classes, (3) Awareness of books' scarcity and value in pre-modern Vietnam, (4) Historical context of examination failure rates (90%+ failed).",

        "idiomaticity": 8,
        "explanation": "Highly conventionalized metonymic expression. 'Mang sách' frozen as formula meaning 'pursue education.' Cannot literally mean just 'physically transporting books' in folk song context. Learners must know cultural meaning beyond compositional translation.",

        "contextDependence": 4,
        "explanation": "Relatively stable meaning across contexts. In folk songs, 'mang sách' consistently means scholarly pursuit. However, tone varies: prideful (successful student), mocking (unsuccessful student), hopeful (aspiring youth).",

        "pedagogicalChallenge": 7,
        "explanation": "Challenging: (1) Teaching metonymic principle (part for whole), (2) Explaining examination system unfamiliar to modern/Western learners, (3) Conveying social significance of literacy in pre-modern Vietnam, (4) Distinguishing literal vs. conventional meaning."
      },

      "semanticNetwork": {
        "sourceDomain": "PHYSICAL_OBJECT",
        "targetDomain": "SOCIAL_ASPIRATION",
        "mappings": [
          {
            "source": "books (physical items)",
            "target": "education and scholarship (abstract knowledge)"
          },
          {
            "source": "carrying/transporting books",
            "target": "pursuing scholarly path (ongoing effort)"
          },
          {
            "source": "weight of books",
            "target": "burden and sacrifice of study"
          },
          {
            "source": "books' scarcity and value",
            "target": "education's prestige and rarity"
          }
        ],
        "conceptualMetaphor": "EDUCATION_IS_VALUABLE_CARGO"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears in phrases 3 and 5 (questions/refrain) at similar positions. Positioned in question context: 'Đi đâu mang sách...' - creates query about scholarly pursuit.",

        "syntacticRole": "verb_phrase",
        "explanation": "Verbal phrase: 'mang sách' (carry books) functions as predicate. In phrase 3: 'Đi đâu mà sách đi hoài' (Where going with books constantly). In phrase 5: 'Đi đâu mang sách đi hoài.'",

        "discourseFunction": "questioning_action",
        "explanation": "Establishes central question of song: why persistent book-carrying without success? Sets up ironic examination of scholarly failure theme.",

        "participationPattern": "rhetorical_question",
        "explanation": "Question format invites audience agreement/recognition - everyone knows someone who studied endlessly without passing exams. Communal knowing smile at familiar social pattern.",

        "emotionalValence": "mildly_ironic",
        "explanation": "Mixed valence: respect for educational pursuit tempered by teasing about lack of success. Gentle mockery without cruelty - Vietnamese cultural acceptance of exam failure as common fate."
      },

      "statistics": {
        "occurrences": 2,
        "phraseIds": [3, 5],
        "totalPhrases": 8,
        "coverage": "25%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 2,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 2,
        "explanation": "Extremely common Vietnamese folk song and proverb formula. Appears in dozens of songs mocking unsuccessful scholars, and in everyday speech about education. Not unique at all.",

        "similarExpressions": [
          {
            "expression": "gánh sách (shoulder books with carrying pole)",
            "similarity": "high",
            "difference": "Gánh sách emphasizes heavier burden (pole + baskets); mang sách more general carrying. Both mean pursuing education."
          },
          {
            "expression": "ôm sách (embrace/hug books)",
            "similarity": "high",
            "difference": "Ôm sách suggests closer relationship with books (embracing); mang sách more neutral carrying action."
          },
          {
            "expression": "cầm bút (hold writing brush)",
            "similarity": "medium",
            "difference": "Cầm bút focuses on writing/literary production; mang sách on studying/learning. Related but different emphasis."
          }
        ],

        "regionalDistribution": "Nationwide - Northern, Central, Southern folk songs all use 'mang sách' metaphor for education",
        "genreDistribution": "Folk songs mocking scholars, social commentary songs, educational proverbs - any context discussing examination culture",
        "historicalPersistence": "Ancient to present - documented in medieval folk songs, still used in contemporary Vietnamese to mean 'pursue education.' Examination system abolished 1919 but metaphor persists."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'mang sách' with slightly strained vocal quality - suggest physical and mental burden of study",
          "Facial expression: mix of determination and weariness - captures persistent effort without success",
          "Optional gesture: mime carrying books under arm or in bag, with slight shoulder sag showing weight",
          "Dynamic: slightly louder/more emphasized than surrounding words - this is central image of song",
          "Rhythm: precise, methodical delivery matching repetitive nature of endless studying"
        ],

        "culturalSensitivity": [
          "Vietnamese examination culture was brutally competitive - 90%+ failure rate meant 'mang sách' often ended in disappointment",
          "Respect class dimension: only families wealthy enough to spare sons from labor could afford book-carrying",
          "Acknowledge gender exclusion: examination system 99% male - 'mang sách' typically masculine activity until 20th century",
          "Recognize colonial impact: French abolished examination system 1919, ending 900-year tradition",
          "For diaspora: 'mang sách' may evoke immigrant parents' education sacrifices - handle with emotional awareness"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach literal meaning - mang = carry, sách = books. Practice vocabulary.",
          "Step 2: Explain metonymic principle: books represent entire education pursuit (part for whole)",
          "Step 3: Historical context: show examination system diagram (thi Hương → thi Hội → thi Đình levels)",
          "Step 4: Statistics: explain 90%+ failure rates to contextualize song's irony",
          "Step 5: Compare English: 'hitting the books' also uses book metonymy but less culturally loaded",
          "Step 6: Show 3-5 other Vietnamese songs/proverbs using 'mang sách' to establish conventional pattern",
          "Step 7: Discuss modern persistence: why Vietnamese still say 'mang sách' when exams different today?"
        ],

        "commonMisinterpretations": [
          "❌ 'Just literally carrying books to school' → ✅ Metonymic representation of entire scholarly pursuit and social aspiration in feudal examination system",
          "❌ 'Positive image of studious person' → ✅ In this song, ironic/teasing - book-carrying without results (failed exams)",
          "❌ 'Modern university education' → ✅ Specifically references traditional Confucian examination system (abolished 1919) - historical not contemporary context",
          "❌ 'Books were common/cheap' → ✅ Pre-modern Vietnam: books extremely rare, expensive, hand-copied - carrying books signaled family wealth and privilege"
        ]
      }
    },

    {
      "expression": "đi hoài",
      "literal": "go constantly / go endlessly",
      "meaning": "habitual persistent action without cessation, with mild teasing tone",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Temporal/aspectual marker in Vietnamese folk songs from at least 18th-19th centuries. 'Hoài' (endlessly) appears in ca dao documenting repetitive actions - farming cycles, ritual repetitions, persistent courtship. Grammaticalized from verb 'hoài' (to long for) to aspect marker (continuously).",

        "regionalSpecificity": 4,
        "explanation": "Broader Vietnamese usage but with Northern folk song associations. 'Đi hoài' common across regions in everyday speech, but as folk song formula particularly Northern. Central/Southern may use 'đi mãi,' 'đi luôn.'",

        "symbolicLoad": 5,
        "explanation": "Moderate symbolism: (1) Literal endless action, (2) Futility/persistence without result, (3) Gentle mockery of repetitive behavior. In this song, symbolizes hopeless exam persistence - studying continuously without passing.",

        "ritualSignificance": 2,
        "explanation": "No direct ritual significance. However, 'hoài' does appear in Buddhist contexts (samsara cycle, endless rebirth) - philosophical parallel to futile repetition.",

        "transmissionImportance": 6,
        "explanation": "Important for teaching Vietnamese aspectual system (habitual/continuous markers). 'Hoài' is one of several temporal particles (hoài, mãi, luôn, suốt) with subtle differences - preserves linguistic diversity.",

        "emotionalResonance": 7,
        "explanation": "Evokes sympathetic frustration - audience recognizes futile persistence from own experience. Teasing tone softens criticism while acknowledging universal pattern of effort without reward."
      },

      "complexityMetrics": {
        "layersOfMeaning": 2,
        "explanation": "(1) Literal temporal meaning (continuously, endlessly), (2) Pragmatic meaning (with connotation of futility, mild teasing). Relatively straightforward once aspectual grammar understood.",

        "crossDomainMapping": 3,
        "explanation": "Minimal metaphorical mapping. Primarily grammatical/aspectual marker with pragmatic connotations. Not complex conceptual metaphor.",

        "culturalPrerequisites": 4,
        "explanation": "Moderate prerequisites: (1) Understanding Vietnamese aspectual particle system, (2) Recognizing folk song teasing conventions, (3) Awareness of exam failure as cultural reality (90%+ failure rate). Accessible with basic cultural context.",

        "idiomaticity": 6,
        "explanation": "Semi-fixed construction. 'Đi hoài' somewhat compositional (đi = go, hoài = endlessly) but conventionalized as unit meaning 'keep going without purpose/result.' Some substitutability (đi mãi, đi luôn) with subtle differences.",

        "contextDependence": 5,
        "explanation": "Moderately context-dependent. Core meaning (continuous action) stable, but pragmatic force varies: neutral description vs. teasing/mocking depending on context. This song clearly teasing given exam failure theme.",

        "pedagogicalChallenge": 5,
        "explanation": "Moderate challenge: (1) Teaching aspectual particle grammar (unfamiliar to English speakers lacking continuous markers), (2) Explaining teasing pragmatics (how grammar encodes social attitudes), (3) Distinguishing 'hoài' from similar particles (mãi, luôn)."
      },

      "semanticNetwork": {
        "sourceDomain": "TEMPORAL_DURATION",
        "targetDomain": "FUTILE_PERSISTENCE",
        "mappings": [
          {
            "source": "endless temporal extension (hoài)",
            "target": "futile effort (continuous but fruitless)"
          },
          {
            "source": "repetitive cyclical action (đi đi hoài hoài)",
            "target": "pointless persistence (same action, no progress)"
          },
          {
            "source": "unbroken continuity",
            "target": "stubborn dedication despite failure"
          }
        ],
        "conceptualMetaphor": "CONTINUOUS_ACTION_IS_FUTILE_CYCLE"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Appears at end of phrases 3 and 5 (question/refrain). Terminal position gives 'hoài' strong pragmatic force - leaves audience with impression of endless futility.",

        "syntacticRole": "aspectual_marker",
        "explanation": "Aspectual particle modifying verb 'đi' (go): 'đi hoài' = go continuously/endlessly. Grammatical function indicating habitual/continuous aspect.",

        "discourseFunction": "teasing_emphasis",
        "explanation": "Adds mild mocking tone to question. Not just 'where are you going?' but 'where are you CONSTANTLY going (with no result)?' Emphasizes futility of persistent book-carrying.",

        "participationPattern": "sympathetic_recognition",
        "explanation": "Audience recognizes familiar pattern - we all know someone who persists fruitlessly. 'Hoài' invites knowing nods and sympathetic laughter at human stubbornness.",

        "emotionalValence": "teasing_sympathetic",
        "explanation": "Mixed valence: gentle mockery tempered by sympathy. Not cruel ridicule but affectionate teasing of persistent effort despite failure. Vietnamese cultural acceptance of effort even without success."
      },

      "statistics": {
        "occurrences": 2,
        "phraseIds": [3, 5],
        "totalPhrases": 8,
        "coverage": "25%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 2
        }
      },

      "comparativeContext": {
        "uniquenessScore": 3,
        "explanation": "Common Vietnamese aspectual construction. 'Đi hoài' appears frequently in everyday speech and folk songs. Not unique but characteristic of Northern folk style.",

        "similarExpressions": [
          {
            "expression": "đi mãi (go always/forever)",
            "similarity": "high",
            "difference": "Mãi suggests eternity/permanence; hoài suggests endless repetition. Mãi more neutral, hoài slightly more teasing."
          },
          {
            "expression": "đi luôn (go continuously)",
            "similarity": "high",
            "difference": "Luôn emphasizes unbroken continuity; hoài emphasizes cyclical repetition. Luôn more neutral, hoài more colloquial."
          },
          {
            "expression": "cứ đi (keep going)",
            "similarity": "medium",
            "difference": "Cứ marks pure persistence; hoài adds temporal endlessness. Cứ more encouraging, hoài more observational/teasing."
          }
        ],

        "regionalDistribution": "Nationwide but with Northern folk song associations. Central uses more 'mãi,' Southern more 'luôn.'",
        "genreDistribution": "Folk songs (especially teasing/mocking songs), everyday conversation, any context describing persistent futile action",
        "historicalPersistence": "Pre-modern to present - documented in 18th-19th century ca dao, still common in contemporary spoken Vietnamese."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'đi hoài' with slight vocal sigh or exasperated tone - convey 'oh here we go again' feeling",
          "Facial expression: raised eyebrow or knowing smile - signal gentle teasing not harsh mockery",
          "Slight head shake on 'hoài' (optional) - physical gesture of bemused recognition",
          "Dynamic: slightly softer on 'hoài' with falling pitch - suggests trailing off in resignation/amusement",
          "Timing: brief pause before 'hoài' - lets audience anticipate the teasing punchline"
        ],

        "culturalSensitivity": [
          "Hoài's teasing tone is affectionate not cruel in Vietnamese culture - important distinction for cross-cultural performers",
          "Recognize examination failure as statistically normal (90%+ failed) - teasing comes from shared experience not judgment",
          "Understand Vietnamese cultural value: effort/persistence respected even without results ('có công mài sắt có ngày nên kim')",
          "Avoid making 'hoài' sound contemptuous - Vietnamese teasing maintains social face through indirectness",
          "For modern audiences: connect to contemporary persistence (studying for SAT, grad school applications) - same futility anxiety"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach aspectual particle system - show spectrum: lúc (sometimes), thường (often), luôn (always), mãi/hoài (endlessly)",
          "Step 2: Explain 'hoài' etymology: verb 'to long for' → grammaticalized to 'endlessly' marker",
          "Step 3: Contrast with similar particles: hoài (cyclical repetition) vs. mãi (eternal) vs. luôn (continuous)",
          "Step 4: Practice pragmatics: neutral 'đi luôn' vs. teasing 'đi hoài' - same grammar, different social meaning",
          "Step 5: Show 5+ examples from folk songs and conversation using 'hoài' to establish pattern",
          "Step 6: Role-play: students practice delivering 'đi hoài' with appropriate teasing but sympathetic tone"
        ],

        "commonMisinterpretations": [
          "❌ 'Harsh criticism of persistence' → ✅ Gentle affectionate teasing with underlying sympathy - Vietnamese cultural acceptance of futile effort",
          "❌ 'Hoài means exactly same as always/forever' → ✅ Hoài specifically suggests cyclical endless repetition with connotation of futility - not just neutral temporal extension",
          "❌ 'Can substitute any continuous marker' → ✅ Hoài has specific pragmatic force (teasing) that luôn (neutral) and mãi (romantic/eternal) lack",
          "❌ 'Modern invention' → ✅ Documented in pre-modern Vietnamese folk songs - historical aspectual marker with enduring usage"
        ]
      }
    },

    {
      "expression": "Cử nhân",
      "literal": "elevated person / recommended person",
      "meaning": "Bachelor's degree holder in Confucian examination system - first scholarly rank above common people",

      "culturalWeights": {
        "historicalDepth": 10,
        "explanation": "First examination tier (thi Hương) established 1075 under Lý dynasty, continued until French abolition 1919. Cử nhân represented 900 years of social mobility through education in feudal Vietnam.",

        "regionalSpecificity": 3,
        "explanation": "Pan-Vietnamese and broader East Asian cultural reference. Examination degrees shared across China, Korea, Vietnam with similar names (舉人 jǔrén in Chinese). All regions aspired to cử nhân status, though Northern elites dominated historically.",

        "symbolicLoad": 10,
        "explanation": "Extremely rich symbolism: (1) Escape from peasant labor to scholar-official class, (2) Family honor (one degree elevates entire clan), (3) Economic security (tax exemptions, land grants), (4) Social prestige (special clothing, seating), (5) Marriage prospects (prestigious matches), (6) Political power (path to mandarin position).",

        "ritualSignificance": 9,
        "explanation": "Passing cử nhân exam triggered major rituals: (1) Victory parade (rước cử nhân) through village with drums and banners, (2) Temple offerings to ancestors and Confucius, (3) Feast for entire village, (4) Special hat and robe ceremony. Failure also had mourning-like rituals.",

        "transmissionImportance": 10,
        "explanation": "CRITICAL for understanding Vietnamese historical social structure, educational values, and class mobility. Examination system shaped entire society for 900 years. Modern Vietnamese still say 'cử nhân' for bachelor's degree - term persists despite system's end.",

        "emotionalResonance": 9,
        "explanation": "Evokes powerful complex emotions: (1) Parental hope and sacrifice, (2) Anxiety about exams, (3) Pride if passed, (4) Shame if failed, (5) Ironic recognition of frequent failure, (6) Modern diaspora connection to education as path to success."
      },

      "complexityMetrics": {
        "layersOfMeaning": 5,
        "explanation": "(1) Literal historical degree (examination rank), (2) Social class marker (scholar vs. peasant), (3) Economic status (tax exemption holder), (4) Family honor symbol (ancestral pride), (5) Modern ironic reference (studying endlessly without success). Multiple historical and contemporary interpretations.",

        "crossDomainMapping": 8,
        "explanation": "Complex metonymic/symbolic mapping: ACADEMIC_TITLE → SOCIAL_CLASS_TRANSFORMATION. Cử nhân (examination degree) represents entire social mobility system - education, wealth, power, prestige. Requires deep understanding of feudal Vietnamese social hierarchy.",

        "culturalPrerequisites": 9,
        "explanation": "Substantial prerequisites: (1) Knowledge of 3-tier examination system (Hương → Hội → Đình), (2) Understanding feudal class structure (peasant → scholar-official), (3) Awareness of pass rates (~5% for cử nhân), (4) Historical context (900-year system, French abolition 1919), (5) Modern term persistence (bachelor's degree equivalent).",

        "idiomaticity": 9,
        "explanation": "Highly frozen cultural-historical term. Cannot translate compositionally - 'cử' (recommend) + 'nhân' (person) doesn't convey examination degree meaning. Must be learned as cultural-historical concept with entire social system context.",

        "contextDependence": 7,
        "explanation": "Moderately context-dependent. Core meaning (examination degree) stable, but pragmatic force varies: (1) Historical pride (successful candidate), (2) Contemporary irony (studying without results), (3) Modern usage (bachelor's degree), (4) Social critique (education obsession). This song clearly ironic given 'đi hoài' (endlessly going).",

        "pedagogicalChallenge": 9,
        "explanation": "Extremely challenging: (1) Teaching entire examination system (3 levels, pass rates, historical span), (2) Explaining feudal social hierarchy unfamiliar to modern/Western learners, (3) Conveying emotional weight (life-changing success vs. devastating failure), (4) Connecting historical term to modern Vietnamese education obsession."
      },

      "semanticNetwork": {
        "sourceDomain": "EXAMINATION_DEGREE",
        "targetDomain": "SOCIAL_TRANSFORMATION",
        "mappings": [
          {
            "source": "passing examination (academic achievement)",
            "target": "changing social class (peasant → scholar-official)"
          },
          {
            "source": "degree title (cử nhân)",
            "target": "family honor and prestige (ancestral pride)"
          },
          {
            "source": "exam preparation (years of study)",
            "target": "sacrifice and hope (parental investment)"
          },
          {
            "source": "failure rate (95%)",
            "target": "universal disappointment (social reality)"
          }
        ],
        "conceptualMetaphor": "EDUCATION_IS_SOCIAL_LADDER"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears in phrase 4 (id:4) at word positions 2-3. Positioned in rhetorical question: 'Cử nhân không thi đỗ' (Cử nhân doesn't pass exams) - creates paradox/irony.",

        "syntacticRole": "subject_noun",
        "explanation": "Subject of clause: 'Cử nhân không thi đỗ' (Cử nhân [who] doesn't pass exams). Functions as noun phrase representing examination candidate.",

        "discourseFunction": "ironic_questioning",
        "explanation": "Sets up central paradox of song: someone carrying books (mang sách) to become cử nhân but never passing exams. Question implies futility of endless studying without results.",

        "participationPattern": "sympathetic_irony",
        "explanation": "Audience recognizes familiar social type - the perpetual student who never succeeds. Knowing laughter at shared experience of examination culture's harsh reality (95% failure rate).",

        "emotionalValence": "ironic_sympathetic",
        "explanation": "Mixed valence: gentle mockery tempered by deep sympathy. Vietnamese culture respects effort even without success - 'cử nhân không thi đỗ' is ironic but not cruel. Reflects social acceptance of exam failure as statistical norm."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [4],
        "totalPhrases": 8,
        "coverage": "12.5%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 2,
        "explanation": "Common Vietnamese folk song and proverb reference. 'Cử nhân không thi đỗ' is proverbial expression appearing in multiple songs mocking examination culture. Not unique at all.",

        "similarExpressions": [
          {
            "expression": "Tú tài (laureate degree - second tier)",
            "similarity": "high",
            "difference": "Tú tài is higher examination rank than cử nhân. Both represent scholarly aspiration, but tú tài more prestigious and rarer (~1% pass rate vs. ~5%)."
          },
          {
            "expression": "Thái học sinh (imperial academy student)",
            "similarity": "medium",
            "difference": "Thái học sinh refers to students studying at Quốc Tử Giám (imperial academy), not degree holders. Related to examination system but different status."
          },
          {
            "expression": "Tiến sĩ (doctoral degree - highest tier)",
            "similarity": "medium",
            "difference": "Tiến sĩ is highest examination rank (thi Đình), extremely rare (<0.1% of candidates). Cử nhân is lowest degree tier - more accessible but still difficult."
          }
        ],

        "regionalDistribution": "Nationwide - Northern, Central, Southern folk songs all reference cử nhân examination culture",
        "genreDistribution": "Social commentary songs, mocking songs about scholars, educational proverbs - any context critiquing examination obsession",
        "historicalPersistence": "Medieval to present - documented in pre-modern folk songs, term persists in modern Vietnamese for bachelor's degree. Examination system abolished 1919 but cultural memory endures."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'Cử nhân' with slight emphasis and raised pitch - signal this is key ironic term",
          "Facial expression: knowing smile or raised eyebrow - convey gentle mockery not harsh criticism",
          "Slight pause after 'Cử nhân' before 'không thi đỗ' - let paradox register with audience",
          "Vocal quality: mix respect (for examination aspiration) with irony (for perpetual failure)",
          "Optional gesture: mime adjusting scholarly hat or holding books - embody scholar identity before revealing failure"
        ],

        "culturalSensitivity": [
          "Cử nhân represents 900 years of Vietnamese social structure - not trivial historical detail",
          "Respect class dimension: only wealthy families could afford sons to study (peasants needed labor)",
          "Acknowledge gender exclusion: 99.9% male system until 20th century - examination culture gendered",
          "Recognize colonial impact: French abolished system 1919, ending traditional path to power",
          "For diaspora: 'cử nhân' connects to immigrant education obsession - handle with awareness of parental sacrifice",
          "Understand irony as affectionate: Vietnamese culture values effort without success - 'có công mài sắt có ngày nên kim'"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach literal meaning - cử (recommend) + nhân (person) = recommended/elevated person",
          "Step 2: Historical context - show 3-tier examination system diagram (Hương → Hội → Đình)",
          "Step 3: Pass rate statistics - explain 95% failure rate to convey difficulty and universal failure experience",
          "Step 4: Social transformation - describe peasant → scholar-official class change (tax exemption, land grants, political power)",
          "Step 5: Ritual significance - show images of rước cử nhân parade (victory celebration)",
          "Step 6: Modern persistence - explain 'cử nhân' still used for bachelor's degree in contemporary Vietnamese",
          "Step 7: Song irony - analyze 'Cử nhân không thi đỗ' paradox (degree holder who never passed exam) as gentle social critique"
        ],

        "commonMisinterpretations": [
          "❌ 'Just means bachelor's degree like modern university' → ✅ Historical examination degree with profound social class implications - not equivalent to modern BA/BS",
          "❌ 'Easy to achieve' → ✅ 95% failure rate - most candidates studied entire lives without success",
          "❌ 'Harsh mockery of failed students' → ✅ Gentle affectionate irony - Vietnamese culture respects effort even without results",
          "❌ 'Cử nhân were common scholars' → ✅ Rare privileged class (5% pass rate) with enormous social prestige - tax exemptions, special clothing, political access",
          "❌ 'Modern irrelevant term' → ✅ Term persists in contemporary Vietnamese ('cử nhân' = bachelor's degree) - cultural memory of examination system endures"
        ]
      }
    },

    {
      "expression": "Tú tài",
      "literal": "outstanding talent / excellent scholar",
      "meaning": "Laureate degree holder in Confucian examination system - second scholarly rank, more prestigious than cử nhân",

      "culturalWeights": {
        "historicalDepth": 10,
        "explanation": "Second-tier examination (thi Hội) established alongside cử nhân under Lý dynasty, continuing until 1919. Tú tài represented even rarer achievement than cử nhân - ~1% pass rate vs. ~5%. Higher prestige and closer path to mandarinate.",

        "regionalSpecificity": 3,
        "explanation": "Pan-Vietnamese and East Asian reference. Tú tài (秀才 xiùcái in Chinese) existed across China, Korea, Vietnam. All regions aspired to this rank, though achievement concentrated among Northern elites near capital Thăng Long/Hanoi.",

        "symbolicLoad": 10,
        "explanation": "Even richer symbolism than cử nhân: (1) Greater social transformation (peasant → near-mandarin class), (2) Higher family honor (rare achievement brings greater prestige), (3) Stronger economic security (larger land grants, higher tax exemptions), (4) Political proximity (direct path to administrative posts), (5) Marriage into elite families, (6) Cultural authority (poetry, calligraphy, teaching roles).",

        "ritualSignificance": 10,
        "explanation": "Passing tú tài triggered even more elaborate rituals than cử nhân: (1) Multi-day village celebration with theater performances, (2) Temple offerings to Confucius and Văn Xương (god of literature), (3) Ceremonial robe and official seal, (4) Ancestral altar enshrinement of degree plaque, (5) Regional fame (name engraved on temple steles).",

        "transmissionImportance": 10,
        "explanation": "CRITICAL for understanding Vietnamese historical elite formation and cultural values. Tú tài degree represented pinnacle of social aspiration for most families (tiến sĩ doctoral rank too rare to realistically pursue). Understanding this tier essential to grasp feudal social structure.",

        "emotionalResonance": 10,
        "explanation": "Evokes most intense emotions: (1) Ultimate parental pride if achieved, (2) Devastating shame if failed after years of study, (3) Ironic recognition of near-impossibility (1% pass rate), (4) Modern resonance with competitive exams (university entrance, civil service), (5) Diaspora connection to educational sacrifice."
      },

      "complexityMetrics": {
        "layersOfMeaning": 5,
        "explanation": "(1) Literal examination degree (second tier), (2) Social elite marker (near-mandarin status), (3) Rare achievement symbol (1% success rate), (4) Family legacy (ancestral honor), (5) Ironic impossibility (song context: never achieved despite study). Multiple historical and emotional layers.",

        "crossDomainMapping": 9,
        "explanation": "Highly complex mapping: ACADEMIC_ACHIEVEMENT → ELITE_STATUS. Tú tài (degree) represents transformation from commoner to cultural-political elite. Requires understanding: (1) Examination tiers, (2) Social hierarchy, (3) Administrative system, (4) Cultural prestige mechanisms. More abstract than cử nhân (higher rarity = more symbolic).",

        "culturalPrerequisites": 10,
        "explanation": "Maximum prerequisites: (1) Knowledge of 3-tier system with pass rates, (2) Understanding social class distinctions (scholar-official vs. mandarin), (3) Awareness of economic privileges (land, tax, salaries), (4) Historical context (900 years, French abolition), (5) Cultural status (poetry, calligraphy authority), (6) Modern persistence in Vietnamese language.",

        "idiomaticity": 10,
        "explanation": "Extremely frozen cultural-historical term. 'Tú' (outstanding) + 'tài' (talent) compositionally suggests 'talented person' but culturally means specific examination rank. Cannot substitute modern terms without losing historical weight. Must be learned as entire cultural system concept.",

        "contextDependence": 7,
        "explanation": "Context-dependent pragmatics: (1) Historical pride (successful candidate - extremely rare), (2) Contemporary irony (unachievable goal), (3) Modern usage (sometimes used for excellent student), (4) Social critique (impossible standards). In this song, clearly ironic impossibility given pairing with 'cử nhân không thi đỗ.'",

        "pedagogicalChallenge": 10,
        "explanation": "MAXIMUM challenge: (1) Teaching 3-tier system with nuanced differences, (2) Explaining rarity through statistics (1% vs. 5% vs. 0.1%), (3) Conveying prestige hierarchy (why tú tài > cử nhân), (4) Historical context (900 years of social structure), (5) Emotional weight (ultimate achievement vs. crushing failure), (6) Modern resonances without anachronism."
      },

      "semanticNetwork": {
        "sourceDomain": "ELITE_EXAMINATION_DEGREE",
        "targetDomain": "SOCIAL_ELITE_TRANSFORMATION",
        "mappings": [
          {
            "source": "passing second-tier exam (rare achievement)",
            "target": "entering cultural-political elite (near-mandarin class)"
          },
          {
            "source": "tú tài title (official rank)",
            "target": "family legacy and regional fame (ancestral glory)"
          },
          {
            "source": "exam difficulty (1% pass rate)",
            "target": "impossibility for most families (social reality)"
          },
          {
            "source": "years of preparation (often decade+)",
            "target": "family sacrifice and economic burden (peasant labor lost)"
          }
        ],
        "conceptualMetaphor": "ACADEMIC_EXCELLENCE_IS_ELITE_STATUS"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears in phrase 6 (id:6) at word positions 2-3. Positioned in parallel structure with 'Cử nhân' (phrase 4): both degrees mentioned, both ironically impossible to achieve.",

        "syntacticRole": "subject_noun",
        "explanation": "Subject of clause: 'Tú tài cũng không' (Tú tài also doesn't [pass]). Parallel construction to 'Cử nhân không thi đỗ' - reinforces ironic pattern.",

        "discourseFunction": "intensified_irony",
        "explanation": "Escalates irony from phrase 4: not only can't achieve cử nhân (lower tier), also can't achieve tú tài (higher tier). Double impossibility emphasizes futility of endless studying.",

        "participationPattern": "knowing_recognition",
        "explanation": "Audience recognizes escalating irony - if can't pass cử nhân (5% rate), definitely can't pass tú tài (1% rate). Shared laughter at social reality of examination culture's brutal difficulty.",

        "emotionalValence": "heightened_ironic_sympathy",
        "explanation": "More intense than 'Cử nhân' irony - tú tài is even rarer, so claiming to pursue it while failing cử nhân is absurd. Yet still sympathetic given cultural pressure to aspire higher despite impossible odds."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [6],
        "totalPhrases": 8,
        "coverage": "12.5%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 3,
        "explanation": "Common folk song reference but less frequent than 'cử nhân.' Tú tài appears in examination-mocking songs and proverbs. Moderately common but more specific than cử nhân (not everyone aspired to second tier).",

        "similarExpressions": [
          {
            "expression": "Cử nhân (first-tier degree)",
            "similarity": "high",
            "difference": "Tú tài is higher rank (1% vs. 5% pass rate) with greater prestige and privilege. Both represent scholarly aspiration but different achievement levels."
          },
          {
            "expression": "Tiến sĩ (third-tier doctoral degree)",
            "similarity": "high",
            "difference": "Tiến sĩ is highest rank (<0.1% pass rate), even rarer than tú tài. Tú tài is intermediate tier - more achievable than tiến sĩ but rarer than cử nhân."
          },
          {
            "expression": "Bảng nhãn (second-place tiến sĩ)",
            "similarity": "medium",
            "difference": "Bảng nhãn is specific rank within tiến sĩ tier (榜眼 - 'eye of the list'). More prestigious than tú tài but same examination level (thi Đình)."
          }
        ],

        "regionalDistribution": "Nationwide but with Northern elite associations - most tú tài historically from Red River Delta region near capital",
        "genreDistribution": "Examination critique songs, social commentary, elite satire - contexts discussing unattainable scholarly goals",
        "historicalPersistence": "Medieval to present - documented in classical literature, less common in modern Vietnamese than 'cử nhân' (modern usage: 'cử nhân' = bachelor's, 'tiến sĩ' = doctorate, 'tú tài' rarely used)"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'Tú tài' with even more emphasis than 'Cử nhân' - escalate ironic intensity",
          "Pitch slightly higher than 'Cử nhân' to convey hierarchical superiority of this degree",
          "Facial expression: exaggerated raised eyebrow or ironic smile - signal absurdity of claiming this higher rank",
          "Slight head shake on 'cũng không' (also doesn't) - physical gesture of impossibility",
          "Vocal quality: mix aspiration (higher goal) with resignation (even more impossible)"
        ],

        "culturalSensitivity": [
          "Tú tài represents even rarer achievement than cử nhân - 1% vs. 5% pass rate, understand statistical impossibility",
          "Respect class dimension: pursuing tú tài required years of family support only wealthy could afford",
          "Acknowledge regional inequality: Northern elites near capital dominated tú tài ranks (proximity to examination centers)",
          "Recognize gender/ethnic exclusion: 99.9% ethnic Kinh males - minorities and women barred",
          "For diaspora: understand connection to modern competitive exam anxiety (Ivy League, civil service) - same cultural pressure dynamic",
          "Frame irony as social critique, not individual mockery - song critiques system's impossibility, not student's effort"
        ],

        "pedagogicalApproach": [
          "Step 1: Review 3-tier system (Hương/cử nhân → Hội/tú tài → Đình/tiến sĩ) with pass rates (5% → 1% → 0.1%)",
          "Step 2: Explain prestige hierarchy - show privileges at each tier (land grants, tax exemptions, salary scales)",
          "Step 3: Statistical context - if 1,000 start studying, 50 pass cử nhân, only 10 pass tú tài",
          "Step 4: Historical examples - name famous tú tài from Vietnamese history (Nguyễn Trãi, Lê Quý Đôn)",
          "Step 5: Modern comparison - tú tài ≈ getting into Harvard/Oxford (elite achievement), cử nhân ≈ state university (good but less rare)",
          "Step 6: Song analysis - explain parallel structure: 'Cử nhân không' → 'Tú tài cũng không' = double impossibility for ironic effect"
        ],

        "commonMisinterpretations": [
          "❌ 'Same as cử nhân, just different name' → ✅ Higher tier with 5x rarer pass rate (1% vs. 5%) and greater prestige",
          "❌ 'Modern equivalent is master's degree' → ✅ No direct modern equivalent - second tier of historical 3-tier system, don't map to modern degrees",
          "❌ 'Anyone could try for tú tài' → ✅ Realistically only wealthy families could support decade+ of study required - class barrier",
          "❌ 'Song celebrates tú tài achievement' → ✅ Song is ironic - 'Tú tài cũng không' means CAN'T achieve it despite trying",
          "❌ 'Archaic irrelevant term' → ✅ Cultural memory persists - understanding tú tài essential to grasp Vietnamese educational values and social history"
        ]
      }
    },

    {
      "expression": "chẳng...mà...cũng không",
      "literal": "not...but...also not",
      "meaning": "neither...nor construction expressing double negation - systematic exclusion of all options",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Vietnamese negation syntax documented in classical Nôm literature and folk songs from 18th-19th centuries. Parallel negation structures reflect Chinese literary influence (不...也不...) adapted to Vietnamese grammar patterns.",

        "regionalSpecificity": 5,
        "explanation": "Pan-Vietnamese construction but with Northern folk song associations. Central/Southern variants exist ('không...mà...cũng chẳng'), but this specific pattern 'chẳng...mà...cũng không' characteristic of Northern ca dao.",

        "symbolicLoad": 7,
        "explanation": "Symbolic of absoluteness and futility: (1) Systematic exclusion (tried everything, succeeded at nothing), (2) Complete failure (no options work), (3) Rhetorical emphasis (speaker's frustration), (4) Logical exhaustion (all possibilities negated).",

        "ritualSignificance": 2,
        "explanation": "No direct ritual significance. However, parallel negation appears in Buddhist texts (neither this nor that - Middle Way philosophy) and Daoist sayings (not being, not non-being).",

        "transmissionImportance": 7,
        "explanation": "Important for preserving Vietnamese complex negation syntax. Teaching parallel negation helps learners master nuanced denial strategies beyond simple 'không.' Loss would flatten expressive range of Vietnamese negation system.",

        "emotionalResonance": 8,
        "explanation": "Evokes frustration, resignation, and ironic acceptance of futility. Parallel structure amplifies emotional impact - single negation = denial, double negation = despair. Particularly resonant in examination failure context (studied but didn't pass either degree)."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "(1) Literal double negation (not A, also not B), (2) Pragmatic exhaustion (all options tried and failed), (3) Rhetorical emphasis (speaker's frustration/irony). Relatively transparent syntactically but pragmatically nuanced.",

        "crossDomainMapping": 4,
        "explanation": "Moderate metaphorical mapping: LOGICAL_NEGATION → EMOTIONAL_FUTILITY. Parallel syntax (grammatical structure) conveys psychological state (despair/resignation). Syntactic parallelism mirrors conceptual completeness of failure.",

        "culturalPrerequisites": 6,
        "explanation": "Moderate prerequisites: (1) Understanding Vietnamese negation system (chẳng vs. không subtleties), (2) Recognizing parallel structure as rhetorical device, (3) Appreciation of Northern folk song syntax, (4) Context awareness (examination failure intensifies meaning).",

        "idiomaticity": 7,
        "explanation": "Semi-fixed construction. 'Chẳng...mà...cũng không' is conventional parallel negation formula. Some variation possible (không...nhưng...cũng chẳng) but this pattern most emphatic. Learners must recognize as syntactic template.",

        "contextDependence": 5,
        "explanation": "Moderately context-dependent. Core meaning (neither/nor) stable, but pragmatic force varies: neutral exclusion vs. frustrated impossibility depending on context. This song clearly frustrated futility (studied for both degrees, passed neither).",

        "pedagogicalChallenge": 7,
        "explanation": "Moderately challenging: (1) Teaching Vietnamese negation markers (chẳng, không, chả, chưa - nuanced differences), (2) Explaining parallel syntax (A...mà...B pattern), (3) Conveying pragmatic force (not just logical negation but emotional emphasis), (4) Distinguishing from other negation patterns."
      },

      "semanticNetwork": {
        "sourceDomain": "LOGICAL_NEGATION",
        "targetDomain": "COMPLETE_FAILURE",
        "mappings": [
          {
            "source": "first negation (chẳng X)",
            "target": "first failure (didn't achieve cử nhân)"
          },
          {
            "source": "second negation (cũng không Y)",
            "target": "second failure (also didn't achieve tú tài)"
          },
          {
            "source": "parallel structure (chẳng...cũng không)",
            "target": "systematic exhaustion (tried all options, succeeded at none)"
          },
          {
            "source": "connector 'mà' (but/yet)",
            "target": "ironic expectation violation (studied books but achieved neither goal)"
          }
        ],
        "conceptualMetaphor": "PARALLEL_NEGATION_IS_EXHAUSTIVE_FAILURE"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Appears across phrases 4-6, spanning multiple clauses. Opens with 'Cử nhân chẳng thi đỗ' (phrase 4), continues through phrase 5 connector 'mà', culminates 'Tú tài cũng không' (phrase 6). Multi-phrase syntactic unit.",

        "syntacticRole": "parallel_negation_construction",
        "explanation": "Complex multi-clause construction: [Subject1 + chẳng + VP1] + mà + [Subject2 + cũng không + VP2]. Functions as coordinated negation with emphatic parallel structure.",

        "discourseFunction": "emphatic_futility",
        "explanation": "Establishes complete failure through systematic negation. Not just 'didn't pass exam' but 'passed NEITHER lower degree NOR higher degree' - exhaustive impossibility for rhetorical/ironic effect.",

        "participationPattern": "sympathetic_recognition",
        "explanation": "Audience recognizes familiar pattern of complete examination failure. Parallel negation amplifies communal understanding - we all know someone who studied endlessly without ANY success at ANY level.",

        "emotionalValence": "frustrated_ironic",
        "explanation": "Complex valence: frustration at futility, irony at pretension (claiming to pursue degrees while failing all), sympathy for wasted effort. Parallel syntax intensifies emotional impact through structural repetition."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [4, 5, 6],
        "totalPhrases": 8,
        "coverage": "37.5%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 1,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 4,
        "explanation": "Common Vietnamese negation pattern but sophisticated parallel structure. 'Chẳng...mà...cũng không' appears in folk songs and everyday speech. Moderately common but rhetorically effective.",

        "similarExpressions": [
          {
            "expression": "không...cũng không (simpler negation)",
            "similarity": "high",
            "difference": "Không...cũng không lacks 'mà' connector and 'chẳng' (more emphatic negator). This expression adds rhetorical complexity with contrastive 'mà.'"
          },
          {
            "expression": "chả...chả... (informal parallel negation)",
            "similarity": "high",
            "difference": "Chả...chả... more colloquial/informal. Chẳng...cũng không more formal folk song register."
          },
          {
            "expression": "chẳng những...mà còn... (not only...but also)",
            "similarity": "medium",
            "difference": "Chẳng những...mà còn adds affirmation after negation (not only X but ALSO Y). This expression double negation (neither X nor Y)."
          }
        ],

        "regionalDistribution": "Nationwide but with Northern folk song associations. Central/Southern use slightly different markers ('hôn,' 'chi') but same parallel structure",
        "genreDistribution": "Folk songs emphasizing futility, ironic social commentary, rhetorical negation in debates/arguments",
        "historicalPersistence": "Pre-modern to present - documented in 18th-19th century ca dao, still used in contemporary Vietnamese for emphatic double negation"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Establish parallel rhythm: 'Cử nhân CHẲNG...' → 'Tú tài CŨNG KHÔNG...' with matching stress pattern",
          "Slight pause before 'mà' connector - let first negation register before adding second",
          "Crescendo dynamic from first negation to second - build frustration/irony",
          "Facial expression: progression from disappointment (chẳng) to resignation (cũng không)",
          "Hand gesture: dismissive wave on each negation (optional) - embody systematic rejection"
        ],

        "culturalSensitivity": [
          "Double negation reflects real social reality - 95%+ examination failure rate made complete failure statistically common, not exceptional",
          "Parallel structure is rhetorical art, not redundancy - shows linguistic sophistication of folk songs",
          "Respect irony as gentle social critique: song doesn't mock individual failure but impossible examination system",
          "Understand cultural value: Vietnamese respect effort even with complete failure - 'chẳng...cũng không' sympathetic not cruel",
          "For modern audiences: connect to contemporary failure patterns (college applications, job searches) - same futility resonance"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach negation markers separately - chẳng (emphatic not), không (standard not), cũng (also)",
          "Step 2: Introduce parallel negation pattern: A chẳng X, mà B cũng không Y = neither A nor B",
          "Step 3: Show 5+ examples from folk songs and conversation to establish template",
          "Step 4: Explain 'mà' connector function - contrastive ('but/yet'), sets up second negation",
          "Step 5: Practice pragmatics: neutral parallel negation ('neither tea nor coffee') vs. emphatic futility ('passed neither exam')",
          "Step 6: Compare English: 'neither...nor...' similar structure but Vietnamese uses affirmative + negation ('also not') vs. English pure correlative conjunctions"
        ],

        "commonMisinterpretations": [
          "❌ 'Double negative = positive (cancel out)' → ✅ Vietnamese parallel negation = emphatic double negation (neither/nor), NOT affirmation",
          "❌ 'Redundant repetition' → ✅ Rhetorical parallel structure for emotional emphasis - syntactic sophistication not waste",
          "❌ 'Chẳng and không mean exactly same' → ✅ Chẳng more emphatic/literary; không neutral. Using both creates rhetorical variation.",
          "❌ 'Can drop mà connector' → ✅ 'Mà' is critical contrastive marker - dropping it loses rhetorical force of expectation violation"
        ]
      }
    },

    {
      "expression": "không...cũng không",
      "literal": "not...also not",
      "meaning": "neither...nor construction - simpler parallel negation without contrastive connector",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Simpler parallel negation variant appearing in folk songs from 18th-19th centuries. More colloquial than 'chẳng...mà...cũng không' structure. Reflects natural Vietnamese speech rhythm.",

        "regionalSpecificity": 4,
        "explanation": "Pan-Vietnamese construction common across all regions. Less marked than 'chẳng...mà...' pattern - used in Northern, Central, Southern speech equally. Universal Vietnamese negation strategy.",

        "symbolicLoad": 6,
        "explanation": "Symbolizes: (1) Double impossibility (tried two paths, both failed), (2) Systematic exclusion (neither option worked), (3) Resignation (speaker accepts complete failure). Less rhetorically emphatic than 'chẳng...mà...' but still powerful.",

        "ritualSignificance": 1,
        "explanation": "No ritual significance. Everyday grammatical construction used in all contexts.",

        "transmissionImportance": 6,
        "explanation": "Important for basic Vietnamese negation competence. 'Không...cũng không' is core parallel negation pattern - learners need this before mastering more complex variants. Foundational syntax pattern.",

        "emotionalResonance": 7,
        "explanation": "Evokes resignation and acceptance of double failure. Simpler structure = more direct emotional impact. Less ironic than 'chẳng...mà...' pattern but equally sympathetic to futile effort."
      },

      "complexityMetrics": {
        "layersOfMeaning": 2,
        "explanation": "(1) Literal double negation (not A, also not B), (2) Pragmatic impossibility (both options excluded). Simpler than 'chẳng...mà...' variant - more transparent syntax.",

        "crossDomainMapping": 3,
        "explanation": "Minimal metaphorical mapping. Primarily grammatical negation with pragmatic force. NEGATION → EXCLUSION mapping straightforward.",

        "culturalPrerequisites": 4,
        "explanation": "Moderate prerequisites: (1) Understanding basic Vietnamese negation (không), (2) Recognizing 'cũng' (also/too) as additive marker, (3) Parallel structure awareness. More accessible than complex 'chẳng...mà...' pattern.",

        "idiomaticity": 6,
        "explanation": "Semi-fixed construction. 'Không...cũng không' is conventional template but compositional (không = not, cũng = also). More flexible than fully frozen idioms - learners can derive meaning from parts.",

        "contextDependence": 4,
        "explanation": "Relatively context-independent. Core meaning (neither/nor) stable across contexts. Pragmatic force varies (neutral exclusion vs. frustrated impossibility) but less dramatic than 'chẳng...mà...' variant.",

        "pedagogicalChallenge": 5,
        "explanation": "Moderate challenge: (1) Teaching 'cũng' as additive marker (also/too/even), (2) Explaining parallel negation syntax, (3) Distinguishing from other negation patterns. Easier than 'chẳng...mà...' - good entry point for parallel negation."
      },

      "semanticNetwork": {
        "sourceDomain": "SIMPLE_NEGATION",
        "targetDomain": "DOUBLE_FAILURE",
        "mappings": [
          {
            "source": "first negation (không X)",
            "target": "first failed attempt"
          },
          {
            "source": "additive marker (cũng = also)",
            "target": "accumulation of failure (not just one, but ALSO second)"
          },
          {
            "source": "second negation (cũng không Y)",
            "target": "second failed attempt (reinforces futility)"
          }
        ],
        "conceptualMetaphor": "ADDITIVE_NEGATION_IS_ACCUMULATED_FAILURE"
      },

      "usagePatterns": {
        "phrasePosition": "middle",
        "explanation": "Variant of phrase 4-6 parallel negation. Could substitute for 'chẳng...mà...cũng không' pattern with simpler syntax: 'Cử nhân không thi đỗ, Tú tài cũng không.'",

        "syntacticRole": "parallel_negation_construction",
        "explanation": "Simpler coordinated negation: [Subject1 + không + VP1], [Subject2 + cũng không + VP2]. Less complex than 'chẳng...mà...' but same functional pattern.",

        "discourseFunction": "direct_futility",
        "explanation": "Establishes complete failure through straightforward parallel negation. Less rhetorically elaborate than 'chẳng...mà...' but equally effective for conveying double impossibility.",

        "participationPattern": "direct_recognition",
        "explanation": "Audience recognizes familiar negation pattern from everyday speech. Simpler structure = more immediate comprehension and emotional connection.",

        "emotionalValence": "resigned_sympathetic",
        "explanation": "Direct resignation without elaborate irony. Simpler syntax conveys acceptance of double failure - less bitter than 'chẳng...mà...' but still sympathetic."
      },

      "statistics": {
        "occurrences": 0,
        "phraseIds": [],
        "totalPhrases": 8,
        "coverage": "0%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 0
        },
        "note": "Variant pattern not directly present but conceptually related to 'chẳng...mà...cũng không' construction"
      },

      "comparativeContext": {
        "uniquenessScore": 2,
        "explanation": "Extremely common Vietnamese construction. 'Không...cũng không' appears constantly in everyday speech and folk songs. Universal parallel negation pattern - not unique at all.",

        "similarExpressions": [
          {
            "expression": "chẳng...mà...cũng không (complex variant)",
            "similarity": "high",
            "difference": "Chẳng...mà...cũng không adds rhetorical complexity (emphatic chẳng, contrastive mà). Không...cũng không simpler and more colloquial."
          },
          {
            "expression": "không...lại không (sequential negation)",
            "similarity": "high",
            "difference": "Không...lại không uses 'lại' (again/moreover) instead of 'cũng' (also). Similar parallel structure, different semantic connector."
          },
          {
            "expression": "cả...lẫn... (both...and...)",
            "similarity": "medium",
            "difference": "Cả...lẫn... is affirmative parallel (both X and Y). Không...cũng không is negative parallel (neither X nor Y). Opposite polarity, same parallel structure."
          }
        ],

        "regionalDistribution": "Nationwide - universal Vietnamese parallel negation pattern used across all regions equally",
        "genreDistribution": "All genres and registers - everyday speech, folk songs, formal writing. Most basic parallel negation pattern.",
        "historicalPersistence": "Ancient to present - foundational Vietnamese syntax documented across all historical periods, still core pattern in contemporary speech"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Simple parallel rhythm: 'KHÔNG...CŨNG KHÔNG' with matched stress",
          "Natural conversational tone - this is everyday speech pattern, not elevated rhetoric",
          "Brief pause between negations - let each failure register separately",
          "Facial expression: simple resignation, head shake on each 'không'",
          "Avoid over-dramatizing - simpler structure calls for more restrained delivery"
        ],

        "culturalSensitivity": [
          "Không...cũng không is everyday speech, not archaic or poetic - signals accessibility",
          "Simpler structure doesn't mean simpler meaning - still conveys complete double failure",
          "Respect naturalness: this is how Vietnamese actually speak about double negation in conversation",
          "Universal pattern - not region/class specific, used by all Vietnamese speakers",
          "For learners: master this before attempting 'chẳng...mà...' variant - foundational pattern"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach basic negation - không = not (standard negator)",
          "Step 2: Teach additive marker - cũng = also/too (adds to previous statement)",
          "Step 3: Combine: không X, cũng không Y = not X, also not Y = neither X nor Y",
          "Step 4: Practice with simple examples: 'không đẹp cũng không xấu' (neither pretty nor ugly)",
          "Step 5: Build to complex examples: 'không thi đỗ cử nhân cũng không thi đỗ tú tài' (passed neither exam)",
          "Step 6: Compare English: 'neither...nor...' vs. Vietnamese 'not...also not' (affirmative + negation pattern)"
        ],

        "commonMisinterpretations": [
          "❌ 'Không means no, cũng means also, so not also not = yes?' → ✅ Parallel negation in Vietnamese = emphatic neither/nor, NOT double negative canceling to positive",
          "❌ 'Too simple/basic to be important' → ✅ Foundational Vietnamese syntax - mastery essential for negation competence",
          "❌ 'Can omit cũng' → ✅ Cũng is critical for parallel structure - dropping it loses neither/nor meaning",
          "❌ 'Same as không...và không (and not)' → ✅ Cũng (also) is additive/emphatic; và (and) is neutral conjunction. Different pragmatic force."
        ]
      }
    },

    {
      "expression": "bánh ít lá gai",
      "literal": "sticky rice cake (with) spiny-leaved plant",
      "meaning": "traditional Vietnamese dessert wrapped in green spiny leaves - metaphor for modest self-worth and humble origins",

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Traditional Southern Vietnamese food documented for centuries. Bánh ít lá gai associated with peasant/rural culture - humble affordable dessert vs. elite delicacies. Metaphorically represents common folk's self-perception and social position.",

        "regionalSpecificity": 9,
        "explanation": "Highly specific to Southern Vietnam (Mekong Delta, Saigon region). Lá gai (Pseuderanthemum palatiferum) grows in Southern climate. Northern/Central Vietnam use different plants for similar cakes. Strong regional identity marker.",

        "symbolicLoad": 8,
        "explanation": "Rich symbolism: (1) Humble origins (peasant food vs. elite cuisine), (2) Green spiny leaves (protective exterior, soft interior = hidden worth), (3) Sticky rice (binding community, family ties), (4) Self-deprecation (I'm just common food, not precious), (5) Regional pride (Southern identity).",

        "ritualSignificance": 6,
        "explanation": "Offerings for ancestors on death anniversaries and Lunar New Year in Southern families. Not sacred but ritually significant - connects living to dead through food. Bánh ít lá gai represents continuity of tradition.",

        "transmissionImportance": 8,
        "explanation": "Important for preserving Southern Vietnamese food culture and metaphorical self-expression. Teaching this metaphor transmits values of humility, regional identity, and food symbolism. Loss would erase culinary-metaphorical connection.",

        "emotionalResonance": 8,
        "explanation": "Evokes: (1) Nostalgia for Southern homeland, (2) Humility and self-deprecation, (3) Pride in modest origins, (4) Warmth of family food traditions. Particularly resonant for Southern Vietnamese diaspora longing for home foods."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "(1) Literal food (actual dessert), (2) Regional marker (Southern identity), (3) Social class marker (peasant/common food), (4) Self-worth metaphor (humble self-perception). Multiple interpretive dimensions from concrete to abstract.",

        "crossDomainMapping": 7,
        "explanation": "Complex metaphorical mapping: FOOD → SELF_WORTH. Source domain (bánh ít = humble dessert) maps to target domain (personal value = modest/common). Requires understanding: (1) Vietnamese food hierarchy, (2) Regional food culture, (3) Humility as virtue, (4) Self-deprecation conventions.",

        "culturalPrerequisites": 8,
        "explanation": "Substantial prerequisites: (1) Knowledge of Vietnamese desserts and food hierarchy, (2) Understanding lá gai plant (Southern-specific), (3) Awareness of regional food identities, (4) Cultural acceptance of food metaphors for self-worth, (5) Humility as Vietnamese virtue.",

        "idiomaticity": 7,
        "explanation": "Semi-idiomatic metaphorical expression. 'Bánh ít lá gai' compositional (cake + sticky rice + spiny leaves) but culturally means humble self-worth. Cannot substitute modern foods without losing traditional resonance. Must be learned as cultural-culinary concept.",

        "contextDependence": 6,
        "explanation": "Moderately context-dependent. Literal meaning (dessert) always available, but metaphorical force (humble self-worth) depends on context. In self-introduction or self-deprecation, clearly metaphorical. In food discussion, literal.",

        "pedagogicalChallenge": 8,
        "explanation": "Challenging: (1) Teaching Vietnamese food culture (dessert categories, regional specialties), (2) Explaining lá gai plant unfamiliar outside Vietnam, (3) Conveying food-as-self-worth metaphor (culturally specific), (4) Distinguishing humble self-deprecation from low self-esteem, (5) Regional food identity (Southern specificity)."
      },

      "semanticNetwork": {
        "sourceDomain": "FOOD_HIERARCHY",
        "targetDomain": "SOCIAL_SELF_WORTH",
        "mappings": [
          {
            "source": "bánh ít (sticky rice cake = peasant food)",
            "target": "self (common person, not elite)"
          },
          {
            "source": "lá gai (spiny leaves = protective but humble wrapping)",
            "target": "modest exterior hiding inner worth"
          },
          {
            "source": "dessert (affordable vs. expensive delicacies)",
            "target": "social position (common folk vs. aristocracy)"
          },
          {
            "source": "Southern regional food (not imperial cuisine)",
            "target": "regional identity (Southern pride/humility)"
          }
        ],
        "conceptualMetaphor": "SELF_IS_FOOD"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Appears in phrase 7 (id:7) at word positions 3-5. Positioned in self-deprecating statement about scholarly inadequacy. Culminating self-description before final rhetorical question.",

        "syntacticRole": "predicate_nominative",
        "explanation": "Predicate noun phrase: '[I am/like] bánh ít lá gai' (implied copula). Functions as metaphorical self-identification - speaker equates self with humble food.",

        "discourseFunction": "self_deprecation",
        "explanation": "Establishes speaker's humble social position through food metaphor. Not just 'I'm not educated' but 'I'm like common peasant food' - vivid concrete self-deprecation for rhetorical/ironic effect.",

        "participationPattern": "sympathetic_recognition",
        "explanation": "Audience recognizes humble self-presentation convention. Southern listeners particularly recognize regional food reference. Shared understanding of food-as-self metaphor creates communal connection.",

        "emotionalValence": "humble_proud",
        "explanation": "Complex valence: humility in self-deprecation but pride in regional food identity. Bánh ít lá gai is humble but delicious - speaker claims modest status while asserting authentic Southern worth."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [7],
        "totalPhrases": 8,
        "coverage": "12.5%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 7,
        "explanation": "Moderately unique Southern Vietnamese metaphor. Bánh ít lá gai appears in some folk songs but not extremely common. Regional specificity makes it distinctive - Northern/Central songs use different food metaphors.",

        "similarExpressions": [
          {
            "expression": "cơm nguội (cold rice)",
            "similarity": "medium",
            "difference": "Cơm nguội also humble food metaphor but for leftovers/poverty. Bánh ít lá gai is modest but still special dessert - different level of humility."
          },
          {
            "expression": "rau muống (water spinach)",
            "similarity": "medium",
            "difference": "Rau muống represents peasant vegetables (cheap, common). Bánh ít lá gai is dessert (celebratory despite humble origins) - different food category."
          },
          {
            "expression": "bánh chưng bánh dầy (Tết cakes)",
            "similarity": "high",
            "difference": "Bánh chưng/dầy are pan-Vietnamese New Year cakes with legendary origins. Bánh ít lá gai more regional and everyday - less cosmic significance."
          }
        ],

        "regionalDistribution": "Primarily Southern Vietnam (Mekong Delta, Saigon). Rare in Northern/Central folk songs which use region-specific food metaphors",
        "genreDistribution": "Southern folk songs emphasizing humility, self-introductions in ca dao, regional pride songs",
        "historicalPersistence": "Traditional to present - documented in Southern Vietnamese folk culture, still recognized by Southern diaspora communities worldwide"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'bánh ít lá gai' with gentle affection - this is beloved food, not shameful identity",
          "Slight smile on delivery - convey warmth and regional pride despite humble self-deprecation",
          "Southern Vietnamese pronunciation - softer 'd' sound in 'lá gai' (dialectal authenticity)",
          "Hand gesture: mime holding small cake (optional) - embody food metaphor concretely",
          "Vocal quality: warm conversational tone, not tragic - humility is comfortable not painful"
        ],

        "culturalSensitivity": [
          "Bánh ít lá gai represents Southern Vietnamese regional identity - respect geographic specificity",
          "Food metaphors for self-worth are culturally appropriate in Vietnamese - not strange or primitive",
          "Understand humility as virtue: self-deprecation shows proper social awareness, not low self-esteem",
          "Recognize class dimension: peasant food with pride, not shame - Southern folk culture values simplicity",
          "For diaspora: bánh ít lá gai evokes powerful nostalgia for Southern homeland - handle with emotional awareness",
          "Lá gai plant has medicinal properties (detoxification) - adds health symbolism beyond just wrapping"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach literal food - show images of bánh ít lá gai, explain ingredients (sticky rice, mung bean, wrapped in green spiny leaves)",
          "Step 2: Regional context - locate Southern Vietnam on map, explain lá gai grows in Mekong Delta climate",
          "Step 3: Food hierarchy - compare peasant foods (bánh ít, rau muống) vs. elite foods (imperial delicacies, bird's nest soup)",
          "Step 4: Introduce metaphor: SELF IS FOOD - explain how Vietnamese use food to describe personal worth",
          "Step 5: Cultural value - discuss humility as Vietnamese virtue, self-deprecation as social grace",
          "Step 6: Practice delivery - students say 'tôi như bánh ít lá gai' (I'm like bánh ít lá gai) with appropriate humble-proud tone",
          "Step 7: Compare English - 'plain Jane,' 'meat and potatoes person' use food metaphors but different cultural values"
        ],

        "commonMisinterpretations": [
          "❌ 'Speaker has low self-esteem' → ✅ Cultural humility convention - polite self-deprecation shows social awareness, not psychological problem",
          "❌ 'Bánh ít lá gai is bad/undesirable food' → ✅ Delicious beloved Southern dessert - humble origins but culturally valued",
          "❌ 'Random food reference' → ✅ Specific regional identity marker - bánh ít lá gai says 'I am Southern Vietnamese' as much as 'I am humble'",
          "❌ 'Literal: speaker wants to be eaten' → ✅ Metaphorical: speaker identifies with food's social position (common, modest, authentic)",
          "❌ 'Modern Vietnamese don't know this food' → ✅ Still made and eaten in Southern communities worldwide - living tradition not museum piece"
        ]
      }
    },

    {
      "expression": "Dù...cũng",
      "literal": "even if...still",
      "meaning": "concessive construction expressing persistence despite obstacles - 'no matter what...still'",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Concessive syntax documented in Vietnamese classical literature and folk songs from 18th-19th centuries. 'Dù...cũng' pattern reflects both indigenous grammar and Chinese literary influence (雖...亦...).",

        "regionalSpecificity": 4,
        "explanation": "Pan-Vietnamese construction with slight regional variations. Northern uses 'dù,' Central/Southern also use 'dầu,' 'mặc dù,' but 'dù...cũng' universal pattern. Broadly Vietnamese rather than regionally specific.",

        "symbolicLoad": 7,
        "explanation": "Symbolic of: (1) Persistence despite adversity (Vietnamese cultural value), (2) Determination and stubbornness, (3) Acceptance of inevitable obstacles, (4) Rhetorical emphasis (hypothetical obstacle → real commitment). Encodes cultural resilience.",

        "ritualSignificance": 2,
        "explanation": "No direct ritual significance. However, persistence despite hardship ('dù...cũng') appears in Buddhist teachings (endurance through suffering) and Confucian texts (moral commitment despite consequences).",

        "transmissionImportance": 7,
        "explanation": "Important for mastering Vietnamese complex conditional syntax. 'Dù...cũng' pattern essential for expressing hypothetical reasoning and commitment. Loss would limit expressive range of Vietnamese concessive meanings.",

        "emotionalResonance": 8,
        "explanation": "Evokes: (1) Determination and resilience, (2) Romantic commitment despite obstacles, (3) Stubbornness and pride, (4) Acceptance of fate. Particularly resonant in Vietnamese cultural context valuing persistence through hardship (历尽艰辛)."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "(1) Literal concession (even if X, still Y), (2) Pragmatic emphasis (highlights speaker's commitment), (3) Rhetorical force (hypothetical obstacle intensifies real determination). Syntactically clear but pragmatically nuanced.",

        "crossDomainMapping": 4,
        "explanation": "Moderate metaphorical mapping: HYPOTHETICAL_OBSTACLE → ACTUAL_COMMITMENT. Concessive structure (grammatical pattern) conveys psychological state (determination, acceptance). Syntax mirrors conceptual persistence.",

        "culturalPrerequisites": 5,
        "explanation": "Moderate prerequisites: (1) Understanding Vietnamese conditional/concessive syntax, (2) Recognizing 'dù' as concessive marker (even if/although), (3) Understanding 'cũng' as emphatic marker (still/nevertheless), (4) Appreciation of persistence as cultural value.",

        "idiomaticity": 7,
        "explanation": "Semi-fixed construction. 'Dù...cũng' is conventional concessive template. Some variation possible (dù...vẫn, mặc dù...cũng) but this pattern most emphatic. Learners must recognize as syntactic formula.",

        "contextDependence": 5,
        "explanation": "Moderately context-dependent. Core meaning (even if/still) stable, but pragmatic force varies: neutral concession vs. emphatic commitment depending on context. Emotional intensity depends on what obstacle/commitment stated.",

        "pedagogicalChallenge": 6,
        "explanation": "Moderate challenge: (1) Teaching concessive syntax (differs from English 'even if/although'), (2) Explaining 'dù' vs. other concessive markers (mặc dù, tuy, nhưng), (3) Understanding 'cũng' function (emphatic persistence marker), (4) Practicing appropriate pragmatic force."
      },

      "semanticNetwork": {
        "sourceDomain": "CONCESSIVE_LOGIC",
        "targetDomain": "PERSISTENT_COMMITMENT",
        "mappings": [
          {
            "source": "hypothetical obstacle (dù X = even if X)",
            "target": "acknowledged difficulty (speaker admits challenge)"
          },
          {
            "source": "persistent action (cũng Y = still Y)",
            "target": "unwavering commitment (speaker pledges action despite obstacle)"
          },
          {
            "source": "concessive structure (dù...cũng)",
            "target": "determination (grammar mirrors psychological resolve)"
          }
        ],
        "conceptualMetaphor": "CONCESSION_IS_RESILIENCE"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Appears in phrase 8 (id:8) at word positions 0-1 (opening) and continues through phrase. Opens final rhetorical question with concessive frame: 'Dù...cũng...' sets up ironic conclusion.",

        "syntacticRole": "concessive_construction",
        "explanation": "Complex conditional construction: Dù + [hypothetical situation], + cũng + [persistent action]. Functions as conditional frame for rhetorical question.",

        "discourseFunction": "rhetorical_intensification",
        "explanation": "Intensifies final ironic question through concessive framing. Not just 'why study?' but 'EVEN IF/NO MATTER WHAT...why study?' - emphasizes futility despite any effort.",

        "participationPattern": "emphatic_agreement",
        "explanation": "Audience recognizes concessive pattern signaling final emphatic point. 'Dù...cũng' prepares listeners for climactic rhetorical question - shared anticipation of conclusion.",

        "emotionalValence": "determined_ironic",
        "explanation": "Complex valence: determination encoded in 'dù...cũng' syntax but ironic futility in content (studying despite no results). Grammar says 'persist' but meaning says 'pointless' - tension creates irony."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [8],
        "totalPhrases": 8,
        "coverage": "12.5%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 3,
        "explanation": "Common Vietnamese concessive construction. 'Dù...cũng' appears frequently in folk songs, proverbs, and everyday speech. Universal pattern - not unique but rhetorically effective.",

        "similarExpressions": [
          {
            "expression": "mặc dù...nhưng (although...but)",
            "similarity": "high",
            "difference": "Mặc dù...nhưng more neutral/factual concession. Dù...cũng more emphatic/emotional commitment. Similar function, different intensity."
          },
          {
            "expression": "dù...vẫn (even if...still)",
            "similarity": "high",
            "difference": "Dù...vẫn uses 'vẫn' (still/continue) instead of 'cũng' (also/still). Vẫn emphasizes continuity; cũng emphasizes persistence. Subtle semantic difference."
          },
          {
            "expression": "cho dù...đi chăng nữa (even if...whatever)",
            "similarity": "medium",
            "difference": "Cho dù...đi chăng nữa more elaborate formal concession. Dù...cũng simpler and more colloquial. Same basic pattern, different register."
          }
        ],

        "regionalDistribution": "Nationwide - universal Vietnamese concessive pattern. Northern 'dù,' Southern also 'dầu' but same structure",
        "genreDistribution": "All genres - love songs (commitment despite obstacles), philosophical songs (persistence despite hardship), everyday speech",
        "historicalPersistence": "Pre-modern to present - documented in classical literature, still core pattern in contemporary Vietnamese"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Emphasize 'dù' with rising pitch - signal hypothetical concessive frame opening",
          "Slight pause after concessive clause before 'cũng' - let obstacle register, then assert persistence",
          "Crescendo on 'cũng' - emphasize determination/commitment despite acknowledged difficulty",
          "Facial expression: determined resolve progressing to ironic questioning (as content reveals futility)",
          "Hand gesture: firm gesture on 'cũng' (optional) - embody unwavering commitment"
        ],

        "culturalSensitivity": [
          "Dù...cũng encodes Vietnamese cultural value of persistence through adversity - not just grammar but worldview",
          "Understand historical context: centuries of resistance to foreign occupation built cultural resilience encoded in this syntax",
          "Recognize rhetorical sophistication: concessive patterns show linguistic artistry of folk songs",
          "For modern audiences: connect to contemporary persistence (immigration struggles, educational sacrifices) - same resilience encoded",
          "Respect ironic usage: song uses 'dù...cũng' (persist) while depicting futility - grammatical determination vs. practical impossibility creates poignant irony"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach concessive markers - dù = even if/although (hypothetical/concessive)",
          "Step 2: Teach emphatic markers - cũng = still/nevertheless (persistence despite concession)",
          "Step 3: Combine pattern: Dù + [obstacle/condition], cũng + [action] = even if [obstacle], still [action]",
          "Step 4: Practice with simple examples: 'Dù mưa cũng đi' (even if rain, still go)",
          "Step 5: Build to complex examples: 'Dù học trò cũng chẳng đỗ' (even if study, still don't pass)",
          "Step 6: Explain pragmatic force: neutral concession ('dù mệt cũng làm' = even if tired, still work) vs. ironic futility (song context)",
          "Step 7: Compare English: 'even if...still' similar but Vietnamese 'cũng' adds emphatic force English 'still' lacks"
        ],

        "commonMisinterpretations": [
          "❌ 'Dù means maybe/possibly' → ✅ Dù means even if/although - concessive not probabilistic",
          "❌ 'Can omit cũng' → ✅ Cũng is critical emphatic marker - dropping it loses concessive force (becomes simple conditional)",
          "❌ 'Same as English even if' → ✅ Vietnamese dù...cũng more emphatic - 'cũng' adds determination English 'still' doesn't fully capture",
          "❌ 'Only for hypotheticals' → ✅ Also used for real contrary-to-expectation situations (dù giàu cũng khổ = even though rich, still suffer)"
        ]
      }
    },

    {
      "expression": "trò học trò",
      "literal": "student learn student",
      "meaning": "lifelong learner reduplication - emphasizing continuous cyclical learning process",

      "culturalWeights": {
        "historicalDepth": 7,
        "explanation": "Reduplication pattern in Vietnamese documented for centuries. 'Trò học trò' reflects Confucian educational ideal of lifelong learning and teacher-becoming-student cycle. Encodes cultural value of continuous self-cultivation.",

        "regionalSpecificity": 5,
        "explanation": "Pan-Vietnamese reduplication pattern but with Northern folk song associations. Reduplication ('X verb X') is universal Vietnamese grammar, but 'trò học trò' specific to educational contexts. Moderately Northern-marked.",

        "symbolicLoad": 8,
        "explanation": "Rich symbolism: (1) Cyclical learning (student becomes teacher becomes student again), (2) Humility (even masters remain students), (3) Confucian self-cultivation ideal, (4) Process over product (learning is continuous, not completed), (5) Role fluidity (social positions not fixed).",

        "ritualSignificance": 6,
        "explanation": "Connected to educational rituals: teacher-student ceremony (lễ bái sư), Confucius temple offerings, and examination culture. 'Trò học trò' embodies ritual continuity - knowledge transmission across generations through perpetual student-teacher cycles.",

        "transmissionImportance": 8,
        "explanation": "CRITICAL for understanding Vietnamese educational philosophy and reduplication grammar. Teaching this preserves both: (1) Linguistic pattern (X verb X reduplication), (2) Cultural value (lifelong learning ideal). Loss would erase pedagogical worldview.",

        "emotionalResonance": 8,
        "explanation": "Evokes: (1) Humility and respect for learning, (2) Cyclical time (not linear progress), (3) Multigenerational knowledge transmission, (4) Modern resonance with lifelong learning movement. Particularly meaningful for educators and Vietnamese diaspora valuing education."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "(1) Literal repetition (student learn student - grammatical reduplication), (2) Cyclical process (learning never ends), (3) Role transformation (student → teacher → student again), (4) Philosophical ideal (Confucian self-cultivation). Multiple interpretive layers from grammar to philosophy.",

        "crossDomainMapping": 7,
        "explanation": "Complex mapping: GRAMMATICAL_REDUPLICATION → CYCLICAL_PHILOSOPHY. Source domain (repeated 'trò' in grammar) maps to target domain (cyclical learning in philosophy). Requires understanding: (1) Vietnamese reduplication syntax, (2) Confucian educational ideals, (3) Cyclical vs. linear time concepts.",

        "culturalPrerequisites": 7,
        "explanation": "Substantial prerequisites: (1) Vietnamese reduplication grammar (X verb X patterns), (2) Understanding 'trò' (student/disciple), (3) Confucian teacher-student relationship, (4) Cyclical learning philosophy, (5) Humility as educational virtue. Challenging for non-Vietnamese/non-Confucian learners.",

        "idiomaticity": 8,
        "explanation": "Highly idiomatic reduplication. 'Trò học trò' is fixed formula with specific philosophical meaning beyond literal compositional translation. Cannot substitute modern terms (học sinh, sinh viên) without losing traditional resonance. Must learn as cultural-philosophical concept.",

        "contextDependence": 6,
        "explanation": "Moderately context-dependent. In educational/philosophical contexts, clearly means lifelong learning ideal. In this song, ironic - 'trò học trò' (perpetual student) but 'chẳng đỗ' (never passes exams) - ideal vs. futile reality.",

        "pedagogicalChallenge": 8,
        "explanation": "Very challenging: (1) Teaching reduplication grammar (X verb X = continuous/habitual/emphatic action), (2) Explaining Confucian educational philosophy unfamiliar to Western learners, (3) Conveying cyclical time concept (vs. linear progress), (4) Distinguishing literal (study repeatedly) from philosophical (lifelong learner) meanings."
      },

      "semanticNetwork": {
        "sourceDomain": "GRAMMATICAL_REDUPLICATION",
        "targetDomain": "CYCLICAL_LEARNING_PHILOSOPHY",
        "mappings": [
          {
            "source": "repeated 'trò' (grammatical reduplication)",
            "target": "perpetual student identity (never-ending learning)"
          },
          {
            "source": "'học' (learn - action verb)",
            "target": "continuous process (learning as ongoing activity, not completed state)"
          },
          {
            "source": "X verb X pattern (habitual/continuous aspect)",
            "target": "cyclical time (learning cycles endlessly through generations)"
          },
          {
            "source": "subject = object (trò học trò)",
            "target": "role transformation (student becomes teacher becomes student)"
          }
        ],
        "conceptualMetaphor": "LEARNING_IS_CYCLICAL_JOURNEY"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Appears in phrase 8 (id:8) within final rhetorical question. Positioned as subject of concessive clause: 'Dù có trò học trò' (even if perpetual student) - sets up ironic questioning of educational pursuit.",

        "syntacticRole": "subject_noun_phrase",
        "explanation": "Reduplicated noun phrase functioning as subject: 'trò học trò' (perpetual student/lifelong learner). Grammatically subject, philosophically represents educational ideal speaker questions.",

        "discourseFunction": "ironic_ideal",
        "explanation": "Presents educational ideal (lifelong learning) only to question its value given examination futility. Not affirming 'trò học trò' but asking 'even if I'm perpetual student, what's the point if I never pass exams?' - ideal vs. reality tension.",

        "participationPattern": "ironic_recognition",
        "explanation": "Audience recognizes Confucian learning ideal in 'trò học trò' then understands ironic questioning - even noble educational philosophy can't overcome impossible examination system. Shared cultural knowledge creates poignant irony.",

        "emotionalValence": "wistful_ironic",
        "explanation": "Complex valence: wistfulness for educational ideal ('trò học trò' is culturally valued) but ironic recognition of futility (lifelong learning doesn't guarantee success). Respect for process + resignation about outcomes."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [8],
        "totalPhrases": 8,
        "coverage": "12.5%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 6,
        "explanation": "Moderately unique Vietnamese expression. 'Trò học trò' appears in educational contexts and some folk songs but not extremely common. Philosophical resonance makes it distinctive - combines grammar and cultural values.",

        "similarExpressions": [
          {
            "expression": "học học nữa, học mãi (study study more, study always)",
            "similarity": "high",
            "difference": "Học học nữa, học mãi emphasizes endless repetition. Trò học trò adds cyclical role transformation (student-teacher-student). Similar commitment to learning, different philosophical depth."
          },
          {
            "expression": "thầy dạy trò học (teacher teaches, student learns)",
            "similarity": "medium",
            "difference": "Thầy dạy trò học linear transmission (teacher → student). Trò học trò cyclical (student ↔ teacher). Different temporal/hierarchical models."
          },
          {
            "expression": "học trò (student - simple noun)",
            "similarity": "low",
            "difference": "Học trò just means student (no reduplication). Trò học trò is reduplicated philosophical concept (lifelong learner). Simple vs. complex meaning."
          }
        ],

        "regionalDistribution": "Nationwide but with Confucian educational culture associations. Stronger resonance in traditionally scholarly regions (Northern Red River Delta, Huế)",
        "genreDistribution": "Educational proverbs, philosophical songs, examination culture contexts - any genre discussing learning ideals",
        "historicalPersistence": "Classical to present - documented in Confucian educational texts, still used in contemporary Vietnamese to mean lifelong learner"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Sing 'trò học trò' with gentle rhythmic repetition - embody reduplication through musical phrasing",
          "Slight emphasis on each 'trò' - make reduplication audible (not slurred into single word)",
          "Vocal quality: mix respect (for learning ideal) with weariness (for endless studying)",
          "Facial expression: thoughtful contemplation - convey philosophical depth of concept",
          "Avoid rushing reduplication - let cyclical pattern register with audience"
        ],

        "culturalSensitivity": [
          "Trò học trò encodes Confucian educational philosophy - respect as cultural-philosophical concept, not just grammar",
          "Understand lifelong learning as virtue in Vietnamese culture - 'trò học trò' is praise not criticism in most contexts",
          "Recognize this song's ironic usage: 'trò học trò' (ideal) vs. 'chẽng đỗ' (futility) - questions system not devalues learning",
          "Respect reduplication as linguistic sophistication - shows artistry of Vietnamese folk songs",
          "For modern audiences: connect to contemporary lifelong learning movement - ancient philosophy meets modern educational trends"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach reduplication grammar - X verb X pattern creates habitual/continuous/emphatic meaning",
          "Step 2: Examples: 'đi đi' (keep walking), 'ăn ăn' (keep eating), 'học học' (keep studying)",
          "Step 3: Introduce 'trò' - student/disciple in traditional education, 'học' - learn/study",
          "Step 4: Combine: 'trò học trò' - student learns (to be) student = perpetual learning cycle",
          "Step 5: Philosophical context - explain Confucian ideal of lifelong self-cultivation (修身)",
          "Step 6: Cyclical vs. linear - compare Vietnamese cyclical learning model to Western linear degree progression",
          "Step 7: Song irony - analyze how 'trò học trò' (ideal) contrasts with examination failure (reality)"
        ],

        "commonMisinterpretations": [
          "❌ 'Grammatical error/redundancy' → ✅ Intentional reduplication pattern with specific continuous/habitual meaning - sophisticated grammar not mistake",
          "❌ 'Student teaches student (peer teaching)' → ✅ Student learns (to be) student - cyclical self-cultivation, not peer instruction",
          "❌ 'Modern Vietnamese for university student' → ✅ Traditional Confucian term for disciple/lifelong learner - philosophical not institutional meaning",
          "❌ 'Song praises trò học trò ideal' → ✅ Song questions ideal ironically - even lifelong learning doesn't guarantee success in broken examination system"
        ]
      }
    },

    {
      "expression": "Dù...có...cũng",
      "literal": "even if...have...still",
      "meaning": "intensified concessive construction - emphatic 'no matter what...still' with additional 'có' marker",

      "culturalWeights": {
        "historicalDepth": 6,
        "explanation": "Elaborated concessive syntax appearing in Vietnamese classical literature and folk songs. 'Dù...có...cũng' adds 'có' (have/exist) intensifier to basic 'dù...cũng' pattern - more emphatic rhetorical force.",

        "regionalSpecificity": 4,
        "explanation": "Pan-Vietnamese construction with universal usage. All regions use 'dù...có...cũng' for emphatic concession. Not regionally marked - standard Vietnamese concessive intensification.",

        "symbolicLoad": 7,
        "explanation": "Symbolizes: (1) Extreme persistence (even more emphatic than 'dù...cũng'), (2) Acknowledgment of significant obstacles (có marks obstacle as real/substantial), (3) Unwavering commitment despite acknowledged difficulty. Encodes cultural value of determination.",

        "ritualSignificance": 2,
        "explanation": "No direct ritual significance. Emphatic concessive appears in Buddhist texts (commitment despite suffering) and moral teachings (virtue despite temptation) but not ritualized.",

        "transmissionImportance": 7,
        "explanation": "Important for mastering Vietnamese intensification strategies. 'Có' as intensifier appears across Vietnamese grammar - teaching this concessive pattern helps learners understand 'có' beyond literal 'have' meaning.",

        "emotionalResonance": 8,
        "explanation": "Evokes: (1) Intense determination, (2) Recognition of serious obstacles, (3) Emotional commitment (vs. neutral concession), (4) Rhetorical force. More emotionally charged than simple 'dù...cũng' - 'có' adds gravity."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "(1) Literal intensified concession (even if HAVE X, still Y), (2) Pragmatic emphasis (obstacle acknowledged as real/substantial via 'có'), (3) Rhetorical force (triple-marker construction emphasizes commitment). Syntactically more complex than simple 'dù...cũng.'",

        "crossDomainMapping": 4,
        "explanation": "Moderate mapping: INTENSIFIED_CONCESSION → EMPHATIC_COMMITMENT. Additional 'có' marker (grammatical intensifier) conveys psychological intensity (stronger determination). Syntactic elaboration mirrors emotional escalation.",

        "culturalPrerequisites": 6,
        "explanation": "Moderate prerequisites: (1) Understanding basic 'dù...cũng' pattern first, (2) Recognizing 'có' as intensifier (beyond literal 'have'), (3) Distinguishing emphatic vs. neutral concession, (4) Appreciating rhetorical gradation (dù...cũng → dù...có...cũng).",

        "idiomaticity": 7,
        "explanation": "Semi-fixed intensified construction. 'Dù...có...cũng' is conventional emphatic template. Highly formulaic - 'có' in this position is frozen intensifier, not compositional verb. Learners must memorize as emphatic variant.",

        "contextDependence": 5,
        "explanation": "Moderately context-dependent. Core meaning (emphatic even if/still) stable, but pragmatic force depends on obstacle stated. More emotionally intense than 'dù...cũng' - used when speaker wants maximum emphatic effect.",

        "pedagogicalChallenge": 7,
        "explanation": "Moderately challenging: (1) Teaching 'có' as intensifier (not literal 'have'), (2) Explaining why adding 'có' creates emphasis, (3) Distinguishing 'dù...cũng' (neutral) vs. 'dù...có...cũng' (emphatic), (4) Practicing appropriate pragmatic force (when to use intensified version)."
      },

      "semanticNetwork": {
        "sourceDomain": "INTENSIFIED_CONCESSIVE_LOGIC",
        "targetDomain": "EMPHATIC_PERSISTENCE",
        "mappings": [
          {
            "source": "dù (even if - concessive marker)",
            "target": "acknowledged obstacle (speaker recognizes difficulty)"
          },
          {
            "source": "có (have/exist - intensifier)",
            "target": "substantial obstacle (not hypothetical but real/serious)"
          },
          {
            "source": "cũng (still - persistence marker)",
            "target": "unwavering commitment (speaker pledges action despite serious obstacle)"
          },
          {
            "source": "triple-marker construction (dù...có...cũng)",
            "target": "maximum rhetorical force (grammar mirrors emotional intensity)"
          }
        ],
        "conceptualMetaphor": "EMPHATIC_CONCESSION_IS_EXTREME_RESILIENCE"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Appears in phrase 8 (id:8) - final rhetorical question. Opens with 'Dù có trò học trò cũng' - intensified concessive frame for climactic ironic question about study's pointlessness.",

        "syntacticRole": "intensified_concessive_construction",
        "explanation": "Complex triple-marker construction: Dù + có + [situation], + cũng + [action]. Functions as emphatic conditional frame - more rhetorically forceful than simple 'dù...cũng.'",

        "discourseFunction": "climactic_intensification",
        "explanation": "Provides maximum rhetorical emphasis for final question. Not just 'even if study' (dù...cũng) but 'EVEN IF REALLY HAVE PERPETUAL STUDYING' (dù...có...cũng) - intensifies ironic futility question to climax.",

        "participationPattern": "emphatic_climax",
        "explanation": "Audience recognizes triple-marker pattern signaling climactic rhetorical peak. 'Dù...có...cũng' prepares for final devastating question - shared anticipation of emphatic conclusion.",

        "emotionalValence": "intensely_ironic",
        "explanation": "Maximum emotional complexity: grammatical intensification (dù...có...cũng = extreme determination) + ironic content (study is futile). Strongest grammatical commitment meets most bitter futility - peak ironic tension."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [8],
        "totalPhrases": 8,
        "coverage": "12.5%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 3,
        "explanation": "Common Vietnamese emphatic concessive. 'Dù...có...cũng' appears frequently when speakers want maximum rhetorical force. Universal intensification strategy - not unique but highly effective.",

        "similarExpressions": [
          {
            "expression": "dù...cũng (basic concessive)",
            "similarity": "high",
            "difference": "Dù...cũng neutral concession. Dù...có...cũng adds 'có' intensifier for emphatic force. Same pattern, different emotional intensity."
          },
          {
            "expression": "cho dù có...đi chăng nữa (elaborate concessive)",
            "similarity": "high",
            "difference": "Cho dù có...đi chăng nữa even more elaborate/formal. Dù...có...cũng more direct/colloquial. Similar emphatic function, different register."
          },
          {
            "expression": "mặc dù có...nhưng (although have...but)",
            "similarity": "medium",
            "difference": "Mặc dù có...nhưng factual concession (even though X exists, but Y). Dù...có...cũng hypothetical/emphatic (even if X existed, still Y). Different modality."
          }
        ],

        "regionalDistribution": "Nationwide - universal Vietnamese emphatic concessive pattern used across all regions",
        "genreDistribution": "Any context requiring emphatic concession - love songs (commitment despite obstacles), philosophical songs (persistence despite hardship), rhetorical arguments",
        "historicalPersistence": "Classical to present - documented in classical literature, still common in contemporary Vietnamese for emphatic concession"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Emphasize ALL THREE markers: DÙ...CÓ...CŨNG - make triple construction audible",
          "Crescendo dynamic from 'dù' → 'có' → 'cũng' - build rhetorical intensity",
          "Slight pause after 'có' - let intensifier register before delivering 'cũng'",
          "Facial expression: maximum determination transitioning to ironic questioning",
          "Vocal quality: most emphatic delivery of entire song - this is rhetorical peak"
        ],

        "culturalSensitivity": [
          "Dù...có...cũng represents maximum rhetorical commitment in Vietnamese - respect linguistic artistry",
          "Understand 'có' as grammatical intensifier, not literal 'have' - shows Vietnamese grammar sophistication",
          "Recognize song's ironic genius: uses MOST emphatic concessive (dù...có...cũng) for MOST futile situation (endless study without results)",
          "Respect cultural value: Vietnamese prize persistence ('dù...có...cũng' encodes this) even when acknowledging futility - complex worldview",
          "For modern audiences: connect to contemporary determination despite obstacles - same rhetorical force in new contexts"
        ],

        "pedagogicalApproach": [
          "Step 1: Review basic 'dù...cũng' pattern first - ensure foundation before teaching intensification",
          "Step 2: Introduce 'có' as intensifier - show how it adds emphasis across Vietnamese grammar",
          "Step 3: Build pattern: Dù + có + [situation], cũng + [action] = EVEN IF REALLY [situation], STILL [action]",
          "Step 4: Practice simple examples: 'Dù có mệt cũng đi' (even if really tired, still go)",
          "Step 5: Contrast neutral vs. emphatic: 'Dù mệt cũng đi' (even if tired, still go) vs. 'Dù có mệt cũng đi' (EVEN IF REALLY tired, still go)",
          "Step 6: Explain pragmatics: when to use intensified version (serious obstacles, emotional commitment, rhetorical peaks)",
          "Step 7: Song analysis: examine how 'dù có trò học trò cũng' creates maximum ironic force for climactic question"
        ],

        "commonMisinterpretations": [
          "❌ 'Có means have, so dù có X = even if have X' → ✅ Có here is intensifier meaning REALLY/TRULY, not possessive 'have'",
          "❌ 'Same as dù...cũng, có is redundant' → ✅ Có adds emphatic intensification - not redundant but rhetorical escalation",
          "❌ 'Can use anywhere interchangeably with dù...cũng' → ✅ Dù...có...cũng for emphatic contexts only - overuse weakens rhetorical force",
          "❌ 'Modern invention' → ✅ Classical Vietnamese intensification pattern - documented in traditional literature, not contemporary colloquialism"
        ]
      }
    }
  ]
}
