{
  "songTitle": "Giáo trống",
  "totalSyllables": 47,
  "totalPhrases": 6,
  "segmentedBy": "Claude LLM",
  "enhancementVersion": "V3.0",
  "enhancementDate": "2025-10-06",

  "expressions": [
    {
      "expression": "giáo trống",
      "literal": "drum temple/shrine",
      "meaning": "Sacred space dedicated to drum worship in Vietnamese villages",
      "type": "cultural_metonymy",
      "phraseIds": [1],

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Drum temples (giáo trống/đình trống) date back centuries in Vietnamese village culture, predating French colonialism. These shrines were central to agricultural communities where drums held spiritual power.",

        "regionalSpecificity": 7,
        "explanation": "Primarily Northern and Central Vietnamese tradition. Red River Delta villages commonly had drum shrines, though practice varied by region. Not universal across all Vietnam.",

        "symbolicLoad": 8,
        "explanation": "Drums symbolize: 1) Connection to ancestors/spirits, 2) Community voice/authority, 3) Agricultural calendar marking, 4) Social cohesion. Multi-layered spiritual significance.",

        "ritualSignificance": 9,
        "explanation": "Essential to village rituals: festivals, prayers for harvests, rain ceremonies, community gatherings. The drum shrine was the spiritual center of village life.",

        "transmissionImportance": 7,
        "explanation": "Important for understanding traditional Vietnamese village structure and spiritual practices. Increasingly rare as modernization transforms rural communities.",

        "emotionalResonance": 7,
        "explanation": "Evokes reverence, communal identity, connection to ancestors. For Vietnamese with village roots, this carries deep nostalgia and spiritual grounding."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "1) Literal: physical shrine building, 2) Metonymic: PLACE FOR WORSHIP, 3) Symbolic: center of village spiritual/social life",

        "crossDomainMapping": 7,
        "explanation": "PHYSICAL SPACE → SPIRITUAL POWER. The shrine building maps to: authority, community voice, ancestral connection, agricultural blessing. Moderate abstract mapping.",

        "culturalPrerequisites": 8,
        "explanation": "Requires understanding: traditional village structure, animistic beliefs, drum symbolism in Vietnamese culture, agricultural ritual calendars. Non-trivial background needed.",

        "idiomaticity": 6,
        "explanation": "Semi-fixed expression. 'Giáo' (shrine/temple) combines with 'trống' (drum) in traditional contexts. Somewhat compositional but culturally specific pairing.",

        "contextDependence": 7,
        "explanation": "Full significance requires cultural context. Modern Vietnamese might recognize words but miss deep ritual/spiritual implications.",

        "pedagogicalChallenge": 7,
        "explanation": "Teaching requires explaining: Vietnamese village cosmology, animistic traditions, drum's role in agriculture, shrine architecture. Moderately difficult for outsiders."
      },

      "semanticNetwork": {
        "sourceDomain": "PHYSICAL_ARCHITECTURE",
        "targetDomain": "SPIRITUAL_AUTHORITY",
        "mappings": [
          {
            "source": "shrine building/structure",
            "target": "sacred space for divine communication"
          },
          {
            "source": "drum (bronze percussion instrument)",
            "target": "voice of community, call to spirits"
          },
          {
            "source": "entering the shrine",
            "target": "seeking divine intervention/blessing"
          }
        ],
        "conceptualMetaphor": "SACRED SPACE IS SPIRITUAL GATEWAY"
      },

      "usagePatterns": {
        "phrasePosition": "beginning",
        "explanation": "Phrase 1, sets the scene. Opens the song by establishing the sacred ritual context for all subsequent blessings.",

        "syntacticRole": "locative_object",
        "explanation": "Object of the verb 'vào' (enter). Grammatically marks destination/location of sacred action.",

        "discourseFunction": "scene_setting",
        "explanation": "Establishes ritual frame: this is a prayer/blessing ceremony, not everyday speech. Creates sacred atmosphere.",

        "participationPattern": "communal_witness",
        "explanation": "First-person 'Tôi' (I) represents the community. Individual enters on behalf of collective. Audience identifies with supplicant role.",

        "emotionalValence": "reverent",
        "explanation": "Serious, respectful tone. The act of entering a sacred space requires humility and proper spiritual attitude."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [1],
        "totalPhrases": 6,
        "coverage": "16.7%",
        "positionDistribution": {
          "beginning": 1,
          "middle": 0,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 7,
        "explanation": "Drum shrines appear in some other Northern folk songs, but 'giáo trống' as opening scene-setter is distinctive. Most songs reference drums without the shrine context.",

        "similarExpressions": [
          {
            "expression": "đình làng (village communal house - in other folk songs)",
            "similarity": "high",
            "difference": "Đình làng is secular-administrative, giáo trống is specifically spiritual/religious. Both are village centers but different functions."
          },
          {
            "expression": "miếu thần (deity temple - in ceremonial songs)",
            "similarity": "medium",
            "difference": "Miếu thần is generic temple, giáo trống is drum-specific. Drum worship is narrower, more ritual-focused."
          }
        ],

        "regionalDistribution": "Northern Vietnam (Red River Delta) and parts of Central Vietnam. Rare in Southern folk songs.",
        "genreDistribution": "Ceremonial/prayer songs, harvest songs, village ritual music. Not found in love songs or lullabies.",
        "historicalPersistence": "Ancient tradition (pre-colonial) continuing through French period, declining post-1945 with land reform and modernization."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce 'giáo' with clear sắc tone (rising), 'trống' with sắc as well - both high, bright tones suggest reverence",
          "Slight pause after 'vào' (enter) to emphasize the threshold-crossing - physical and spiritual transition",
          "Imagine walking into a dim shrine, smelling incense - let this imagery inform vocal color (slightly hushed, awed)",
          "Body language: slight bow of head or hands in prayer position when singing this phrase (if gestures used)"
        ],

        "culturalSensitivity": [
          "This represents living spiritual practice for some Vietnamese communities, not historical curiosity",
          "Drum worship has animistic roots - respect as serious religious tradition, not 'superstition'",
          "Avoid exoticizing or mocking the practice - for many, this is sacred ancestor veneration",
          "If performing for Vietnamese diaspora, recognize this may evoke powerful memories of lost village life"
        ],

        "pedagogicalApproach": [
          "Step 1: Show images of actual giáo trống/đình trống (search Vietnamese cultural heritage sites)",
          "Step 2: Explain Vietnamese village structure - the central role of drums in community life",
          "Step 3: Connect to agricultural calendar - drums called for rain, marked planting/harvest",
          "Step 4: Discuss animistic beliefs - drums as voice to ancestors/spirits, not just instruments",
          "Step 5: Compare to other cultures' sacred sound instruments (bells, gongs, conch shells)",
          "Step 6: Practice pronunciation with cultural context in mind - respect in tone"
        ],

        "commonMisinterpretations": [
          "❌ 'Just a building with a drum' → ✅ Spiritual center of village cosmology",
          "❌ 'Historical relic, no current relevance' → ✅ Some communities still practice drum worship",
          "❌ 'Buddhist/Daoist temple' → ✅ Animistic, pre-Buddhist Vietnamese tradition",
          "❌ 'Drum is decoration' → ✅ Drum is sacred object, mediator between human and spiritual realms"
        ]
      }
    },

    {
      "expression": "Thượng chúc",
      "literal": "Supreme blessing",
      "meaning": "Invocation of supreme deity/heaven for divine blessing",
      "type": "spiritual_invocation",
      "phraseIds": [2],

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Thượng (Supreme/Upper) refers to ancient Vietnamese concept of heaven/supreme deities predating Chinese influence. Appears in pre-Confucian animistic traditions and integrated into syncretic folk religion.",

        "regionalSpecificity": 5,
        "explanation": "Widespread across Vietnamese regions. 'Thượng' concept is pan-Vietnamese, though specific rituals vary. Not region-specific like some folk terms.",

        "symbolicLoad": 9,
        "explanation": "Thượng represents: 1) Cosmic hierarchy (upper/heaven vs lower/earth), 2) Supreme moral authority, 3) Source of blessings/fortune, 4) Connection point for prayers. Deep cosmological symbolism.",

        "ritualSignificance": 9,
        "explanation": "Central to prayer/blessing rituals. Invocation of Thượng is essential opening in many ceremonies - establishes connection to divine realm before making requests.",

        "transmissionImportance": 8,
        "explanation": "Critical for understanding Vietnamese cosmology and religious syncretism (animism + Confucianism + Daoism + Buddhism). Key concept for cultural continuity.",

        "emotionalResonance": 8,
        "explanation": "Inspires reverence, hope, humility. For Vietnamese, invoking Thượng carries weight of generations of ancestors making same prayers. Deeply moving."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "1) Literal: upper/high, 2) Cosmological: heaven realm, 3) Theological: supreme deity/force, 4) Social: ultimate moral authority above earthly rulers",

        "crossDomainMapping": 9,
        "explanation": "VERTICAL SPACE → MORAL/SPIRITUAL HIERARCHY. 'Upper' maps to goodness, power, purity, authority. Complex abstract mapping involving spatial metaphor for ethics and cosmology.",

        "culturalPrerequisites": 8,
        "explanation": "Requires understanding: Vietnamese syncretic religion, concept of heaven (different from Christian heaven), ritual language registers, relationship between earthly and cosmic realms.",

        "idiomaticity": 8,
        "explanation": "Highly fixed in ritual contexts. 'Thượng chúc' is formal invocation formula, not compositional. Cannot substitute synonyms without losing ritual register.",

        "contextDependence": 7,
        "explanation": "Full meaning requires ritual/prayer context. Outside ceremonial frame, might be misunderstood as merely 'high blessing' rather than cosmic invocation.",

        "pedagogicalChallenge": 9,
        "explanation": "Very difficult to teach non-Vietnamese. Requires explaining entire cosmological system, ritual language, syncretism of traditions. No easy English equivalent."
      },

      "semanticNetwork": {
        "sourceDomain": "VERTICAL_SPATIAL_ORIENTATION",
        "targetDomain": "MORAL_SPIRITUAL_HIERARCHY",
        "mappings": [
          {
            "source": "upper/high position",
            "target": "supreme divine power/authority"
          },
          {
            "source": "seeking/reaching upward",
            "target": "prayer/supplication to higher realm"
          },
          {
            "source": "blessing descending from above",
            "target": "divine grace/fortune granted to mortals"
          }
        ],
        "conceptualMetaphor": "GOOD IS UP, DIVINE IS UPPER"
      },

      "usagePatterns": {
        "phrasePosition": "beginning",
        "explanation": "Phrase 2, immediately after scene-setting. Follows entry into sacred space with direct invocation of supreme deity - proper ritual sequence.",

        "syntacticRole": "object_of_seeking",
        "explanation": "Object of 'tìm đến' (seek). Grammatically marks the target/goal of the supplicant's journey and prayer.",

        "discourseFunction": "invocation",
        "explanation": "Calls upon divine authority. Establishes the addressee of subsequent blessings. Standard opening move in Vietnamese prayer discourse.",

        "participationPattern": "communal_petition",
        "explanation": "Community seeks divine aid through collective prayer. Audience joins in spiritual petition, aligning hearts/minds with supplicant.",

        "emotionalValence": "reverent_hopeful",
        "explanation": "Combines deep respect for divine authority with hope for blessings. Humble but confident in tradition of divine-human reciprocity."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [2],
        "totalPhrases": 6,
        "coverage": "16.7%",
        "positionDistribution": {
          "beginning": 1,
          "middle": 0,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 6,
        "explanation": "Thượng appears in various prayer songs and ceremonial music. Not unique to this song but always marks ritual/spiritual register. Common in formal religious contexts.",

        "similarExpressions": [
          {
            "expression": "Trời Phật (Heaven and Buddha - in other prayers)",
            "similarity": "high",
            "difference": "Trời Phật is Buddhist-influenced syncretic term. Thượng is more ancient, pre-Buddhist Vietnamese cosmology. Both invoke supreme powers."
          },
          {
            "expression": "Ngọc Hoàng (Jade Emperor - Daoist influence)",
            "similarity": "medium",
            "difference": "Ngọc Hoàng is specific deity from Chinese Daoism. Thượng is more abstract, indigenous Vietnamese concept of supreme heaven."
          }
        ],

        "regionalDistribution": "Nationwide - concept appears in all regions' ceremonial songs with slight variations in how 'supreme' is conceptualized",
        "genreDistribution": "Prayer songs, ceremonial music, harvest blessings, new year songs. Not found in secular love songs or work songs.",
        "historicalPersistence": "Ancient (1000+ years), predating Chinese influences, continuing through all historical periods to present in traditional communities"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce 'Thượng' with nặng tone (heavy/low) - gravity and weight appropriate for supreme authority",
          "Slight upward gaze when singing this word (if staging) - looking toward heaven realm",
          "'Chúc' (blessing) with sắc tone (rising) - reaching upward in supplication",
          "Slow, deliberate delivery - not rushed. Each syllable carries cosmological weight"
        ],

        "culturalSensitivity": [
          "This is active religious language, not archaic. Some Vietnamese still use this in prayers",
          "Thượng represents indigenous Vietnamese cosmology - not borrowed from China, though later syncretized",
          "Respect the seriousness - this is equivalent to invoking 'God' or 'Heaven' in Western traditions",
          "For Vietnamese diaspora, this may connect to family altars, ancestor veneration - handle with care"
        ],

        "pedagogicalApproach": [
          "Step 1: Explain Vietnamese concept of 'heaven' - not afterlife but cosmic realm above",
          "Step 2: Teach spatial metaphor system: UP = GOOD/DIVINE, DOWN = EARTH/MUNDANE",
          "Step 3: Show how Thượng relates to Confucian 'Thiên' (heaven) but predates it",
          "Step 4: Discuss syncretism - how Buddhism, Daoism, Confucianism blended with indigenous beliefs",
          "Step 5: Compare to ritual language in other traditions (Latin in Catholic mass, Sanskrit mantras)",
          "Step 6: Practice pronunciation with awareness of register - this is high/formal language"
        ],

        "commonMisinterpretations": [
          "❌ 'Just means high/upper' → ✅ Cosmological term for supreme divine realm/authority",
          "❌ 'Chinese concept (Confucian)' → ✅ Indigenous Vietnamese, later syncretized with Chinese traditions",
          "❌ 'Generic blessing' → ✅ Specific invocation of supreme powers in ritual register",
          "❌ 'Poetic metaphor' → ✅ Literal theological language - Vietnamese truly believed in Thượng realm"
        ]
      }
    },

    {
      "expression": "Năm trống",
      "literal": "Five drums",
      "meaning": "Symbolic number five combined with sacred drums - ritual formula for completeness/cosmic order",
      "type": "symbolic_number_ritual_formula",
      "phraseIds": [3, 4, 5],

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Number five is ancient in Vietnamese/East Asian cosmology: Five Elements (Metal, Wood, Water, Fire, Earth), Five Directions (4 cardinals + center), Five Virtues. Drums in fives appear in pre-modern ritual contexts.",

        "regionalSpecificity": 6,
        "explanation": "Five Elements cosmology is pan-East Asian (China, Vietnam, Korea). Specifically Vietnamese variant combines this with drum culture. Not unique to one region but not universal globally.",

        "symbolicLoad": 10,
        "explanation": "Layers of symbolism: 1) Five Elements - cosmic completeness, 2) Five drums = full ceremonial set, 3) Five = human body (five senses, limbs), 4) Center + four directions = totality. Maximum symbolic density.",

        "ritualSignificance": 9,
        "explanation": "Five is essential ritual number. Ceremonies often involve five of everything: five offerings, five incense sticks, five prostrations. Five drums invoke complete cosmic order.",

        "transmissionImportance": 9,
        "explanation": "Critical for understanding Vietnamese cosmology, numerology, ritual structure. Five Elements thinking permeates Vietnamese medicine, philosophy, art, architecture. Essential cultural knowledge.",

        "emotionalResonance": 7,
        "explanation": "Evokes sense of cosmic completeness, order, balance. For culturally attuned listeners, 'five' resonates with deep harmony and totality. Satisfying, comprehensive."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "1) Literal: five physical drums, 2) Symbolic: Five Elements cosmic system, 3) Ritual: complete ceremonial set, 4) Philosophical: totality/perfection",

        "crossDomainMapping": 9,
        "explanation": "NUMBER → COSMIC ORDER → COMPLETENESS. Five maps to: balance, totality, harmony, cosmic structure, ritual perfection. Highly abstract, multi-domain mapping.",

        "culturalPrerequisites": 9,
        "explanation": "Requires extensive knowledge: Five Elements theory, Vietnamese cosmology, numerological symbolism, drum's role in rituals. Non-trivial philosophical background needed.",

        "idiomaticity": 8,
        "explanation": "Highly fixed in ritual contexts. 'Năm trống' is formulaic, not compositional. Cannot substitute 'ba trống' (three drums) or 'bảy trống' (seven drums) without breaking ritual logic.",

        "contextDependence": 8,
        "explanation": "Full significance requires cosmological context. Modern Vietnamese might hear 'five drums' literally, missing deep Five Elements/ritual implications.",

        "pedagogicalChallenge": 9,
        "explanation": "Extremely difficult to teach. Requires explaining entire East Asian cosmological system, numerology, philosophy. No quick explanation possible."
      },

      "semanticNetwork": {
        "sourceDomain": "QUANTITY_NUMBER",
        "targetDomain": "COSMIC_COMPLETENESS",
        "mappings": [
          {
            "source": "five (quantity)",
            "target": "cosmic totality (Five Elements)"
          },
          {
            "source": "five drums (objects)",
            "target": "complete ritual set (fullness)"
          },
          {
            "source": "five-ness (property)",
            "target": "balance/harmony (philosophical ideal)"
          }
        ],
        "conceptualMetaphor": "COMPLETENESS IS FIVE-NESS"
      },

      "usagePatterns": {
        "phrasePosition": "beginning_of_blessing_phrases",
        "explanation": "Phrases 3, 4, 5 all start with 'Năm trống cơm...' - anaphoric repetition creating prayer rhythm. Establishes ritual formula.",

        "syntacticRole": "subject",
        "explanation": "Subject of blessing clauses. Grammatically, 'Five drums' is the agent/source of the blessings that follow. Drums as active ritual force.",

        "discourseFunction": "ritual_anchor",
        "explanation": "Repeated invocation anchors the blessing structure. Each repetition reinforces cosmic completeness before stating specific blessing.",

        "participationPattern": "communal_responsive_chant",
        "explanation": "Repetitive structure invites audience to join in or anticipate. Builds communal rhythm, meditative state. Call-and-response potential.",

        "emotionalValence": "solemn_hopeful",
        "explanation": "Combines ritual seriousness with optimistic expectation. Five drums = proper cosmic order, therefore blessings should flow naturally."
      },

      "statistics": {
        "occurrences": 3,
        "phraseIds": [3, 4, 5],
        "totalPhrases": 6,
        "coverage": "50%",
        "positionDistribution": {
          "beginning": 3,
          "middle": 0,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 8,
        "explanation": "Five drums as ritual formula is relatively rare in folk songs. Most songs mention drums generally. Specific 'năm trống' construction is distinctive to ceremonial/prayer songs.",

        "similarExpressions": [
          {
            "expression": "tam tam (three-three in other ritual songs)",
            "similarity": "medium",
            "difference": "Tam tam uses three (Buddhist/Daoist sacred number). Năm uses five (Vietnamese/Confucian). Both are symbolic numbers but different cosmologies."
          },
          {
            "expression": "chín trống (nine drums in royal/court music)",
            "similarity": "medium",
            "difference": "Nine is imperial number (highest yang). Five is common people's cosmic number. Social hierarchy reflected in numerology."
          }
        ],

        "regionalDistribution": "Primarily Northern Vietnam. Central/Southern traditions have different numerological preferences.",
        "genreDistribution": "Ceremonial prayer songs, harvest blessings, village ritual music. Not in love songs, lullabies, or work songs.",
        "historicalPersistence": "Ancient (1000+ years), based on Five Elements cosmology integrated into Vietnamese culture since Chinese influence. Continues in traditional ceremonies."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Emphasize 'Năm' (five) with strong ngang tone - stable, grounding. This is the cosmic anchor.",
          "Pause slightly after 'Năm trống' before 'cơm' - let the five drums resonate symbolically",
          "Consistent rhythm across three repetitions - like ritual chant, not varied melody",
          "Imagine five bronze drums in semicircle - visualize the physical ritual space while singing"
        ],

        "culturalSensitivity": [
          "Five Elements cosmology is living philosophy for some Vietnamese, not historical curiosity",
          "This is not 'superstition' - it's sophisticated cosmological system with medical, philosophical applications",
          "Numerology in East Asian traditions is as complex as Western astrology - treat with intellectual respect",
          "For Vietnamese diaspora, 'năm' may connect to family rituals, altar practices - handle carefully"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach Five Elements (Ngũ Hành): Metal, Wood, Water, Fire, Earth - basic cosmology",
          "Step 2: Show how five appears everywhere in Vietnamese culture (medicine, architecture, art)",
          "Step 3: Explain generative/destructive cycles of Five Elements - dynamic system, not static",
          "Step 4: Connect to ritual structure - why ceremonies use five offerings, five incense, etc.",
          "Step 5: Compare to Western systems (four elements, seven virtues) - all cultures systematize cosmos",
          "Step 6: Practice pronunciation while visualizing five drums in ritual arrangement"
        ],

        "commonMisinterpretations": [
          "❌ 'Literally five drums, no deeper meaning' → ✅ Symbolic invocation of cosmic completeness via Five Elements",
          "❌ 'Random number, could be any amount' → ✅ Five is THE number for cosmic order in Vietnamese cosmology",
          "❌ 'Chinese influence, not Vietnamese' → ✅ Vietnamese adapted Five Elements into indigenous drum culture uniquely",
          "❌ 'Poetic exaggeration' → ✅ Precise cosmological/ritual language with philosophical specificity"
        ]
      }
    },

    {
      "expression": "thiên hạ thái bình",
      "literal": "all under heaven, great peace",
      "meaning": "Universal peace across the entire world/cosmos - highest blessing in Confucian-influenced Vietnamese tradition",
      "type": "cosmic_blessing_formula",
      "phraseIds": [3],

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "'Thiên hạ' (all under heaven) is ancient Chinese/Confucian concept adopted into Vietnamese. 'Thái bình' (great peace) is classical ideal from pre-modern East Asian political philosophy. Both terms 1000+ years old.",

        "regionalSpecificity": 4,
        "explanation": "Pan-East Asian concept (China, Vietnam, Korea, Japan). Not specific to Vietnam, but Vietnamese interpretation has local flavor. Nearly universal in Sinosphere.",

        "symbolicLoad": 10,
        "explanation": "Maximum symbolic load: 1) Cosmological - heaven and earth in harmony, 2) Political - ideal governance, 3) Social - community peace, 4) Spiritual - divine order manifest. Ultimate blessing concept.",

        "ritualSignificance": 8,
        "explanation": "Common in New Year prayers, harvest blessings, coronation ceremonies. Invokes highest possible state of order. Not essential to all rituals but marks most solemn blessings.",

        "transmissionImportance": 8,
        "explanation": "Critical for understanding Vietnamese political philosophy, social ideals, relationship to Confucian tradition. Key concept in classical literature, philosophy, statecraft.",

        "emotionalResonance": 8,
        "explanation": "Profoundly moving for those steeped in Confucian tradition. Represents ultimate human aspiration - peace for all beings. Carries weight of centuries of prayers for this ideal."
      },

      "complexityMetrics": {
        "layersOfMeaning": 5,
        "explanation": "1) Literal: world peace, 2) Cosmological: heaven-earth harmony, 3) Political: ideal governance, 4) Social: community tranquility, 5) Moral: virtue prevailing. Maximum interpretive layers.",

        "crossDomainMapping": 9,
        "explanation": "SPATIAL EXTENT → MORAL STATE. 'All under heaven' (spatial totality) maps to 'great peace' (ethical/social ideal). Complex mapping across cosmology, politics, ethics.",

        "culturalPrerequisites": 9,
        "explanation": "Requires understanding: Confucian political philosophy, Mandate of Heaven, Vietnamese adaptation of Chinese classics, relationship between cosmic and social order. Extensive background needed.",

        "idiomaticity": 9,
        "explanation": "Completely frozen expression. Cannot paraphrase or substitute without losing classical register and philosophical precision. Fixed four-character formula (tứ tự).",

        "contextDependence": 6,
        "explanation": "Moderately context-dependent. Meaning is clear even out of context (world peace), but ritual/philosophical weight requires ceremonial frame.",

        "pedagogicalChallenge": 9,
        "explanation": "Extremely difficult to teach. Requires explaining Confucianism, Mandate of Heaven, Vietnamese political history, classical Chinese literary forms. No simple explanation."
      },

      "semanticNetwork": {
        "sourceDomain": "SPATIAL_COSMOLOGICAL_EXTENT",
        "targetDomain": "MORAL_SOCIAL_ORDER",
        "mappings": [
          {
            "source": "heaven above",
            "target": "cosmic/divine order"
          },
          {
            "source": "all under heaven (totality)",
            "target": "entire human society"
          },
          {
            "source": "great peace (harmony)",
            "target": "ideal state of governance and virtue"
          }
        ],
        "conceptualMetaphor": "MORAL ORDER IS COSMIC HARMONY"
      },

      "usagePatterns": {
        "phrasePosition": "ending_of_first_blessing",
        "explanation": "Phrase 3 ends with this - climax of first blessing. Starts cosmic (five drums), ends cosmic (world peace). Maximal scope.",

        "syntacticRole": "predicate_result",
        "explanation": "Result of five drums + rice: world peace. Grammatically, this is the outcome/consequence of proper ritual and abundance.",

        "discourseFunction": "climax_blessing",
        "explanation": "Highest possible blessing - world peace. Sets the ceiling for subsequent blessings (which narrow to household, then quality). Cosmic → local structure.",

        "participationPattern": "communal_aspiration",
        "explanation": "Audience shares this ultimate hope. Not just individual wish but collective dream of Vietnamese people across generations. Powerful communal resonance.",

        "emotionalValence": "profound_hopeful",
        "explanation": "Serious, weighty hope. Not naive optimism but deep longing informed by history of conflict. Vietnamese know the value of peace."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [3],
        "totalPhrases": 6,
        "coverage": "16.7%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 5,
        "explanation": "Common classical phrase appearing in many ceremonial songs, prayers, political texts. Not unique to this song. Standard blessing formula in formal Vietnamese.",

        "similarExpressions": [
          {
            "expression": "an cư lạc nghiệp (peaceful dwelling, happy work - other blessings)",
            "similarity": "medium",
            "difference": "An cư lạc nghiệp is individual/household scale. Thiên hạ thái bình is cosmic/universal. Both are classical four-character formulas but different scopes."
          },
          {
            "expression": "quốc thái dân an (nation prosperous, people peaceful - royal proclamations)",
            "similarity": "high",
            "difference": "Quốc thái dân an is political/national. Thiên hạ thái bình is cosmological/universal. Very similar structure and sentiment."
          }
        ],

        "regionalDistribution": "Nationwide - appears in all regions' formal/ceremonial language. Not dialectal.",
        "genreDistribution": "Ceremonial songs, prayers, New Year blessings, political speeches, classical poetry. Very formal register.",
        "historicalPersistence": "Ancient (1000+ years from Chinese classics), continuing through all periods. Still used in formal Vietnamese today (government speeches, weddings, etc.)"
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Slow, deliberate delivery - each syllable carries philosophical weight",
          "'Thiên hạ' with slight upward reach in gesture (if staging) - invoking the cosmic scope",
          "'Thái bình' with open, expansive arm gesture - peace radiating outward",
          "Final 'bình' with ngang tone (level) - settling into peace, resolution"
        ],

        "culturalSensitivity": [
          "This is not empty rhetoric - Vietnamese history of war makes peace deeply meaningful",
          "Thiên hạ thái bình appears in political discourse - be aware of its use in propaganda and genuine aspiration",
          "For Vietnamese diaspora, especially refugees, this phrase carries trauma and hope - handle with care",
          "Respect the Confucian philosophical tradition behind this - serious intellectual heritage"
        ],

        "pedagogicalApproach": [
          "Step 1: Explain 'thiên hạ' - heaven as roof, earth as floor, humans in between",
          "Step 2: Teach Confucian concept of 'thái bình' - great peace as harmony of all elements",
          "Step 3: Show Vietnamese history - wars with China, France, America - why peace matters",
          "Step 4: Connect to Mandate of Heaven - peace proves virtuous governance",
          "Step 5: Compare to Western 'Pax Romana', 'Peace on Earth' - universal human longing",
          "Step 6: Practice four-character rhythm (tứ tự) - classical Vietnamese literary form"
        ],

        "commonMisinterpretations": [
          "❌ 'Generic wish for peace' → ✅ Specific Confucian philosophical ideal with political implications",
          "❌ 'Individual peace of mind' → ✅ Universal cosmic-social order and harmony",
          "❌ 'Modern concept' → ✅ Ancient classical phrase from Confucian canon",
          "❌ 'Just poetic flourish' → ✅ Precise philosophical-political language with 1000+ year history"
        ]
      }
    },

    {
      "expression": "cơm",
      "literal": "cooked rice",
      "meaning": "Metonymy for food, sustenance, prosperity, survival - the fundamental need in agricultural society",
      "type": "cultural_metonymy",
      "phraseIds": [3, 4, 5],

      "culturalWeights": {
        "historicalDepth": 10,
        "explanation": "Rice cultivation defines Vietnamese civilization for 4,000+ years. 'Cơm' is not just food but cultural identity. Ancient beyond recorded history.",

        "regionalSpecificity": 5,
        "explanation": "Pan-East Asian rice culture (China, Japan, Korea, Southeast Asia). Vietnamese variant has local practices but rice centrality is regional, not unique to Vietnam.",

        "symbolicLoad": 9,
        "explanation": "Cơm symbolizes: 1) Life itself (no rice = death), 2) Mother's care (first solid food), 3) Social bonds (sharing rice = community), 4) Prosperity (full rice pot = wealth), 5) Agricultural success. Maximum symbolic density.",

        "ritualSignificance": 9,
        "explanation": "Essential to ancestor altars (offerings), weddings (rice throwing), funerals (rice in mouth), New Year (bánh chưng rice cake). Central to all Vietnamese life-cycle rituals.",

        "transmissionImportance": 10,
        "explanation": "Absolutely critical. Understanding Vietnamese culture without understanding rice is impossible. Not optional - fundamental to identity, worldview, language, practice.",

        "emotionalResonance": 10,
        "explanation": "Profoundly emotional. For Vietnamese, especially those who experienced famine, 'cơm' evokes: survival, mother's love, home, safety, identity. Deepest emotional associations."
      },

      "complexityMetrics": {
        "layersOfMeaning": 4,
        "explanation": "1) Literal: cooked rice (food), 2) Metonymic: all food/sustenance, 3) Symbolic: prosperity/survival, 4) Cultural identity: Vietnamese-ness itself",

        "crossDomainMapping": 8,
        "explanation": "FOOD → LIFE → IDENTITY. Rice maps to survival, prosperity, cultural belonging, mother's care. Moderately complex multi-domain mapping.",

        "culturalPrerequisites": 7,
        "explanation": "Requires understanding: rice agriculture's centrality, wet rice cultivation, Vietnamese food culture, famine history, ritual uses of rice. Significant background needed.",

        "idiomaticity": 7,
        "explanation": "Semi-fixed in ritual contexts. 'Cơm' in blessings always means prosperity, not literal rice. Idiomatic but compositional enough to be transparent.",

        "contextDependence": 5,
        "explanation": "Moderately context-free. Even without context, 'cơm' suggests sustenance/prosperity in Vietnamese. Full weight requires agricultural cultural knowledge.",

        "pedagogicalChallenge": 6,
        "explanation": "Moderately difficult to teach. Westerners can grasp 'rice = staple food', but full symbolic/emotional load requires experiencing rice culture."
      },

      "semanticNetwork": {
        "sourceDomain": "STAPLE_FOOD",
        "targetDomain": "LIFE_PROSPERITY_IDENTITY",
        "mappings": [
          {
            "source": "cooked rice (edible)",
            "target": "sustenance/survival"
          },
          {
            "source": "rice abundance (quantity)",
            "target": "prosperity/wealth"
          },
          {
            "source": "sharing rice (social act)",
            "target": "community bonds/care"
          },
          {
            "source": "rice cultivation (practice)",
            "target": "Vietnamese cultural identity"
          }
        ],
        "conceptualMetaphor": "RICE IS LIFE"
      },

      "usagePatterns": {
        "phrasePosition": "middle_of_blessing_phrases",
        "explanation": "Phrases 3, 4, 5 all have structure: 'Năm trống cơm [blessing]'. Cơm bridges cosmic symbol (drums) and specific blessing. Mediating role.",

        "syntacticRole": "object_of_blessing",
        "explanation": "Grammatically, cơm is what the five drums bless/ensure. Object of the ritual action. Drums → rice → peace/sufficiency.",

        "discourseFunction": "concrete_anchor",
        "explanation": "Grounds abstract blessings (world peace, sufficiency) in tangible reality - rice. Makes cosmic blessing relatable, practical.",

        "participationPattern": "communal_longing",
        "explanation": "Everyone needs rice - universal need unites audience. Shared agricultural anxiety/hope. Deeply communal resonance.",

        "emotionalValence": "fundamental_necessity",
        "explanation": "Not luxury or decoration - this is survival. Emotional tone is serious, grounded, earthy. Rice hunger is real hunger."
      },

      "statistics": {
        "occurrences": 3,
        "phraseIds": [3, 4, 5],
        "totalPhrases": 6,
        "coverage": "50%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 3,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 2,
        "explanation": "Extremely common in Vietnamese songs, proverbs, blessings. Nearly universal in agricultural/ceremonial music. Not unique at all - ubiquitous cultural symbol.",

        "similarExpressions": [
          {
            "expression": "gạo (uncooked rice - in other contexts)",
            "similarity": "high",
            "difference": "Gạo is commodity/wealth (can trade). Cơm is prepared food/sustenance (immediately consumable). Different aspects of rice centrality."
          },
          {
            "expression": "lúa (rice plant - harvest songs)",
            "similarity": "high",
            "difference": "Lúa is agricultural labor, growing cycle. Cơm is the result, the meal. Same rice but different stages of cycle."
          }
        ],

        "regionalDistribution": "Nationwide - every Vietnamese region has rice-based cuisine and culture. Universal in Vietnam.",
        "genreDistribution": "All genres - work songs, love songs, lullabies, ceremonial songs, proverbs. Omnipresent in Vietnamese verbal art.",
        "historicalPersistence": "Ancient (4,000+ years of rice culture) to present. Unchanging centrality across all historical periods."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Pronounce 'cơm' with ngang tone (level, steady) - grounding, stable. Rice is the foundation.",
          "Slight emphasis on 'cơm' - don't rush past it. This is the heart of the blessing.",
          "Imagine steaming rice, smell the aroma - let sensory memory inform vocal warmth",
          "If gestures used: hands cupped as if holding rice bowl - embodying the offering"
        ],

        "culturalSensitivity": [
          "For Vietnamese who experienced famine (wars, collectivization), rice hunger is real trauma",
          "Wasting rice is deeply offensive in Vietnamese culture - showing respect matters",
          "Rice is sacred on ancestor altars - not decoration, actual spiritual offering",
          "For Vietnamese diaspora, rice connects to homeland, mother's cooking - powerful nostalgia trigger"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach basics - rice is staple, not side dish, in Vietnamese meals",
          "Step 2: Show wet rice cultivation - labor-intensive, community effort, shapes society",
          "Step 3: Explain Vietnamese saying: 'Ăn cơm chưa?' (eaten rice yet?) = 'how are you?' - shows centrality",
          "Step 4: Discuss famine history - French colonialism, war, collectivization - why rice scarcity is traumatic",
          "Step 5: Explore ritual uses - altars, ceremonies, life passages all involve rice",
          "Step 6: Compare to bread in Western culture, but note rice is even more central to Vietnamese identity"
        ],

        "commonMisinterpretations": [
          "❌ 'Just food, any staple would do' → ✅ Specifically rice, 4,000+ years of cultural identity",
          "❌ 'Literal rice only' → ✅ Metonymy for all sustenance, prosperity, survival, cultural identity",
          "❌ 'Poetic symbol' → ✅ Concrete material reality - Vietnamese actually depended on rice for survival",
          "❌ 'Same as Western 'bread of life' metaphor' → ✅ More foundational - rice IS Vietnamese culture, not just metaphor"
        ]
      }
    },

    {
      "expression": "bưng trống",
      "literal": "carrying/offering [rice] to the drum",
      "meaning": "Ritual action of presenting food offerings to sacred drum in thanksgiving after successful harvest",
      "type": "ritual_action_phrase",
      "phraseIds": [6],

      "culturalWeights": {
        "historicalDepth": 8,
        "explanation": "Drum worship with food offerings dates to pre-modern Vietnamese village culture. Thanksgiving rituals after harvest are centuries old, predating French colonialism.",

        "regionalSpecificity": 7,
        "explanation": "Northern and Central Vietnamese practice. Not universal nationwide but regionally significant. Southern Vietnam has different harvest thanksgiving traditions.",

        "symbolicLoad": 8,
        "explanation": "Symbolizes: 1) Reciprocity - drums blessed, humans give thanks, 2) Completion - harvest cycle closed, 3) Community - shared thanksgiving, 4) Spiritual-material exchange. Rich symbolic action.",

        "ritualSignificance": 9,
        "explanation": "Essential closing action in harvest blessing ceremonies. Completes the cycle: prayer → blessing → harvest → thanksgiving. Ritual cannot be complete without offering.",

        "transmissionImportance": 7,
        "explanation": "Important for understanding Vietnamese agricultural ritual cycle and concept of reciprocity with spiritual realm. Key practice to preserve.",

        "emotionalResonance": 8,
        "explanation": "Deeply satisfying - completion, gratitude, relief. After hard work and divine help, successful harvest brings profound thankfulness. Emotional release."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "1) Literal: physical act of carrying rice bowl to drum, 2) Ritual: formalized thanksgiving gesture, 3) Spiritual: reciprocal exchange with divine/ancestors",

        "crossDomainMapping": 7,
        "explanation": "PHYSICAL ACTION → SPIRITUAL RECIPROCITY. Carrying rice maps to: gratitude, completion, cosmic balance restored. Moderate abstract mapping.",

        "culturalPrerequisites": 8,
        "explanation": "Requires understanding: drum worship, harvest cycle, reciprocity principle in Vietnamese spirituality, ritual structure of ceremonies. Significant background needed.",

        "idiomaticity": 7,
        "explanation": "Fixed in ritual contexts. 'Bưng' (carry with both hands, formal) + 'trống' is ritual register, not compositional everyday speech.",

        "contextDependence": 8,
        "explanation": "Full meaning requires harvest/ritual context. Out of context, might seem like literal carrying. Ceremonial frame is essential.",

        "pedagogicalChallenge": 7,
        "explanation": "Moderately difficult. Need to teach ritual structure, reciprocity concept, drum's sacred role. Performative action easier to demonstrate than abstract concepts."
      },

      "semanticNetwork": {
        "sourceDomain": "PHYSICAL_OFFERING_ACTION",
        "targetDomain": "SPIRITUAL_RECIPROCITY",
        "mappings": [
          {
            "source": "carrying rice (action)",
            "target": "presenting gratitude/thanksgiving"
          },
          {
            "source": "placing offering at drum (gesture)",
            "target": "closing ritual cycle, restoring balance"
          },
          {
            "source": "formalized carrying posture (bưng)",
            "target": "respect and reverence"
          }
        ],
        "conceptualMetaphor": "GRATITUDE IS OFFERING"
      },

      "usagePatterns": {
        "phrasePosition": "ending",
        "explanation": "Phrase 6, final action. Completes song's arc: enter shrine → pray → receive blessings → give thanks. Narrative closure.",

        "syntacticRole": "action_verb",
        "explanation": "Main verb of final clause. Grammatically, this is the culminating action after 'được mùa hoa' (successful harvest). Action as resolution.",

        "discourseFunction": "ritual_completion",
        "explanation": "Closes the blessing cycle. After cosmic and household blessings, this action fulfills reciprocal obligation. Satisfying narrative/ritual arc.",

        "participationPattern": "enacted_gesture",
        "explanation": "Audience may mime the carrying gesture. Performative - can be physically enacted. Embodied participation possibility.",

        "emotionalValence": "grateful_reverent",
        "explanation": "Combines gratitude for harvest with reverence for sacred drum. Humble thankfulness. Relief and satisfaction."
      },

      "statistics": {
        "occurrences": 1,
        "phraseIds": [6],
        "totalPhrases": 6,
        "coverage": "16.7%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 0,
          "ending": 1
        }
      },

      "comparativeContext": {
        "uniquenessScore": 7,
        "explanation": "Specific 'bưng trống' construction is relatively rare. General offering practices common, but this precise drum-focused phrase is distinctive to drum worship songs.",

        "similarExpressions": [
          {
            "expression": "dâng hương (offering incense - other ritual songs)",
            "similarity": "high",
            "difference": "Dâng hương is Buddhist/ancestor worship. Bưng trống is animistic drum worship. Both are offerings but different spiritual contexts."
          },
          {
            "expression": "cúng cơm (food offering ritual - general term)",
            "similarity": "medium",
            "difference": "Cúng cơm is generic food offering. Bưng trống is specific to drum, with 'bưng' indicating formal carrying posture. More specialized."
          }
        ],

        "regionalDistribution": "Northern Vietnam (Red River Delta), parts of Central Vietnam. Rare in South where drum worship less prevalent.",
        "genreDistribution": "Ceremonial/harvest songs, village ritual music. Not in love songs, lullabies, or work songs.",
        "historicalPersistence": "Pre-colonial tradition continuing through 20th century, declining post-1945. Some communities still practice."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "'Bưng' with ngang tone (level, steady) - formal, respectful carrying action",
          "'Trống' with sắc tone (rising) - upward lift toward sacred drum",
          "Gesture (if staging): both hands together at chest level, as if carrying bowl - formality of 'bưng' vs casual one-handed carry",
          "Slight forward bow when singing this - embodying the offering posture"
        ],

        "culturalSensitivity": [
          "This is living practice in some communities - not museum artifact or quaint custom",
          "Offering food to drums is serious spiritual reciprocity, not superstition",
          "Respect the animistic tradition - predates Buddhism, indigenous Vietnamese spirituality",
          "For Vietnamese from village backgrounds, this may evoke childhood memories of actual ceremonies"
        ],

        "pedagogicalApproach": [
          "Step 1: Teach 'bưng' gesture - formal two-handed carrying (vs casual 'cầm'). Practice the posture.",
          "Step 2: Explain harvest thanksgiving cycle - sow, tend, pray, harvest, thank. Full agricultural ritual year.",
          "Step 3: Show reciprocity principle - spirits/ancestors help, humans reciprocate. Mutual obligation.",
          "Step 4: Watch videos of Vietnamese village ceremonies (if available) - see actual bưng trống in context",
          "Step 5: Compare to other thanksgiving rituals (Christian harvest festivals, Sukkot, etc.) - universal human practice",
          "Step 6: Practice singing with offering gesture - embody the action"
        ],

        "commonMisinterpretations": [
          "❌ 'Casually bringing rice' → ✅ Formalized ritual offering with specific posture and reverence",
          "❌ 'Feeding the drum (instrument)' → ✅ Offering to drum as sacred object/spirit dwelling",
          "❌ 'One-time action' → ✅ Part of annual cycle, repeated each harvest",
          "❌ 'Individual devotion' → ✅ Community thanksgiving, collective ritual"
        ]
      }
    },

    {
      "expression": "Năm trống cơm... (parallel structure)",
      "literal": "Repetitive prayer formula: Five drums + rice + blessing",
      "meaning": "Anaphoric repetition creating meditative rhythm and emphasizing cosmic-household-quality progression of blessings",
      "type": "parallel_structure_prayer_formula",
      "phraseIds": [3, 4, 5],

      "culturalWeights": {
        "historicalDepth": 9,
        "explanation": "Parallel repetition (đối ngẫu) is ancient in Vietnamese/East Asian poetry and ritual language. Buddhist chants, Confucian prayers, folk songs all use this. 1000+ years tradition.",

        "regionalSpecificity": 4,
        "explanation": "Pan-East Asian rhetorical device. Chinese, Korean, Japanese also use parallel structures in formal/ritual language. Not unique to Vietnam but locally adapted.",

        "symbolicLoad": 7,
        "explanation": "Structure itself symbolizes: 1) Completeness (three is complete in East Asian numerology), 2) Progression (cosmic → household → quality), 3) Meditative state (repetition induces trance). Symbolic form.",

        "ritualSignificance": 8,
        "explanation": "Repetitive structure is core to ritual efficacy. Chanting same formula three times reinforces prayer, builds spiritual energy. Not decorative - functionally ritual.",

        "transmissionImportance": 8,
        "explanation": "Critical for understanding Vietnamese poetic/ritual rhetoric. Parallel structures appear everywhere: proverbs, poetry, formal speeches. Essential literary/cultural knowledge.",

        "emotionalResonance": 7,
        "explanation": "Repetition is comforting, meditative. Creates communal rhythm. Audience can join in after first iteration. Emotionally stabilizing, unifying."
      },

      "complexityMetrics": {
        "layersOfMeaning": 3,
        "explanation": "1) Rhetorical: parallel structure device (đối ngẫu), 2) Ritual: threefold repetition for efficacy, 3) Narrative: progression from cosmic to local blessings",

        "crossDomainMapping": 6,
        "explanation": "REPETITIVE FORM → RITUAL POWER. Structure itself (not just content) carries meaning. Moderate abstraction - form as function.",

        "culturalPrerequisites": 7,
        "explanation": "Requires understanding: parallel structure in East Asian poetics, ritual function of repetition, threefold pattern significance. Moderate cultural background needed.",

        "idiomaticity": 8,
        "explanation": "Highly formulaic in prayer contexts. The three-blessing structure (cosmic, household, quality) is ritual template, not improvised.",

        "contextDependence": 7,
        "explanation": "Requires ritual/prayer context to understand function. Out of context, might seem redundant. Ceremonial frame reveals purpose.",

        "pedagogicalChallenge": 6,
        "explanation": "Moderately difficult. Western students may see redundancy rather than ritual purpose. Need to shift from information-density to ritual-efficacy mindset."
      },

      "semanticNetwork": {
        "sourceDomain": "LINGUISTIC_REPETITION",
        "targetDomain": "RITUAL_EFFICACY",
        "mappings": [
          {
            "source": "repeating formula (action)",
            "target": "building spiritual power/energy"
          },
          {
            "source": "three iterations (quantity)",
            "target": "completeness/closure (three is complete)"
          },
          {
            "source": "parallel structure (form)",
            "target": "cosmic order reflected in language"
          }
        ],
        "conceptualMetaphor": "REPETITION IS RITUAL POWER"
      },

      "usagePatterns": {
        "phrasePosition": "middle_core",
        "explanation": "Phrases 3, 4, 5 form the heart of the song. After opening (shrine entry, invocation), these three blessings are the purpose of the ritual.",

        "syntacticRole": "parallel_clauses",
        "explanation": "Three grammatically parallel blessing statements. Same structure (Năm trống cơm + X) with X varying. Syntactic parallelism mirrors conceptual parallelism.",

        "discourseFunction": "progressive_blessing",
        "explanation": "Not mere repetition - progression. 1) World peace (cosmic), 2) Household sufficiency (local), 3) Quality/variety (refinement). Narrowing and deepening.",

        "participationPattern": "communal_chant",
        "explanation": "Repetitive structure invites call-and-response or communal chanting. After hearing once, audience can join. Builds communal energy.",

        "emotionalValence": "meditative_hopeful",
        "explanation": "Repetition induces meditative state. Each iteration reinforces hope. Rhythm is comforting, stabilizing. Serious but optimistic."
      },

      "statistics": {
        "occurrences": 3,
        "phraseIds": [3, 4, 5],
        "totalPhrases": 6,
        "coverage": "50%",
        "positionDistribution": {
          "beginning": 0,
          "middle": 3,
          "ending": 0
        }
      },

      "comparativeContext": {
        "uniquenessScore": 5,
        "explanation": "Parallel structure is common in Vietnamese ritual/poetic language. This specific three-blessing progression is distinctive but the technique is widespread.",

        "similarExpressions": [
          {
            "expression": "Triple repetition in Buddhist chants (Tam quy)",
            "similarity": "high",
            "difference": "Buddhist chants repeat identical formulas three times. This varies content while maintaining structure. Both use three for ritual completeness."
          },
          {
            "expression": "Parallel couplets in đối đáp (call-response songs)",
            "similarity": "medium",
            "difference": "Đối đáp has two-line parallelism (couplets). This is three-phrase anaphora. Different numbers but same rhetorical principle."
          }
        ],

        "regionalDistribution": "Nationwide - parallel structures appear in all Vietnamese regions' formal/poetic language. Universal rhetorical device.",
        "genreDistribution": "Ritual songs, formal poetry (song thất ngôn), proverbs, blessings. Common in high register, less in casual speech.",
        "historicalPersistence": "Ancient (from Chinese literary influence 1000+ years ago) to present. Still active in Vietnamese rhetoric and poetry."
      },

      "interpretiveGuidance": {
        "performanceTips": [
          "Maintain identical rhythm/melody for 'Năm trống cơm' in all three iterations - consistency is key",
          "Slight pause between iterations - let each blessing resonate before starting next",
          "Crescendo across three iterations? OR steady repetition? (Both valid - crescendo = building energy, steady = meditative)",
          "Encourage audience to join on second/third iteration - communal participation"
        ],

        "culturalSensitivity": [
          "Repetition is not redundancy in ritual contexts - it's functional, not decorative",
          "Three is sacred/complete number in East Asian traditions - respect the numerology",
          "This is active prayer language, not archaic - some Vietnamese still use these formulas",
          "For Vietnamese audiences, this may trigger memories of ceremonies, grandparents praying - emotionally powerful"
        ],

        "pedagogicalApproach": [
          "Step 1: Explain parallel structure (đối ngẫu) - ancient East Asian rhetorical device, still common in Vietnamese",
          "Step 2: Teach threefold pattern significance - three is complete (beginning-middle-end, past-present-future, etc.)",
          "Step 3: Show progression within repetition: cosmic → household → quality. Not redundant, narrowing focus.",
          "Step 4: Compare to Western rhetoric: 'I came, I saw, I conquered' (tricolon), 'government of/by/for the people' (anaphora)",
          "Step 5: Practice ritual function - repetition builds energy, invites participation, induces meditative state",
          "Step 6: Listen to Buddhist chants or other ritual repetition - experience the power of repetition"
        ],

        "commonMisinterpretations": [
          "❌ 'Redundant, should condense to one blessing' → ✅ Threefold repetition is ritually functional, creates power through iteration",
          "❌ 'All three blessings say same thing' → ✅ Progression: world peace → household sufficiency → quality of life",
          "❌ 'Poetic decoration' → ✅ Ritual structure essential to prayer efficacy",
          "❌ 'Could be any number of repetitions' → ✅ Three is specific, sacred number - not arbitrary"
        ]
      }
    }
  ],

  "aggregateStatistics": {
    "totalExpressions": 7,
    "uniqueExpressions": 7,
    "totalOccurrences": 13,
    "phrasesCovered": 6,
    "phraseCoverage": "100%",
    "averageCulturalWeight": 7.9,
    "averageComplexity": 7.6,
    "dominantMechanism": "ritual_symbolic_language",
    "culturalRichness": "very_high"
  },

  "collectionContext": {
    "genreClassification": "Ceremonial prayer/blessing song - harvest thanksgiving ritual",

    "culturalSignificance": "Represents syncretic Vietnamese spirituality: indigenous animism (drum worship) + Confucian cosmology (Five Elements, thiên hạ) + rice agriculture. Documents village ritual life.",

    "linguisticProfile": "Formal Vietnamese with classical Sino-Vietnamese vocabulary (Thượng, thiên hạ, thái bình). Northern dialect features. Mix of indigenous (trống, cơm) and classical Chinese borrowings.",

    "performanceContext": "Sung during harvest thanksgiving ceremonies at village drum shrines (giáo trống). Community gathering after successful harvest. Part of annual agricultural ritual cycle.",

    "pedagogicalValue": "Excellent for teaching: 1) Vietnamese cosmology (Five Elements, heaven-earth), 2) Rice culture centrality, 3) Ritual language structure (parallel repetition), 4) Syncretism of traditions, 5) Agricultural ritual year"
  }
}
